{
    "origin_link": "https://oae.uic.edu/discriminationharassment/reporting/",
    "title": "Reporting Discrimination And Harassment | Office for Access and Equity | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Office for Access and Equity     Search the site     Toggle Menu      Search                  Office for Access and Equity      Office for Access and Equity   Main Menu    Sexual Misconduct    Nondiscrimination           Access and Equity Policies, Statements, Guidelines & Information    LGBTQ+ Inclusion    Reporting Discrimination And Harassment    Resources    Sexual Harassment         Disputes           Trainings Offered    Request DRS    DRS Mediators    Agreement to Mediate Form    Additional Resources         Accommodations           Accommodation Request Form    Employee Accommodation Policy    Pregnancy and Postpartum    Religious         Searches           Search Process    Search Resources    Frequently Asked Questions          Eyebrow menu    Reporting    OAE Policies and Guidelines    Lactation Rooms    Trainings    Contact Us    UIC menu    UIC.edu    Campus Map       Search               View Menu           Breadcrumbs   Office for Access and Equity    Nondiscrimination    Reporting Discrimination And Harassment        Reporting Discrimination And Harassment      Reporting Resources        Title IX Coordinator  Receives complaints of sexual misconduct and coordinates response to complaints.          Office for Access and Equity  Handles discrimination, harassment, sexual misconduct, and Title IX matters.          Dean of Students  Facilitates resolution of conflicts and handles student code of conduct violations.          Campus Advocacy Network (CAN)  Provides confidential, free services to UIC community members who have experienced sexual misconduct.          UIC Police Department  Responds to reported crimes that occur on UIC's campus and in adjacent jurisdictions.          Clery CSA Form  Reporting form for Clery and Campus Security Authorities.          Illinois Department of Human Rights (IDHR)  IDHR is the state agency responsible for enforcing the Illinois Human Rights Act.          Equal Employment Opportunity Commission  EEOC has the authority to investigate charges of discrimination against employers.          US Dept of Education Office of Civil Rights  OCR enforces several federal civil rights laws that prohibit discrimination at colleges and universities.           Reporting FAQs     Who Must Report    With regard to students, if a supervisor, executive, administrative staff or faculty member observes sexual harassment or receives a sexual harassment complaint from a student, he or she is obligated to timely report the observation or complaint to the Office for Access and Equity at 312-996-8670 or oae@uic.edu .  With regard to employees, supervisors and persons in positions of authority are obligated to timely report any and all observations and complaints of discrimination and harassment to the Office for Access and Equity at 312-996-8670 or oae@uic.edu .  OAE staff is available to provide counsel and to facilitate effective resolutions.  Under the new Protection of Minors Policy, all University personnel must immediately report cases of suspected child abuse or neglect of minors (children under the age of 18) directly to the Department of Children and Family Services (DCFS) as soon as abuse or neglect is suspected. The duty to report under Illinois law applies to the suspected abuse or neglect of any individual under the age of 18 who is known to the employee, volunteer, or other designated individuals in his or her professional or official capacity. This includes both (a) minors who are currently enrolled at the University or accepted for enrollment (e.g., a 17 year-old student enrolled as an undergraduate); and (b) minors who are not enrolled or accepted for enrollment as students at the University but who participate in a University program designed for minors or who otherwise become known to University personnel in their official or professional capacity.      How Are Reports Reviewed?    All complaints of unlawful harassment and discrimination will be taken seriously.  During an investigation, all parties will receive an equal opportunity to be heard.  The privacy rights of all parties will be respected. While complete confidentiality cannot be promised, disclosure of allegations and findings will be made only to persons with a legitimate need to know.  Given the nature of discrimination, harassment, and sexual harassment, specific investigations and remedies will be determined on a case-by-case basis.  Parties will be notified of the outcome of the complaint and recommendations, if any, made by OAE. Recommendations may include but are not limited to training, discipline, and termination.  UIC policy prohibits retaliatory action against any person who engages in a good faith disclosure of alleged wrongful conduct to a designated University official or public body. It also prohibits retaliatory action towards anyone participating in an investigation of wrongful conduct, such as sexual harassment.              Nondiscrimination           Access and Equity Policies, Statements, Guidelines & Information    LGBTQ+ Inclusion    Reporting Discrimination And Harassment    Resources    Sexual Harassment                    ",
    "outlinks": [
        "https://uic.edu/about/job-opportunities",
        "https://oae.uic.edu/drs/mediators/",
        "https://oae.uic.edu/religious/",
        "https://oae.uic.edu/drs/",
        "https://www.hr.uic.edu/",
        "https://oae.uic.edu/discriminationharassment/resources/",
        "https://oae.uic.edu/drs/additional-resources/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://oae.uic.edu/discriminationharassment/",
        "https://can.uic.edu/",
        "https://library.uic.edu/",
        "https://oae.uic.edu/discriminationharassment/inclusion/",
        "https://oae.uic.edu/discriminationharassment/policies/",
        "https://oae.uic.edu/resources/gender-inclusive-resources/lactation-rooms/",
        "https://oae.uic.edu/drs/agreement/",
        "https://oae.uic.edu/policies-statements-guidelines/",
        "https://oae.uic.edu/ah/search-resources/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://oae.uic.edu/ah/faq/",
        "https://dos.uic.edu/",
        "https://oae.uic.edu/drs/trainings-offered/",
        "https://oae.uic.edu/drs/request-drs/",
        "https://disabilityresources.uic.edu/",
        "https://maps.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://oae.uic.edu/",
        "https://police.uic.edu/",
        "https://uic.edu/",
        "https://wlrc.uic.edu/campus-advocacy-network/",
        "https://oae.uic.edu/educationandtrainings/",
        "https://sexualmisconduct.uic.edu/policy/",
        "https://uihealth.uic.edu/",
        "https://oae.uic.edu/ah/",
        "https://oae.uic.edu/ah/academic-hiring-process/",
        "https://diversity.uic.edu/",
        "https://oae.uic.edu/discriminationharassment/sexual-harassment/",
        "https://oae.uic.edu/contact/",
        "https://drc.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://today.uic.edu/",
        "https://clery.uic.edu/"
    ]
}