{
    "origin_link": "https://ec.uic.edu/state-authorization/",
    "title": "State Authorization | Extended Campus | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the site search form , the site home page .           Extended Campus     Search the site     Toggle Menu      Search                  Extended Campus      Extended Campus   Main Menu    Courses    Programs           Certificate in Nonprofit Management    Grant Writing Workshop    Project Management Courses    Social Enterprise Certificate         Online Pathways    Partner With Us     Eyebrow menu    Contact Us    About    UIC menu    UIC.edu    Campus Map       Search                     State Authorization  State Authorization  The UIC Extended Campus collaborates with representatives from University Administration to ensure compliance with Federal and State regulations concerning the delivery of online courses and programs to out-of-state students. UIC was approved to by the Illinois Board of Higher Education to participate in the National Council for State Authorization Reciprocity Agreements (NC-SARA), which is intended to ease the work load of institutions seeking authorization to deliver online programs in other states. The goal of NC-SARA is to “establish comparable national standards for the interstate offering of postsecondary distance education courses and programs.” NC-SARA allows easier access to online programs for out-of-state students.  Although state authorization requirements vary state to state, institutions participating SARA – including UIC – may offer online programming to students in other SARA member states without seeking authorization in that state. Please be aware, programs that require a professional licensure in your home state may have different requirements. We strongly encourage you to reach out to the appropriate licensing agency in your home state before enrolling in an academic program outside of your home state. For a complete state by state listing of licensing and complaint information, see http://www.online.uillinois.edu/resources/sara.asp .  SARA Member States  As of August 2017, 49 states (excluding California) are participating in SARA. As a result, UIC is able to deliver distance education offerings (e.g. online degrees, certificates and courses) to residents within participating states.                     ",
    "outlinks": [
        "https://ec.uic.edu/grant-writing-workshop/",
        "https://ec.uic.edu/courses/",
        "https://onlinepathways.uic.edu/",
        "https://library.uic.edu/",
        "https://ec.uic.edu/partner-with-us/",
        "https://ec.uic.edu/request-information/",
        "https://uic.edu/",
        "https://ec.uic.edu/cnm/",
        "https://ec.uic.edu/about/",
        "https://ec.uic.edu/",
        "https://ec.uic.edu/programs/",
        "https://uic.edu/about/job-opportunities",
        "https://today.uic.edu/events",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://uihealth.uic.edu/",
        "https://maps.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://ec.uic.edu/projectmanagement/",
        "https://emergency.uic.edu/",
        "https://disabilityresources.uic.edu/",
        "https://today.uic.edu/",
        "https://ec.uic.edu/social-enterprise-certificate/"
    ]
}