{
    "origin_link": "https://ecc.uic.edu/employers/career-fairs/",
    "title": "Career Fairs | Engineering Career Center | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Engineering Career Center     Search the site     Toggle Menu      Search                  Engineering Career Center      Engineering Career Center   Main Menu    Home           College of Engineering    Engineering Alumni    Office of International Services    Student Employment Office (campus jobs)    Career Services    Counseling Center         The Spark           The Spark - ECC Weekly Newsletter    The Spark Archives         Career Tools           Resume    Cover Letter    Searching    Professional Introduction & Connections    LinkedIn    Interviewing    Following Up & Thank You Messages    Offers & Salary    Schedule an Appointment         Students/Alum           Search UICcareers.com    Employment Outcomes    International Students & CPT    Your Identity at Work    Student Organizations    Professional Connections Program    Freshman Internship Program (GPIP)    Transfer Internship Program (GPIP)    Services for Alumni         Employers           Engagement Opportunities    Post Positions on UICcareers.com    2018 Employment Outcomes    Career Fairs    Professional Connections Program-Alumni Mentoring    Senior Design Expo    Hiring International Students         Events           Find Local Events    Career Fair Info         About           Meet the Staff    ECC Info    Schedule an Appointment          Eyebrow menu    Search UICcareers.com    Student Employment Office    UIC menu    UIC.edu    Campus Map       Search               View Menu           Breadcrumbs   Engineering Career Center    Employers    Career Fairs        Career Fairs  Gain access to over 5,000 engineering students within the UIC College of Engineering at our Spring 2020 Engineering & Computer Science Career Fair on February 12th! Come to UIC to recruit from all of our engineering and computer science majors and connect with top talent in Chicago.       career fair      SAVE THE DATE! Fall 2020 Two-Day Engineering & Computer Science Career Fair  Day 1: September 22nd |12 – 4PM | UIC Forum | Majors: Computer Science & Computer Engineering  Day 2: September 23rd |12 – 4PM | UIC Forum | Majors: Bioengineering, Chemical, Civil, Electrical, Industrial, & Mechanical Engineering  Employer Registration Opens in April!       Career Fair FAQ     About         About   The Engineering and Computer Science Career Fair is one of the largest career fairs at UIC. Previous Engineering and Computer Science Career Fairs have drawn over 100 companies and over 2,000 students to the career fair.  It is a wonderful opportunity for employers to recruit entry-level full-time engineers as well as summer interns, co-op students, or even part-time positions or contract positions.  We encourage you to review our Fall 2019 enrollment to learn more about the number of students in each engineering major at UIC.          Career Fair Location & Parking         Location      The Engineering and Computer Science Career Fair will be hosted in the UIC Forum , located at: 725 W. Roosevelt Rd.  Complimentary parking is provided to all registered employers in the Maxwell Street Parking Structure located at: 701 West Maxwell St.  Parking validation is provided at the employer check-in desk.  To drop off career fair materials, we recommend driving to the rear entrance of the Forum located on S. Union Ave. Career fair staff will be there to take your items to your table. You can then continue on to the Maxwell Street Parking Structure to park your vehicle.        Career Fair Schedule         Schedule   Schedule for BOTH FAll 2020 Career Fair Days September 22nd and September 23rd  Day 1 Majors: Computer Science & Computer Engineering  Day 2 Majors: Bioengineering, Chemical, Civil, Electrical, Industrial, & Mechanical Engineering  10:00am – 12:00pm: Employer Arrival and Set-Up, Continental Breakfast Provided  11:00am – 2:00pm: Lunch  12:00pm – 4:00pm: Career Fair Open to Students  4:00pm – 5:00pm: Tear-Down and Employer Departure        Career Fair Contact Information         Contact   If you have any questions related to the Engineering and Computer Science Career Fair, please contact:   Rose Coppola-Conroy, Director   rcconroy@uic.edu  Phone: 312-355-5174      Michelle Mittelman, Associate Director   mittel@uic.edu  Phone: 312-996-2238             Registration Dates, Deadlines, and Payment Information         Payment   Registration Deadlines:   Deadline to Register for Inclusion in Career Fair App and Table Map: Monday, September 14th  Deadline to Register for Ads (email blasts, power point presentation, etc.): Monday, September 14th  Deadline to Register for On-Campus Interviews: Monday, September 14th   Majors: All Engineering and Computer Science   Bioengineering (BioE)  Chemical Engineering (ChemE)  Civil Engineering (Civil)  Computer Science (CS)  Computer Engineering (CompE)  Electrical Engineering (EE)  Industrial Engineering (IE)  Mechanical Engineering (ME)   Career Fair Registration Single Day Rate:  Fee Includes 2 company representatives, one 2’x 6′ table and 2 chairs, electric, WiFi, light breakfast, coffee, lunch, and parking:   Company ($600)  Government & Military ($400)  Non-Profit ($250)  Extra Reps – $50 per extra rep  Additional Table (includes 2 company reps with table purchase) – $150   Career Fair Registration Two-Day Rate:  Fee Includes 2 company representatives, one 2’x 6′ table and 2 chairs, electric, WiFi, light breakfast, coffee, lunch, and parking for both Career Fair Days:   Company ($1000)  Government & Military ($700)  Non-Profit ($450)  Extra Reps – $50 per extra rep  Additional Table (includes 2 company reps with table purchase) – $150   Small Companies of <50 total employees: Please contact a member of the Engineering Career Center Team to discuss on-campus recruitment options.  Payment:  Credit card and check payments are accepted for the Career Fair. Please make checks payable to: University of Illinois at Chicago and send to:  University of Illinois at Chicago (UIC)  Engineering Career Center  Attn: Rose Coppola-Conroy  851 S. Morgan St., Rm 800 SEO  Chicago, IL 60607        Marketing Opportunities: Event Projectors, Weekly Email Blasts, and Poster Signage         ads   Market your company on giant screens within the fair, weekly email blasts, push notifications through our career fair app , 24×36 posters in high-traffic locations, or on our jumbo projector the day-of the career fair!  For companies interested in 24×36 posters and PowerPoint slides, it is ideal if the company provides its own digital design. The UIC Engineering Career Center is happy to print and mount 24×36 posters, and add PowerPoint slides to rotating presentations. A member of our team will follow-up with each company individually to ensure your purchased marketing is to your liking.  Please note that there is limited availability for push notifications and 24×36 posters. This website will be updated once those items are sold out.   $150: Three push notifications and a designation as a “featured” employer in our career fair app .  $250: One 24×36 inch poster displayed in high-traffic area during career fair and ONE PowerPoint slide to be looped on two large projectors during career fair.  $350: Three weekly email blasts leading up to the career fair and ONE PowerPoint slide to be looped on two large projectors during career fair.   For additional questions about marketing opportunities during the career fair, please contact Michelle Mittelman at mittel@uic.edu .  Deadline to receive a refund for Ads is Monday, September 14th.        Cancellation & Refund Policy         Refund policy   Career Fair Registration: A full refund will be provided if a cancellation is received by: Monday, September 14th at 5pm. Refunds will not be processed if an employer does not attend the fair.  Inclement Weather: No refunds will be issued for cancellations caused by inclement weather, or other natural weather events that are outside of our control.  Marketing Opportunities: A full refund will be provided if a cancellation is received by: Monday, September 14th at 5pm.  On Campus Interviews: Due to the high demand for interview room space, cancellations will only be refunded up until Monday, September 14th at 5pm.        Shipping Materials to Career Fair         Shipping   Any career fair materials may be shipped to:  University of Illinois at Chicago (UIC)  Engineering Career Center  Attn: Rose Coppola-Conroy  851 S. Morgan St., Rm 800 SEO  Chicago, IL 60607  Deadline to receive all career fair materials: Friday, September 18th.  If career fair materials are not received at the Engineering Career Center by Friday, September 18th, companies run the risk that their materials may not make it to the UIC Forum in time for the career fair.  Return shipping must be arranged by the employer. At the end of the fair, please complete all shipping labels and arrange for a FedEx or UPS pickup at:  University of Illinois at Chicago (UIC)  Engineering Career Center  851 S. Morgan St., Rm 800 SEO  Chicago, IL 60607            On-Campus Interviews         OCI   On-campus interviews will be hosted at UIC on following the career fair in September (date TBD) in UIC’s Student Center East . We strongly recommend registering early for on-campus interviews space is limited. Interview space is semi-private (potentially two or more employers in one room). White boards are not provided – please bring scratch paper and/or legal pads if you require students to code or solve other technical problems.  Lunch, parking, wifi, water, and coffee included with on-campus interview registration fee.   On-Campus Interviews from 8:30am-5:00pm for up to 3 company representatives: $300  Additional Reps for On-Campus Interviews: $50 per person   Please note that due to the high demand for interview room space, cancellations for on-campus interviews will only be refunded until Monday, September 14th at 5pm. Any employer who cancels on-campus interviews after the September 14th deadline will not be refunded.  Questions about on-campus interviews? Please contact Michelle Mittelman at: mittel@uic.edu .        Tips for Recruiters         tips   As visitors to the UIC campus, you expected to abide by University policies, including sexual harassment policies.  Before the Career Fair:   Complete all registration career fair details carefully. Information provided in your registration (company name, website, positions hiring for, etc.) will be shared with students in the career fair booklet, on the Engineering Career Center website, and our weekly e-newsletter.  We strongly encourage you to post the positions you are recruiting for in UICcareers.com . UICcareers.com is our internal job board exclusively for UIC students and recent alumni. We recommend including information about your presence at the UIC Engineering and Computer Science Career Fair in the position descriptions that you post on UICcareers.com.  If possible, we strongly encourage you to invite UIC alumni working in your companies to help staff your table during the career fair. Alumni ribbons are available at the employer check-in desks and can be a great conversation starter with UIC students.   During the Career Fair:   Please engage with students. Standing in front of your table and welcoming students to speak with you can help to create more meaningful and productive conversations.  If you are open to being contacted by students, consider bringing business cards, or cards with a general company email address on them. Students will feel much better about having a name, or at least an email, to follow-up on applications with.   After the Career Fair:   Contact students you are interested in quickly!  Consider other ways to engage with UIC students on campus via Pop-Up tables, Info Sessions, Tech Talks, On-Campus Interviews, and more.  Contact us if you would like to learn more about additional engagement opportunities on campus, or to hear about additional upcoming career fairs hosted at UIC.                 Employers           Engagement Opportunities    Post Positions on UICcareers.com    2018 Employment Outcomes    Career Fairs    Professional Connections Program-Alumni Mentoring    Senior Design Expo    Hiring International Students                    ",
    "outlinks": [
        "https://ecc.uic.edu/career-toolbox/following-up/",
        "https://ecc.uic.edu/employers/hiring-international-students/",
        "https://library.uic.edu/",
        "https://ecc.uic.edu/students/international-students/",
        "https://ecc.uic.edu/career-toolbox/negotiating/",
        "https://counseling.uic.edu/",
        "https://ecc.uic.edu/",
        "https://uic.edu/",
        "https://ecc.uic.edu/career-toolbox/",
        "https://engineering.uic.edu/",
        "https://careerservices.uic.edu/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://ecc.uic.edu/services-to-employers/",
        "https://ecc.uic.edu/career-toolbox/networking/",
        "https://ecc.uic.edu/students/",
        "https://ecc.uic.edu/career-toolbox/meet/",
        "https://ecc.uic.edu/meet-the-staff/",
        "https://ecc.uic.edu/students/diverse-student-groups/",
        "https://ecc.uic.edu/this-week-archives/",
        "https://ecc.uic.edu/employers/graduation-survey-results/",
        "https://ecc.uic.edu/employers/mentoring-program/",
        "https://ecc.uic.edu/events-2/engineering-career-fair/",
        "https://studentemployment.uic.edu/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://ecc.uic.edu/career-toolbox/interviewing/",
        "https://ecc.uic.edu/career-toolbox/linkedin/",
        "https://uic.edu/about/job-opportunities",
        "https://ecc.uic.edu/students/search-uiccareers/",
        "https://ecc.uic.edu/employers/post-openings-uiccareers/",
        "https://ecc.uic.edu/events-2/find-local-events/",
        "https://ecc.uic.edu/contact/",
        "https://today.uic.edu/events",
        "https://ecc.uic.edu/employers/",
        "https://ecc.uic.edu/students/mentor-students/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://ecc.uic.edu/career-toolbox/go-search/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://ecc.uic.edu/students/graduation-survey-results/",
        "https://uihealth.uic.edu/",
        "https://ecc.uic.edu/events-2/",
        "https://ecc.uic.edu/students/alumni/",
        "https://maps.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://ecc.uic.edu/career-toolbox/resume/",
        "https://ecc.uic.edu/employers/services-to-employers/",
        "https://ecc.uic.edu/students/freshman-internship-program/",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/",
        "https://ecc.uic.edu/students/transfer-internship-program/",
        "https://ecc.uic.edu/career-toolbox/cover-letter/",
        "https://www.ois.uic.edu/",
        "https://ecc.uic.edu/post-openings-uiccareers/"
    ]
}