{
    "origin_link": "https://accc.uic.edu/about/leadership-3/",
    "title": "Leadership | Academic Computing and Communications Center | University of Illinois at Chicago",
    "contents": "                  Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Academic Computing and Communications Center     Search the site     Toggle Menu      Search                  Academic Computing and Communications Center      Academic Computing and Communications Center   Main Menu    Services           Communication and Collaboration    Computing Services    Infrastructure    Professional Services    Research    Security    Teaching and Learning         Support           Academic Continuity    Academic Multimedia Lab and Lightboard Studio    ARC Helpdesk    C-Stop BSB    C-Stop LHS    Daley Library Helpdesk    LTS Support Office         Service Status           Service Notices         News           All News         Forms    About           Identity    Leadership    Policies    Reports    Jobs          Eyebrow menu    WebStore    Online Training    Answers    UIC menu    UIC.edu    Campus Map       Search               View Menu           Breadcrumbs   Academic Computing and Communications Center    About    Leadership        Leadership       Descriptions           Cynthia Herrera Lindstrom: CIO, Executive Director and HIPAA Privacy and Security Officer  Cynthia Herrera Lindstrom serves as UIC’s CIO, helping create and lead the University’s information technology strategy with the input and support of Directors and senior staff. As the UofI HIPAA Privacy and Security Official, Cynthia directs and oversees compliance efforts including policy, training, privacy, security, and the identification of UofI System areas to which HIPAA applies, as well addressing breaches when they happen.             Edward Zawacki: Chief Information Security & Privacy Officer  As Chief Information Security and Privacy Officer/Interim Director of Enterprise Architecture and Development, Ed Zawacki is responsible for developing information security strategy for UIC, and for creating and implementing a university security architecture plan that ensures all information systems are functional and secure. Ed is also responsible for maintaining security standards, policies and guidelines that align with compliance requirements such as FERPA and HIPAA/HITECH.          Jelene Crehan: Interim Director, Network Engineering & Telecommunications  As Interim Director/Assistant Director of Network Engineering and Telecommunications, Jelene is responsible for developing a network infrastructure and data center strategy for UIC as well as  implementing a reliable foundational network to deliver information technology services to the entire campus community. She leads teams responsible for improving and maintaining all data centers, phone services, emergency communication infrastructure, wireless and wired network infrastructures. Jelene is a graduate of UIC with a Bachelor’s degree in Computer Engineering.          Elizabeth Romero, Ph.D.: Director, Learning Technologies & Client Service Solutions  Elizabeth Romero develops strategic planning to ensure technology adoption and client support. She leads the functional teams responsible for the teaching and learning services, the support of services, and the communication and outreach functions including digital content, client statistical analysis, and professional development. Elizabeth’s area of expertise includes large-scale technological change, instructional design, organizational change and leadership, and professional development. Elizabeth earned a Ph.D. in Educational Leadership and Organizational Development from the University of Louisville.           Mark Goedert: Director, IT Strategy and Planning   Mark Goedert has served as a consultant for Electronic Data Systems (EDS), a team member in ACCC Small Systems/LAN, and was tasked to create ACCC PPMO in 2012. Mark handles planning, analyzing, organizing, and advising. A graduate of UIC’s College of Business, with a degree in Information and Decision Sciences, Mark currently serves as Director of the Process and Portfolio Management Office (PPMO).           Himanshu Sharma: Director, ACER  Himanshu Sharma is Director for ACER at ACCC. He acts as a single point of contact for addressing data and computation needs of UIC researchers. His skills include Strategic Development, Business Process Reengineering, IT Service Management, Lean and Six-Sigma, Business Development, High-Performance Computing, Research Administration, Data Science, Qualitative Research Methods, NLP, Machine Learning, Data Analytics and Introductory Genomics Informatics. Himanshu graduated from with an M.S. MIS. He is currently a PhD student focusing on Biomedical and Health Informatics.          Nilton Garcia: Director, Finance and Budget  Nilton Garcia is Director of Finance & Budget at ACCC; managing the Admin and Human Resource teams.  Prior to coming to ACCC he was at the University of Chicago in the Biological Sciences Division as a Senior Finance Analyst.  Nilton also spent time at UIC in the Office of Budgeting and Program Analysis as a Resource and Policy Analyst. Primary focus is to plan, budget, forecast, provide analysis (trend, variance, etc.), provide reporting that can inform decision making for our organization. Nilton graduated from the University of Illinois at Chicago with a Master of Public Administration with a focus on Financial Management and Information & Performance Management.             About           Identity    Leadership    Policies    Reports    Jobs                    ",
    "outlinks": [
        "https://accc.uic.edu/forms/",
        "https://library.uic.edu/",
        "https://accc.uic.edu/support/academic-multimedia-lab/",
        "https://accc.uic.edu/support/daley-library-helpdesk/",
        "https://accc.uic.edu/support/arc-helpdesk/",
        "https://accc.uic.edu/services/teaching-learning/",
        "https://uic.edu/",
        "https://accc.uic.edu/support/lts-support-office/",
        "https://accc.uic.edu/news-highlights/news-2/",
        "https://accc.uic.edu/services/security/",
        "https://accc.uic.edu/service-status/service-notices/",
        "https://accc.uic.edu/support/c-stop-bsb/",
        "https://accc.uic.edu/about/identity/",
        "https://accc.drupal.uic.edu/",
        "https://accc.uic.edu/services/professional-services/",
        "https://accc.uic.edu/services/infrastructure/",
        "https://security.uic.edu/",
        "https://uic.edu/about/job-opportunities",
        "https://accc.uic.edu/service-status/",
        "https://today.uic.edu/events",
        "https://accc.uic.edu/news-highlights/",
        "https://accc.uic.edu/support/c-stop-lhs/",
        "https://itgc.uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://today.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://uihealth.uic.edu/",
        "https://accc.uic.edu/support/academic-continuity/",
        "https://accc.uic.edu/support/",
        "https://maps.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://acer.uic.edu/",
        "https://accc.uic.edu/about/policies/",
        "https://accc.uic.edu/services/",
        "https://accc.uic.edu/services/research-support/",
        "https://accc.uic.edu/about/jobs/",
        "https://accc.uic.edu/about/reports/",
        "https://disabilityresources.uic.edu/",
        "https://accc.uic.edu/",
        "https://emergency.uic.edu/",
        "https://accc.uic.edu/about/",
        "https://go.uic.edu/linkedinlearning"
    ]
}