{
    "origin_link": "https://security.uic.edu/",
    "title": "ACCC Information Security and Privacy Office",
    "contents": "    Skip to Content   Eyebrow Navigation  UIC  Find People  DEPARTMENTS A-Z  LIBRARY  ATHLETICS   Common U I C menu UIC Find People DEPARTMENTS A-Z LIBRARY ATHLETICS               Search for:          Security policies are a primary focus for the Information Security and Privacy Office  Policies     Sensitive information needs to be safe and secure at all times.  Research & Encryption     Keep your sensitive information private and beware of phishing Emails.  Phishing         Skip to Content   Main Navigation  Home  IT Security Program   Unit Information Security Officers (UISOs)  How Does the UIC IT Security Program Affect Me?    Awareness   Week 1: Malware  Week 2: Email Safety  Week 3: Software Safety  Week 4: Authentication  Week 5: Encryption    Contact Us   Main Menu Home IT Security Program Unit Information Security Officers (UISOs) How Does the UIC IT Security Program Affect Me? Awareness Week 1: Malware Week 2: Email Safety Week 3: Software Safety Week 4: Authentication Week 5: Encryption Contact Us         Security Topics IT Security Program  Non-Secure Systems  UISOs  Daily Life?  Data Classifications  Definitions  Overview      ACCC Information Security and Privacy Office    Overview    The mission of the ACCC Information Security and Privacy Office is to protect the UIC community from active and potential security threats.    Efforts     Monitor the health and security of the campus network  Research and advise on current security threats  Assist with the creation of and compliance with University security policy  Ensure compliance with IT legal and regulatory requirements  Security awareness and training   Stay informed!  We are working to bring you informative and engaging content on our website. For now please considering following us on Twitter.  For Security Education, Awareness and News.  Follow @ACCCSecurity             NCSAM National Cyber Security Awareness Month highlights a specific threat each week to raise awareness for cyber security in the UIC community.  NSCAM Poster Campaign           © Copyright 2014-2020 The Board of Trustees of the University of Illinois      Footer Navigation   UIC Website Menu Home  Students  Staff  Research  IT Security Program  Contact Us  Footer Disability Resources  Emergency Information  Privacy Policy  Contact Us  Follow Us  Follow @ACCCSecurity             ",
    "outlinks": [
        "https://security.uic.edu/awareness/",
        "https://www.uic.edu/uic/studentlife/campus/emergency-information.shtml",
        "https://library.uic.edu/",
        "https://security.uic.edu/contact-us/",
        "https://uic.edu/",
        "https://security.uic.edu/policies/uiso/",
        "https://www.uic.edu/uic/search/",
        "https://security.uic.edu/policies/",
        "https://www.uic.edu/uic/studentlife/studentservices/disability.shtml",
        "https://security.uic.edu/awareness/ncsam-2019/week-3-software-safety/",
        "https://security.uic.edu/data-classifications/",
        "https://security.uic.edu/awareness/ncsam-2019/week-4-authentication/",
        "https://www.uic.edu/htbin/ulist/az",
        "https://www.uic.edu/",
        "https://security.uic.edu/awareness/ncsam-2019/week-1-malware/",
        "https://security.uic.edu/awareness/ncsam-2019/week-5-encryption/",
        "https://security.uic.edu/awareness/ncsam-2019/week-2-email-safety/",
        "https://security.uic.edu/students/",
        "https://security.uic.edu/policies/summary/",
        "https://security.uic.edu/policies/definitions/",
        "https://security.uic.edu/research/",
        "https://security.uic.edu/staff/",
        "https://security.uic.edu/overview/",
        "https://security.uic.edu/non-secure-systems/"
    ]
}