{
    "origin_link": "https://ece.uic.edu/undergraduate/ce-major/",
    "title": "Computer Engineering Major | Department of Electrical and Computer Engineering | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Department of Electrical and Computer Engineering     Search the site     Toggle Menu      Search                  Department of Electrical and Computer Engineering      Department of Electrical and Computer Engineering   Main Menu    Undergraduate           Admitted Students    Admissions    Accreditation    CE Major    EE Major    EP Major    Courses    Internships and Jobs    Minors    Student Groups    Student Profiles    Student Resources         Graduate           Admitted Students    Admissions    Courses    MS Program    PhD Program    PhD Dissertations    Post-Graduation Outcomes    Student Profiles    Student Resources         Research           Research Areas    Featured Research    Labs    Research Experiences for Undergraduates    Sponsors         Faculty and Staff           Department Head    Faculty    Emeritus Faculty    Adjunct Faculty    Professional Organizations    Resources    Staff    Open Positions         News    Events     Eyebrow menu    Giving    Alumni    College of Engineering Home    UIC menu    UIC.edu    Campus Map       Search               View Menu           Breadcrumbs   Department of Electrical and Computer Engineering    Undergraduate    Computer Engineering Major        Computer Engineering Major       intro text      A computer engineering major from UIC positions you to develop computer technologies—hardware and software—that increase human capabilities worldwide.  Think of all the things that have changed in computing in the last two decades. Global society is in constant pursuit of computers that are smaller, more powerful, and easier to use. Computer engineering helps to determine not only the nature of the machines we use, but also the type of software they can handle and what that means for people on a day-to-day basis.  Computer engineering is a fast-changing field, and UIC’s Department of Electrical and Computer Engineering provides you with an education that will help you drive and lead those changes—not just keep pace with them.  The computer engineering major is outlined in full detail in UIC’s undergraduate course catalog . The information below offers an overview of what CE majors can expect.       Computer Engineering Major Requirements   Computer engineering majors complete coursework in three categories:   Nonengineering and general education courses: Nonengineering and general education courses provide a foundation in math and science and will make you a well-informed graduate in disciplines outside of computer engineering. You will take 53 credit hours in this area, including chemistry, physics, math, and a range of “chart-your-own-path” classes in categories such as Exploring World Cultures and Understanding the Individual and Society. For details on general education requirements, consult the course catalog .  Required engineering courses: Students earn 58 credit hours from engineering courses that all CE majors must take. These courses—including Circuit Analysis, Introduction to Embedded Systems, and Computer Organization—offer a thorough introduction to the field. For details on these requirements, please consult the course catalog .  Technical electives: CE majors complete 17 credit hours from courses that interest them most and will prepare them for the specific careers or research they have in mind. Examples of technical electives include Pattern Recognition I, Computer Algorithms I, Modern Linear Optics, and Transistors. The full list is in the course catalog .        Academic Tracks Within ECE   The ECE department has identified groups of courses that can help guide your academic planning based on the areas of electrical and computer engineering in which you seek to specialize. You can find descriptions of each track and its associated courses on this page .      Learn More About the Computer Engineering Major        CE degree requirements          ECE course descriptions          Undergrad admissions           Program Educational Objectives: CE Major   As part of our accreditation process, ABET asks our department to capture the overall goals of the electrical and computer engineering programs. These are called our educational program objectives . Within a few years of graduation, our talented graduates will:   Contribute to their employers, organizations, and communities.  Be leaders in their professions around the world and expand engineering knowledge in a variety of communities.  Practice and exhibit high ethical values and communicate effectively with colleagues and the public.  Pursue advanced degrees or become engineers, researchers, innovators, consultants, or entrepreneurs.        Student Outcomes: CE Major   Another part of the ABET accreditation process requires the department to identify the specific knowledge and skills that students are intended to have when they complete their undergraduate education. These are called student outcomes .  Students graduating from the electrical engineering, computer engineering, and engineering physics programs at UIC will have:   an ability to identify, formulate, and solve complex engineering problems by applying principles of engineering, science, and mathematics.  an ability to apply engineering design to produce solutions that meet specified needs with consideration of public health, safety, and welfare, as well as global, cultural, social, environmental, and economic factors.  an ability to communicate effectively with a range of audiences.  an ability to recognize ethical and professional responsibilities in engineering situations and make informed judgments, which must consider the impact of engineering solutions in global, economic, environmental, and societal contexts.  an ability to function effectively on a team whose members together provide leadership, create a collaborative and inclusive environment, establish goals, plan tasks, and meet objectives.  an ability to develop and conduct appropriate experimentation, analyze and interpret data, and use engineering judgment to draw conclusions.  an ability to acquire and apply new knowledge as needed, using appropriate learning strategies.   In the 2019-2020 academic year, 325 students were enrolled at UIC Engineering as computer engineering majors across all class years. The department graduated 36 computer engineering majors in the academic year ending May 2019.      Apply to UIC!  Click here          Undergraduate           Admitted Students    Admissions    Accreditation    CE Major    EE Major    EP Major    Courses    Internships and Jobs    Minors    Student Groups    Student Profiles    Student Resources                    ",
    "outlinks": [
        "https://uic.edu/about/job-opportunities",
        "https://ece.uic.edu/faculty-and-staff/professional-organizations/",
        "https://ece.uic.edu/undergraduate/tracks/",
        "https://ece.uic.edu/undergraduate/",
        "https://ece.uic.edu/faculty-and-staff/faculty-resources/",
        "https://admissions.uic.edu/",
        "https://ece.uic.edu/undergraduate/accreditation/",
        "https://ece.uic.edu/graduate/student-profiles/",
        "https://ece.uic.edu/undergraduate/courses/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://ece.uic.edu/ece-events/",
        "https://ece.uic.edu/graduate/courses/",
        "https://ece.uic.edu/faculty-and-staff/department-head/",
        "https://ece.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://library.uic.edu/",
        "https://ece.uic.edu/ece-research/featured-research/",
        "https://engineering.uic.edu/support/",
        "https://ece.uic.edu/contact/",
        "https://ece.uic.edu/ece-research/sponsors/",
        "https://ece.uic.edu/graduate/phd-dissertations/",
        "https://catalog.uic.edu/ucat/colleges-depts/engineering/ece/bs-ce/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://catalog.uic.edu/ucat/colleges-depts/engineering/ece/",
        "https://ece.uic.edu/undergraduate/ee-major/",
        "https://ece.uic.edu/faculty-and-staff/",
        "https://ece.uic.edu/undergraduate/ep-major/",
        "https://maps.uic.edu/",
        "https://disabilityresources.uic.edu/",
        "https://ece.uic.edu/ece-research/labs/",
        "https://engineering.uic.edu/",
        "https://ece.uic.edu/undergraduate/admitted-students/",
        "https://ece.uic.edu/",
        "https://ece.uic.edu/graduate/admitted-graduate-students/",
        "https://ece.uic.edu/graduate/admissions/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://ece.uic.edu/undergraduate/student-organizations/",
        "https://ece.uic.edu/ece-research/areas/",
        "https://ece.uic.edu/undergraduate/undergraduate-admissions/",
        "https://ece.uic.edu/undergraduate/internships-and-jobs/",
        "https://ece.uic.edu/ece-research/reus/",
        "https://ece.uic.edu/ece-news/",
        "https://uic.edu/",
        "https://ece.uic.edu/faculty-and-staff/faculty/",
        "https://engineeringalumni.uic.edu/",
        "https://ece.uic.edu/ece-research/",
        "https://ece.uic.edu/undergraduate/minors-in-ece/",
        "https://ece.uic.edu/faculty-and-staff/open-positions/",
        "https://ece.uic.edu/undergraduate/student-profiles/",
        "https://ece.uic.edu/graduate/ms-program/",
        "https://uihealth.uic.edu/",
        "https://ece.uic.edu/graduate/phd-program/",
        "https://ece.uic.edu/faculty-and-staff/staff/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://ece.uic.edu/graduate/",
        "https://emergency.uic.edu/",
        "https://ece.uic.edu/undergraduate/student-resources/",
        "https://today.uic.edu/events",
        "https://ece.uic.edu/faculty-and-staff/adjunct-faculty/",
        "https://today.uic.edu/",
        "https://ece.uic.edu/graduate/student-resources/"
    ]
}