{
    "origin_link": "https://iise.students.uic.edu/",
    "title": "Institute of Industrial and Systems Engineers | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the site search form , the site home page .           Student Organizations     Search the site     Toggle Menu      Search                  Student Organizations      Institute of Industrial and Systems Engineers   Main Menu    Officers    Events     Eyebrow menu    UIC College of Engineering Home    UIC menu    UIC.edu    Campus Map       Search                Institute of Industrial and Systems Engineers                Institute of Industrial and Systems Engineers  Institute of Industrial and Systems Engineers at UIC                    Welcome!   The Institute of Industrial and Systems Engineers (IISE) is the world’s largest professional society dedicated solely to the support of the industrial engineering profession and people involved with improving quality and productivity.  With more than 15,000 members and 277 chapters worldwide, IISE’s primary mission is to meet the ever-changing needs of its membership, which includes engineering practitioners and consultants in all industries, engineering managers, engineers in education, research and government and undergraduate and graduate students.  IISE Mission  To provide knowledge, training, networking opportunities and recognition to enhance the skills and effectiveness of the Industrial Engineering profession and those individuals involved with improving quality and productivity.  IISE Vision  To be the premier organization that advances, promotes and unites the industrial and systems engineering profession worldwide.                      ",
    "outlinks": [
        "https://library.uic.edu/",
        "https://disabilityresources.uic.edu/",
        "https://uic.edu/about/job-opportunities",
        "https://maps.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://involvement.uic.edu/",
        "https://engineering.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://emergency.uic.edu/",
        "https://iise.students.uic.edu/officers/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://today.uic.edu/events",
        "https://iise.students.uic.edu/events-2/",
        "https://uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://today.uic.edu/"
    ]
}