{
    "origin_link": "https://www.cs.uic.edu/~wolfson/",
    "title": "Wolfson, Ouri",
    "contents": "  Ouri E. Wolfson   Professor Department of Computer Science University of Illinois at Chicago  Biographical sketch: Ouri Wolfson's main research interests are in \nbig data, distributed systems, \nmobile/pervasive computing, smart city, and connectomics. He received his B.A. degree in mathematics, and his \nPh.D. degree in computer science from Courant Institute of Mathematical \nSciences, New York University . He is currently \nthe Richard and Loan Hill Professor of Computer \nScience at the University of Illinois at \nChicago , \nand an Affiliate Professor in the Department of Computer Science at the University of Illinois at Urbana Champaign . \nHe is the \nfounder of Mobitrac, a high-tech startup \nthat was acquired by Fluensee Co.; and the founder and president of Pirouette Software Inc. which specializes in \nmobile data management.\nHe served as a consultant to Argonne National Laboratory, US Army \nResearch Laboratories, DARPA, and \nNASA. \nBefore joining the University of Illinois he has been on the computer \nscience faculty at the Technion and Columbia University, and a \nMember of Technical Staff at Bell Laboratories. Ouri Wolfson authored over 230 publications, and holds seven patents. He is a Fellow of the Association of Computing \nMachinery (ACM), a Fellow of the American Association for the Advancement of Science (AAAS), a Fellow of the Institute of Electrical and Electronics Engineers (IEEE), and a University of Illinois Scholar for 2009. \nHe co-authored seven award winning papers,\nand \nserved as a Distinguished Lecturer for the \nAssociation of Computing Machinery .\nWolfson was the keynote and distinguished  \nspeaker at leading conferences and universities, most recently the Indo-US Workshop on Big Data Analysis for Transportation Engineering Systems, IITMadras, Chennai, India, Dec. 2016\nand the International Conference on Mobile Data Management (MDM). Ouri Wolfson serves on the editorial boards of several journals, and chaired leading conferences. \nHe is the program co-chair of the 2020 Mobile Data Management (MDM) conference.\nHis research has been funded by the \nNational Science Foundation (NSF), Air Force Office of Scientific Research (AFOSR), Defense \nAdvanced Research Projects Agency (DARPA), NATO, US Army, NASA, the New York State Science and \nTechnology Foundation, Hughes Research Laboratories, \nInformix, Accenture, and Hitachi Co. During 2006-2015 he served as the Principal Investigator on a $3.1M NSF grant to establish a Ph.D. program in the new discipline of Computational Transportation Science .  Full Curriculum \nVitae  Current Projects Directed and Related Publications:   Smart City and Urban Computing  Computational Neuroscience   Completed Projects and Related Publications:   IGERT: Computational Transportation Science\n  .  Mobile Peer-to-Peer computing (Mobi-Dik)\n  .  Moving Objects \n  Databases (DOMINO).  Active \n  Databases.  Adaptive \n  Replication.  Semantic Multicast: \n  Intelligently Sharing Collaborative Sessions.   List of \nPublications    wolfson at \ncs.uic dot edu ",
    "outlinks": [
        "https://www.cs.uic.edu/~wolfson/html/active_db.html",
        "https://www.cs.uic.edu/~wolfson/html/mobile.html",
        "https://www.cs.uic.edu/~wolfson/html/connectomics.html",
        "https://www.cs.uic.edu/~wolfson/html/ouri_publish.html",
        "https://cts.cs.uic.edu/",
        "https://www.cs.uic.edu/",
        "https://www.cs.uic.edu/~wolfson/html/smart-city.html",
        "https://www.cs.uic.edu/~wolfson/html/replic.html",
        "https://www.cs.uic.edu/~wolfson/html/p2p.html",
        "https://www.uic.edu/"
    ]
}