{
    "origin_link": "https://drc.uic.edu/drc-exam-proctoring-form-for-instructors/",
    "title": "DRC Exam Proctoring Form for Instructors | Disability Resource Center | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Disability Resource Center     Search the site     Toggle Menu      Search                  Disability Resource Center      Disability Resource Center   Main Menu    Home    About           Rights and Responsibilities    Accommodations    DRC Staff         Register with DRC           Information About Evaluation and Assessment    Frequently Asked Questions (FAQ)         Faculty           DRC Referral Materials    DRC Exam Proctoring Form for Instructors    Testing Procedures and FAQ    UIC Faculty Accessibility Resource Checklist for Digital Instruction    Guide to Accommodations    Policies and Laws    Universal Design         Report an Issue           Accommodations Complaint Process    Online Reporting of UIC Accessibility Issues         Contact           Contact    DRC Staff    Accommodate Portal          Eyebrow menu    Frequently Asked Questions (FAQ)    UIC menu    UIC.edu    Campus Map       Search               View Menu            DRC Exam Proctoring Form for Instructors      DRC Exam Proctoring Form for Instructors   This form is for Instructors whose student(s) will be taking their exam(s) at the DRC. Exams WILL NOT be administered without this form.    Name(s) of student(s) taking the exam (please list all students in class with submitted LOAs) * Required If a student requests to take an exam for this course at the DRC and their name is not listed above: * Required Please administer the exam to the student Please contact professor first for approval Do not administer the exam to the student Instructor Name (If multiple instructors, please list all) * Required Teaching Assistant Name (if applicable) Course Name and Number (e.g. ACTG 210) * Required Course CRN If multiple sections of this course are offered, please provide course CRN. Instructor Phone Number * Required Instructor UIC Email Address * Required   Preferred Method of Contact * Required Phone Email Tests You may list multiple exam dates by clicking the + symbol to the right of the entry boxes, if you would like the same proctor form to be used all semester. Test Number Test Date How much time is the class given to complete the exam?    Quizzes You may list multiple quiz dates by clicking the + symbol to the right of the entry boxes, if you would like the same proctor form to be used all semester. Quiz Number Quiz Date How much time is the class given to complete this quiz?    When can the student take the test/quiz? * Required   Student must take test/quiz on the day and time as class    Student may take test/quiz at any time on same day as class    Student may take test on another day per written instructor approval.  TIME of the in class exam/quiz: * Required Instructions Please select any materials required or allowed for the exam:   Scantron    Calculator    Blank loose leaf/scratch paper    Blue Book (not provided by DRC)    Periodic Table    Dictionary    Computer    Notes  If a calculator is allowed, please choose which type(s) are allowed: * Required If you do not require other students in the class to use a specific calculator, please choose \"any calculator\" below.   Any calculator    Simple, 4 function calculator    Specify:  If the rest of the class is required to use a specific type of calculator, please specify below: * Required Are there any course specific materials required or allowed for this exam? If yes, please specify. (i.e. model kits, formula sheets, reference texts, etc.) Yes No Please specify what notes are allowed. (i.e. number of pages, one or two sided, note cards, written, typed, etc) * Required Collect all notes when student turns in exam/quiz? Yes No Specify: How do you want the exam returned? * Required Scanned Pick Up List the email address(es) below to send the completed exam back. * Required Specify who will be allowed to pick up the exam. * Required The individual will need to present ID and sign a form confirming receipt. Comments: Send Exam Please email the exam to accesstesting@uic.edu at your earliest convenience or upload with this form.  If one proctor form will be used for the entire semester, please skip this section and email exams directly to accesstesting@uic.edu prior to each exam or quiz with the exam/quiz number, as well as course name and number in the subject line. File   Drop files here or       Additional Information Please submit the form below. If there are any last minute changes to an exam, please call the DRC Testing Coordinators at (312) 413-4811 or email accesstesting@uic,.edu.               This iframe contains the logic required to handle Ajax powered Gravity Forms.                     ",
    "outlinks": [
        "https://drc.uic.edu/",
        "https://drc.uic.edu/facultystaff/disability-policies-laws/",
        "https://library.uic.edu/",
        "https://drc.uic.edu/contact-us/",
        "https://uic.edu/",
        "https://drc.uic.edu/about/",
        "https://forms.uofi.uic.edu/sec/7074059",
        "https://drc.uic.edu/faculty-resources-for-making-online-course-content-accessible/",
        "https://drc.uic.edu/drc-referral-materials/",
        "https://uic.edu/about/job-opportunities",
        "https://drc.uic.edu/facultystaff/faculty/",
        "https://today.uic.edu/events",
        "https://drc.uic.edu/report-an-issue/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://drc.uic.edu/information-about-evaluation-and-assessment/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://drc.uic.edu/about/people/",
        "https://uihealth.uic.edu/",
        "https://drc.uic.edu/universal-design/",
        "https://drc.uic.edu/students-2/new-to-drc/",
        "https://maps.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://drc.uic.edu/frequently-asked-questions-faq/",
        "https://drc.uic.edu/facultystaff/",
        "https://drc.uic.edu/students-2/rights-and-responsibilities/",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/"
    ]
}