{
    "origin_link": "https://securityigert.uic.edu/",
    "title": "IGERT Electronic Security and Privacy: Technological, Human, Enterprise, and Legal Considerations",
    "contents": "              Search this site     Program Overview Sponsors FAQ People Faculty Staff Fellows Associates Alumni Research Publications Curriculum Courses Seminars Outreach International Partners Links And Resources Internships CyberCorps SFS Alumni HS-STEM Scholarships Apply           News ESP-IGERT Calendar Departments Contact Us Sitemap            News     Announcements December 13, 2016, Congratulations to ESP-IGERT Associate Maliheh Monshizadeh  who has accepted a postdoctoral research associate position starting January 2017  at Department of the Computer Science at University of Wisconsin-Madison. December 12, 2016, Congratulations to ESP-IGERT Associate Maliheh Monshizadeh who has defended successfully. Oct. 25, 2016, Congratulations to ESP-IGERT Faculty Stephen Checkoway on being awarded the best paper prize at the 2016 ACM Conference on Computer and Communications Security (CCS)!  CCS and IEEE Security and Privacy are the two top computer security conferences. Sept. 22, 2016, Congratulations to ESP-IGERT Fellow Stacy Blasiola who has accepted a User-Experience Research position in Facebook, after interning there this past summer.  She will be finishing up her PhD this academic year and willmove to Menlo Park next Fall. Feb. 23, 2016, Congratulations to ESP-IGERT Fellow Federica Fornaciari who has accepted an Assistant Professor in the Department of Art and Humanities at National University in La Jolla, California. Jan. 16, 2016, Welcome to the new  ESP-IGERT Fellows:  Jason Archer, Nathanael Bassett, Paul Murray, and Jordan Torf. August 4, 2015, Congratulations to ESP-IGERT Fellow John Pendergrass who has accepted a visiting assistant professor position starting Fall 2015 at department of the College of Business at the Northern Illinois University.  He is teaching in the Operations Management and Information Systems. July 6-10, 2015, ESP-IGERT Fellow Hale Thompson attends International Summer School on Information Security in Bilbao, Spain News Archive >>           Seminars   March 5, 2015, David Wolinsky from Yale University \"Tracking Resistance with Dissent\" February 18, 2015, Ardalan Amiri Sani from Rice University \"Rethinking System Support for I/O Devices\" February 10, 2015, San Kil Cha from Carnegie Mellon University \"Towards Automatic Security Testing of Software \" October 28, 2014, Mark Krivchenia gives a talk about Intellectual Property in Academia and Transfer to Industry April 29, 2014, Professor Mark Grechanik from the CS Department at UIC gives a talk about Research Models in Industry April 15, 2014 , ESP-IGERT and SFS students and Faculty visit the Information Assurance at Argonne National Laboratory . February 24, 2014 , Dr. Svetlana Yarosh from AT&T Research Labs, Designing to Support Strong-Tie Relationships November 14, 2013 , Distinguished Lecturer Jean Camp, Building Trust By Communicating Risk October 31, 2013 , Distinguished Lecturer, Alessandro Acquisti, Privacy in the Age of Augmented Reality October 29, 2013 , Mike Thompson, Multiple OS Rotational Environment: Server Security through Moving Target Defense October 22, 2013 , Dr Jean-Philippe Labruyere, Enterprise Security and Regulatory Compliance September 24, 2013 , ESP-IGERT Fellow Federica Fornaciari, Mapping the Territories of Privacy: Textual Analysis of Privacy Frames in American Mainstream News Seminars Archive > >                       Sign in | Recent Site Activity | Report Abuse | Print Page | Powered By  Google Sites                       ",
    "outlinks": [
        "https://securityigert.uic.edu/research",
        "https://www.cs.uic.edu/~drmark/%E2%80%8E",
        "https://securityigert.uic.edu/curriculum/seminars/designing-to-support-strong-tie-relationships",
        "https://securityigert.uic.edu/research/publications",
        "https://securityigert.uic.edu/outreach",
        "https://securityigert.uic.edu/curriculum/seminars/multiple-os-rotational-environment-server-security-through-moving-target-defense",
        "https://securityigert.uic.edu/outreach/international",
        "https://securityigert.uic.edu/program/sponsors",
        "https://securityigert.uic.edu/contact-us",
        "https://securityigert.uic.edu/system/app/pages/sitemap/hierarchy",
        "https://securityigert.uic.edu/apply",
        "https://securityigert.uic.edu/hs-stem-scholarships",
        "https://securityigert.uic.edu/program/departments",
        "https://securityigert.uic.edu/program",
        "https://securityigert.uic.edu/People/fellows",
        "https://securityigert.uic.edu/curriculum/seminars",
        "https://securityigert.uic.edu/People",
        "https://securityigert.uic.edu/program/overview",
        "https://securityigert.uic.edu/curriculum/seminars/federica-fornaciari-mapping-the-territories-of-privacy-textual-analysis-of-privacy-frames-in-american-mainstream-news",
        "https://securityigert.uic.edu/CyberCorps",
        "https://securityigert.uic.edu/People/alumni",
        "https://securityigert.uic.edu/curriculum/courses",
        "https://securityigert.uic.edu/curriculum",
        "https://securityigert.uic.edu/People/staff",
        "https://securityigert.uic.edu/links",
        "https://securityigert.uic.edu/curriculum/seminars/alessandro-acquisti-privacy-in-the-age-of-augmented-reality",
        "https://securityigert.uic.edu/faq",
        "https://securityigert.uic.edu/People/associates",
        "https://securityigert.uic.edu/internship-announcements",
        "https://securityigert.uic.edu/CyberCorps/sfs-alumni",
        "https://securityigert.uic.edu/curriculum/seminars/research-models-in-industry",
        "https://securityigert.uic.edu/system/app/pages/recentChanges",
        "https://securityigert.uic.edu/curriculum/seminars/it-transfer-in-academia",
        "https://www.uic.edu/",
        "https://securityigert.uic.edu/People/faculty",
        "https://securityigert.uic.edu/events_calendar",
        "https://securityigert.uic.edu/news/newsarchive",
        "https://securityigert.uic.edu/curriculum/seminars/esp-igert-and-sfs-visit-argonne"
    ]
}