{
    "origin_link": "https://counseling.uic.edu/services/usn/",
    "title": "United Support Network | Counseling Center | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Counseling Center     Search the site     Toggle Menu      Search                  Counseling Center      Counseling Center   Main Menu    About Us           Mission and Values    Scope of Practice    Meet Our Staff    Hours & Location         Services           What to Expect    Individual Counseling    Group Therapy    Couples Counseling    Mind Body Services    Psychiatry and Integrative Medicine    Outreach Services and Programs    Peer Support Network         Crisis           Crisis Services    Suicide Prevention and Education at UIC         Online Resources           COVID-19 Newsletters    Mental Health Resources    Coping with Recent Events    Campus Resources    Suicide Prevention and Education at UIC         Concerned Others           For Parents, Faculty, Staff, and Concerned Others    How to Help Someone in Distress         Training           APA Accredited Doctoral Internship Program in Health Service Psychology    Advanced Psychotherapy Externship    Post-Doctoral Fellowship    United Support Network Paraprofessional Program          Eyebrow menu    U&I Care    Student Affairs    UIC menu    UIC.edu    Campus Map       Search               View Menu           Breadcrumbs   Counseling Center    Services    United Support Network        United Support Network  A Supportive Community of Students Helping Students!      Kickback Friday Event Photos       Go to slide 1    Go to slide 2    Go to slide 3                Go to the next slide    Go to the previous slide                 Go to the next slide    Go to the previous slide                 Go to the next slide    Go to the previous slide               United Peer Support Network   The United Support Network is a community of students coming together to support each other through life’s challenges and connect around life experiences!  **In response to COVID-19, we have now created three video support groups through Zoom for the remainder of the Spring 2020 semester: Mondays from 5-6pm, Wednesdays from 2-3pm, and Thursdays from 6-7pm. We will no longer be hosting in-person support groups this semester. Please sign-up below for one of our video groups, and we hope everyone is staying safe during this time!**      Weekly Support Groups   Confidential* and inclusive peer groups, led by trained students, where members can gain support around life’s struggles, form deep connections, and not feel alone in the world as they pursue their goals     Kickback Friday Events   Fun, social, stress-busting events open to both group members and the UIC student body with the goal of building a more connected campus community.          JOIN A GROUP!       Kickback Friday Events        Kickback Friday events for the remainder of the Spring 2020 semester have been canceled as a precautionary measure related to the coronavirus outbreak. Please check back for more events in the future!            Learn More     Learn More!         Learn more   WHAT We offer peer-facilitated support groups (~4-12 students per group) that are cost-free and confidential for all University of Illinois at Chicago students. We also offer monthly, free, social and stress-busting events focused on building connections with other UIC students and supporting our overall wellness as students.  WHO The Weekly Groups are led by students, who have been trained with holistic health and well-being resources to create safe, supportive spaces and facilitate inclusive dialogue around the stresses of everyday life.  WHEN / WHERE Weekly Groups are held on campus in 1-hour time slots. Join us this semester, by signing up above! Group is scheduled for the semester at your convenience, so be sure to indicate times where you are most available! Members are expected to attend each week’s group throughout the semester, which usually last 1 hour.  Separate groups are held for graduate students and undergraduate students. Undergraduate student groups are led by trained undergraduate peers while graduate student groups are led by graduate student peers. Graduate and undergraduate students are welcome to all Kickback Friday events!  THE SUPPORT NETWORK  Our programming is based off a model by The Support Network. For more information about The Support Network and to learn about peer support networks on other campuses, click here: www.thesupportnetwork.org             FAQ     FAQs         FAQ   Is USN only for students?  Yes! USN is created as a resource for students. All students are currently to sign-up for support groups and attend any Kickback Friday events.  What about graduate students?  We are now offering support groups for graduate students, beginning February 2020! Graduate students are also welcome at Kickback Friday events.  Who leads USN’s weekly groups? ​  Weekly Groups are led by UIC students. After an application and interview process, students complete PSCH 386 to master basic counseling skills and gain sensitivity training around various mental health struggles as well as various holistic health and well-being strategies. Group leaders also attend weekly consultation meetings where they receive additional ongoing training.  How do I sign-up?  You can sign up for groups anytime by clicking the link above! You are also welcome to attend our kickback Friday events.  How many students are usually in a specific Weekly Group?  Weekly groups usually consist of 4-12 students.  What happens during group?  Group is a place for members to talk about day-to-day stressors, gain support and strategies from each other, destigmatize mental health, and not have to feel alone! Group leaders will help guide the group around how to utilize the space and make sure it feels safe and inclusive for everyone.  When and where do Weekly Groups meet?  Groups are offered at various times and locations on campus to try to reach as many students as possible. Students can select a time and place that works best with their schedule of various times offered.  Is USN therapy?  USN is not therapy , and members do not enter into a professional relationship with peer leaders. It is a simply a safe, inclusive, and confidential environment for students to engage honestly with one another and support each other through life’s challenges. If you are seeking professional therapy, please contact the Counseling Center at 312-996-3490 to learn about options available.  Are groups confidential?  Yes. Once members join a group, leaders will not share any information that members share in the group with outside parties. We ask that members also agree to not disclose information shared in group with outside parties. Leaders may at times consult about their groups during ongoing trainings to ensure they provide members with a positive experience, but no names or identifying information will be shared to protect member privacy. A few rare exceptions to confidentiality do exist and will be discussed with members when groups begin.  Is weekly group only for students with mental health concerns?  No, weekly group is designed for all students, as we hope to address and promote mental health and well-being for all UIC students.             For questions or more information, please contact Monica Puente or our Counseling Center advisor, Dr. Rob Ballantyne.             mpuent3@uic.edu             rballant@uic.edu          Confidentiality   *A few rare exceptions to confidentiality do exist and will be discussed with members when groups begin          Services           What to Expect    Individual Counseling    Group Therapy    Couples Counseling    Mind Body Services     Koru Mindfulness Workshops    Self-Compassion Workshop    Trauma-Informed Yoga Group    Biofeedback Services      Psychiatry and Integrative Medicine    Outreach Services and Programs    Peer Support Network                    ",
    "outlinks": [
        "https://counseling.uic.edu/online-resources/suicide-prevention-and-education-at-uic/",
        "https://counseling.uic.edu/services/what-to-expect/",
        "https://counseling.uic.edu/training/usn_training/",
        "https://counseling.uic.edu/about-us/scope-of-practice/",
        "https://counseling.uic.edu/training/",
        "https://library.uic.edu/",
        "https://sa.uic.edu/",
        "https://counseling.uic.edu/",
        "https://uic.edu/",
        "https://counseling.uic.edu/training/externship/",
        "https://counseling.uic.edu/services/group-therapy/",
        "https://counseling.uic.edu/online-resources/suicide-prevention-and-education-at-uic/helping-someone-in-distress/",
        "https://dos.uic.edu/uicare.shtml",
        "https://counseling.uic.edu/about-us/mission-and-values/",
        "https://counseling.uic.edu/services/couples-therapy/",
        "https://counseling.uic.edu/crisis-services/",
        "https://counseling.uic.edu/online-resources/",
        "https://dos.uic.edu/infostudents.shtml",
        "https://counseling.uic.edu/faculty-staff-concerned-others/for-parents-facultystaff-and-concerned-others/",
        "https://counseling.uic.edu/online-resources/coping-with-recent-events/",
        "https://counseling.uic.edu/faculty-staff-concerned-others/",
        "https://uic.edu/about/job-opportunities",
        "https://counseling.uic.edu/training/postdoctoral-fellowship/",
        "https://today.uic.edu/events",
        "https://counseling.uic.edu/services/",
        "https://counseling.uic.edu/services/mind-body-services/",
        "https://counseling.uic.edu/news-stories/introducing-counseling-center-e-newsletters/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://today.uic.edu/",
        "https://counseling.uic.edu/about-us/meet-our-staff/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://counseling.uic.edu/about-us/",
        "https://counseling.uic.edu/services/outreach-services-and-programs/",
        "https://counseling.uic.edu/online-resources/mental-health-resources/",
        "https://uihealth.uic.edu/",
        "https://counseling.uic.edu/about-us/hours-and-location/",
        "https://maps.uic.edu/",
        "https://counseling.uic.edu/services/mind-body-services/trauma-informed-yoga-group/",
        "https://counseling.uic.edu/services/individual-therapy/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://emergency.uic.edu/",
        "https://counseling.uic.edu/services/mind-body-services/koru-mindfulness-workshops/",
        "https://disabilityresources.uic.edu/",
        "https://counseling.uic.edu/training/internship/",
        "https://counseling.uic.edu/services/mind-body-services/biofeedback/",
        "https://counseling.uic.edu/services/psychiatry-and-integrative-medicine/"
    ]
}