{
    "origin_link": "https://grad.uic.edu/electronic-thesis-and-dissertation-submission-process/",
    "title": "Electronic Thesis and Dissertation Submission Process | Graduate College | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Graduate College     Search the site     Toggle Menu      Search                  Graduate College      Graduate College   Main Menu    Admissions           Degree Admissions    Application Deadlines         Funding & Awards           Graduate Funding Overview    Fellowships & Awards    Other Funding         Programs           Graduate College Courses    Graduate Program in Neuroscience         Diversity           Recruitment    Fellows Mentoring & Support    DFI Program    PIF Program    PBRC-PREP Program    SROP Undergraduate Program         Academics           Dates & Events    Registration Info    Thesis    Exams & Defense    Policies & Procedures    TA Enrichment    Graduation Info    Student Forms    Student Resources         About Us           Staff Directory    Faculty Listings    Newsletters    Contact Us          Eyebrow menu    Faculty & Staff Resources    Alumni    +Give    UIC menu    UIC.edu    Campus Map       Search               View Menu           Breadcrumbs   Graduate College    Academic Support    Thesis    Electronic Thesis/Dissertation    Electronic Thesis and Dissertation Submission Process        Electronic Thesis and Dissertation Submission Process        Pre-Deposit Considerations   Obtain Academic Program Approval  Academic program approval of the thesis or dissertation consists of two parts:   Committee defense and advisor approval (content and format)  Thesis Reviewer in academic program (format)   1. Advisor and Committee Approval  Adviser/committee approval is indicated by the signed (A) Examination Report and (B) Committee Recommendation Forms .  Signatures from the committee are usually obtained at the end of the defense.  If the committee requests revisions or if the committee indicates a conditional pass on the Examination Report , the revisions most likely will result in a change in pagination or format.  Only after all required content revisions are completed and approved by the advisors/chair should you submit your thesis to the academic program thesis reviewer (unless that person has indicated they also wish to pre-review your document before the final version).  2. Thesis Format Academic Program Reviewer  After all revisions have been approved by your advisor/committee, you will need to submit your thesis to your program’s thesis format reviewer, who will ensure that the format of your thesis meets any departmental requirements. All programs have an assigned thesis reviewer. If you are unsure who the thesis reviewer for your program is, contact your Director of Graduate Studies or program support staff.  Note:  Programs may have different processes for the format review. The student should consult with the program staff or DGS before the defense to understand the processes in that program.       When to Submit the ETD to the Graduate College Thesis Office   Only after you have completed all revisions and corrections requested by your adviser/committee and your departmental thesis format reviewer are you ready to begin the ETD submission process.    ETD Submission Process         Deadlines   For graduation consideration for each academic term there is a deadline by which the thesis must be deposited with the Graduate College Thesis Office.  Thesis deadlines for current and future terms are listed on the Graduate College Academic Calendar.  The ETD and all required deposit materials must be submitted to the Graduate College Thesis Office no later than 4:30 p.m. on the day of the deadline.    Graduate College Academic Calendar         Withholding Release of the ETD for Patent Review   If a thesis needs to be temporarily withheld from public release because there is material in the thesis that is protected by or could potentially be protected by a patent, the student should submit a Thesis Withholding Request Form  to the Office of Technology Management before submitting the thesis for review to the Graduate College.    OTM Thesis Withholding Request         Post-Deposit Considerations   Update your address information in UIC Self-Service  Diplomas are mailed to graduates approximately 9 weeks after the end of the term.  To ensure delivery of the diploma to the correct location, students should enter a “Diploma Address” in your Self-Service account. If there is no “Diploma Address” recorded, the diploma will be sent to your “Mailing Address.”  The Diploma Address may be updated in Self-Service up to three weeks after the end of the term.  After that, contact the Records Office to change the Diploma Address.  UIC Email Account  Your UIC Net ID and email account (i.e. yournetID@uic.edu) remains active for two terms after the term of graduation.  The account may expire earlier if you were not registered the term of official graduation, but will be reactivated post-graduation for two terms.  Submit an Intent to Graduate  Students must submit an online Intent to Graduate no later than the end of the third week (second week of the eight week summer session) of the term of intended graduation.  If, for any reason, you do not graduate that term and new Intent to Graduate must be submitted for the next term of intended graduation.  Participate in Commencement  Participation in the commencement ceremony is voluntary, but you are encouraged to attend.  Commencement ceremonies for Summer and Fall graduates occur in December, and for Spring graduates in May. For information about participation in the campus wide ceremonies and convocations sponsored by colleges and schools see the Commencement website.  Obtain Bound Copies of the Thesis for Personal Use  The copy or copies of the thesis that you deposit with the Thesis Office become the property of the University of Illinois. Theses and dissertations submitted electronically will be made available through UIC Indigo, according to the release option chosen at the time of submission.  The Thesis Office does not provide or distribute thesis copies to students, departments, or anyone else. If you want to have copies of your thesis bound for yourself, your family, or your adviser, you will need to procure them independently.  Options Include:   Book binderies. You can search for binderies on the Web.  Copy shops. Local copy shops (e.g., Kinko’s) can make softcover copies.     Student, Faculty & Staff Self-Service    Commencement Website         Before Submitting your ETD   The ETD submission system you will use to submit your thesis is the result of a partnership between the Graduate College and the University’s digital repository for research and scholarship, UIC Indigo. After your thesis has been approved by the Graduate College Thesis Office, it will become available in UIC Indigo according to the release option you choose during submission.  To begin your ETD submission, your thesis should be formatted according to Graduate College thesis requirements and approved by your department.   The thesis must be submitted as a single Portable Document File (PDF)  The file should be named Lastname_Firstname.pdf (e.g., Smith_John.pdf)  Security settings should not be applied to the PDF file  The PDF file should not contain embedded multimedia  Do not include additional materials (see below) in the PDF file. (Note: For a few tips on getting started with the PDF conversion process, please see our ETD FAQs on PDF conversion. Please note that neither the Thesis Office nor the Library will assist with the conversion of thesis files to PDF, although other campus resources are listed in the FAQs.)In addition to the PDF file of your thesis, you will need:  Any supplemental appendix files. (An appendix page with a brief description of the content of the supplemental file must be included in the main PDF file of the thesis. See the Graduate College thesis requirements for further information.)  A familiarity with the UIC INDIGO deposit agreement  A knowledge of your options regarding the release of your ETD into UIC INDIGO  The names of faculty on the defense committee  Your defense chair’s email address  An active NetID or a temporary password. (If your NetID is no longer active, you will be able to create your own temporary password once you begin the submission process.)     Thesis/Dissertation Publishing Options/Access and Related Information    Electronic Thesis and Dissertation Format    Electronic Thesis and Dissertation FAQ    UIC INDIGO Deposit Agreement         Submit an ETD   After you have submitted your ETD online for review, you will receive a series of emails from the Graduate College Thesis Office that will notify you that we have received your ETD and alert you to any required corrections or other steps you will need to take to complete your thesis deposit. You may also check the status of our review of your ETD, including final approval, at any time by returning to your submission profile via the link provided below.       Submit ETD or Check Current Status       Completing the Deposit of your ETD   Your thesis deposit is not complete until you have made all corrections requested by the Graduate College Thesis Office and have submitted all additional materials required for the deposit.  Additional material (e.g. Survey of Earned Doctorates, etc.) that is required must be submitted by the submission deadline.  Any format corrections required by the Graduate College Thesis Office must be received by the date provided by the Graduate College reviewer.  (Note: The deadline given for any corrections to the ETD submitted to the Graduate College is not the same as the final submission deadline.)       Contact Information      Jim\n    \n    Kollenbroich  Thesis/Dissertation Specialist    Phone:   (312) 996-3958     Email:   jkolle1@uic.edu      View Profile              Academics           Dates & Events    Registration Info    Thesis     Electronic Thesis Dissertation     ETD FAQ    ETD Format    ETD Submission Process      iThenticate Review Procedures    Survey of Earned Doctorates      Exams & Defense     Exams & Defense Forms    Committee Membership Policy      Policies & Procedures    TA Enrichment    Graduation Info    Student Forms    Student Resources                      ",
    "outlinks": [
        "https://uic.edu/about/job-opportunities",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/",
        "https://grad.uic.edu/about/contact-us/",
        "https://my.uic.edu/",
        "https://grad.uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://grad.uic.edu/about/giving/",
        "https://grad.uic.edu/academic-support/ta-enrichment/",
        "https://outlook.uic.edu/",
        "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/",
        "https://today.uic.edu/",
        "https://grad.uic.edu/admissions/",
        "https://grad.uic.edu/academic-support/thesis/etd/thesis-dissertation-publishing-options-access-and-related-information/",
        "https://grad.uic.edu/faculty-staff-resources/",
        "https://grad.uic.edu/diversity/pbrc-prep/",
        "https://grad.uic.edu/programs/graduate-program-in-neuroscience/",
        "https://grad.uic.edu/about/gc-newsletters/",
        "https://oae.uic.edu/sexual-misconduct/",
        "https://grad.uic.edu/diversity/recruitment/",
        "https://library.uic.edu/",
        "https://grad.uic.edu/academic-support/graduate-college-policies/",
        "https://grad.uic.edu/academic-support/exams-defense/",
        "https://grad.uic.edu/academic-support/",
        "https://grad.uic.edu/academic-support/student-resources/graduate-student-forms/",
        "https://grad.uic.edu/academic-support/thesis/",
        "https://uic.edu/about/visit-directions",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://grad.uic.edu/academic-support/registration-information/",
        "https://writingcenter.uic.edu/",
        "https://grad.uic.edu/about/faculty-listings/",
        "https://grad.uic.edu/academic-support/academic-dates-events/",
        "https://grad.uic.edu/academic-support/thesis/etd/",
        "https://disabilityresources.uic.edu/",
        "https://grad.uic.edu/about/",
        "https://maps.uic.edu/",
        "https://grad.uic.edu/funding-awards/",
        "https://grad.uic.edu/academic-support/thesis/etd/electronic-thesis-and-dissertation-submission-process/",
        "https://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://grad.uic.edu/academic-support/thesis/etd/electronic-thesis-and-dissertation-format/",
        "https://grad.uic.edu/diversity/fellows-mentoring-support-initiative/",
        "https://grad.uic.edu/alumni/",
        "https://grad.uic.edu/programs/",
        "https://accc.uic.edu/service/g-suite",
        "https://grad.uic.edu/about/graduate-college-directory/",
        "https://grad.uic.edu/academic-support/exams-defense/exams-defense-forms/",
        "https://events.uic.edu/",
        "https://uic.edu/",
        "https://etd.uic.edu/",
        "https://grad.uic.edu/admissions/deadlines/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/pif/",
        "https://grad.uic.edu/diversity/",
        "https://grad.uic.edu/academic-support/graduation-information/",
        "https://grad.uic.edu/funding-awards/graduate-funding-overview/",
        "https://grad.uic.edu/academic-support/thesis/etd/etd-faq/",
        "https://uihealth.uic.edu/",
        "https://grad.uic.edu/diversity/dfi-program/",
        "https://grad.uic.edu/funding-awards/other-funding/",
        "https://grad.uic.edu/wp-admin",
        "https://grad.uic.edu/academic-support/student-resources/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://grad.uic.edu/academic-support/thesis/ithenticate-review-procedures/",
        "https://grad.uic.edu/academic-support/thesis/survey-of-earned-doctorates/",
        "https://emergency.uic.edu/",
        "https://grad.uic.edu/admissions/degree-admission/",
        "https://wellnesscenter.uic.edu/",
        "https://today.uic.edu/events",
        "https://grad.uic.edu/diversity/srop-program/",
        "https://grad.uic.edu/profiles/kollenbroich-jim/",
        "https://grad.uic.edu/programs/graduate-college-courses/",
        "https://clery.uic.edu/"
    ]
}