{
    "origin_link": "https://securityigert.uic.edu/People/fellows",
    "title": "Fellows - IGERT Electronic Security and Privacy: Technological, Human, Enterprise, and Legal Considerations",
    "contents": "              Search this site     Program Overview Sponsors FAQ People Faculty Staff Fellows Associates Alumni Research Publications Curriculum Courses Seminars Outreach International Partners Links And Resources Internships CyberCorps SFS Alumni HS-STEM Scholarships Apply           News ESP-IGERT Calendar Departments Contact Us Sitemap          People ‎ > ‎   Fellows          Stacy Blasiola is a Ph.D. student in the department of Communication at UIC. Her research interests include legal and societal conceptions of online privacy, media law and policy, and media literacy.  email - web               Renee Powers is a PhD student in the Department of Communication at UIC. Her research interests include privacy and security policies on democratic practices in online spaces    email - web         Peter Snyder is Computer Science Ph.D. student working in the Department of Computer Science at UIC. His research interests include system and web-space security, machine learning, and distributed computing.  email - web            Hale Thompson is a PhD student in the School of Public Health at UIC. His research interests include privacy and security in public health information platforms, mobile technologies for community building  email - web           Ivan Brugere is a PhD student in the Department of Computer Science at UIC. His research interest is in data mining problems related to security and large networks.    email - web           Nathanael Bassett is a Ph.D. student in the department of Communication\nat UIC. His research interests include non-use, user agency and alternative use\npractices  email             Jordan Torf is\n a PhD student in the Computer Science department at UIC. I received by \nBachelors in Mathematics in 2013 from Illinois State University. My \nresearch interests include web security, transactional hardware memory, \nand formal methods  email        Jason Archer is a Ph.D. student in the department of Communication at UIC. His research interests include investigating the challenges and opportunities that haptic media and Human Augmentics pose for the present and future of electronic security and privacy.   email      Atiya Avery is\n a PhD\nstudent in the Department of Information Systems and Decision Sciences. Her\nprimary research interest is organizational information security. With a\nsecondary interest in measuring and mitigating latent biases (especially\ntowards vulnerable populations) associated with emerging analytic capabilities\nand data sources.   email   Carrie O'Connell is a PhD student in the Department of Communication at UIC.  Her primary research focus is the use of digital communication platforms for political and crisis communications. By mapping the connections of obvious and non-obvious relationships in network data.  She evaluate threats and opportunities. .  email   Mark Hallenbeck is a Ph.D. student in the Department of Computer Science at UIC. Formerly, he researched and developed digital job site safety solutions. His current research interests include security and privacy protection with respect to mobile devices and users. email                                  Sign in | Recent Site Activity | Report Abuse | Print Page | Powered By  Google Sites                       ",
    "outlinks": [
        "https://securityigert.uic.edu/research",
        "https://securityigert.uic.edu/research/publications",
        "https://securityigert.uic.edu/outreach",
        "https://securityigert.uic.edu/outreach/international",
        "https://securityigert.uic.edu/program/sponsors",
        "https://securityigert.uic.edu/contact-us",
        "https://securityigert.uic.edu/system/app/pages/sitemap/hierarchy",
        "https://securityigert.uic.edu/apply",
        "https://securityigert.uic.edu/hs-stem-scholarships",
        "https://securityigert.uic.edu/People/fellows/peter-snyder",
        "https://securityigert.uic.edu/program/departments",
        "https://securityigert.uic.edu/program",
        "https://securityigert.uic.edu/People/fellows/hale-thompson",
        "https://securityigert.uic.edu/People/fellows/renee-powers",
        "https://securityigert.uic.edu/curriculum/seminars",
        "https://securityigert.uic.edu/People",
        "https://securityigert.uic.edu/program/overview",
        "https://securityigert.uic.edu/CyberCorps",
        "https://securityigert.uic.edu/People/alumni",
        "https://securityigert.uic.edu/curriculum/courses",
        "https://securityigert.uic.edu/curriculum",
        "https://securityigert.uic.edu/People/staff",
        "https://securityigert.uic.edu/links",
        "https://securityigert.uic.edu/faq",
        "https://securityigert.uic.edu/People/associates/ivan-brugere",
        "https://securityigert.uic.edu/People/associates",
        "https://securityigert.uic.edu/internship-announcements",
        "https://securityigert.uic.edu/CyberCorps/sfs-alumni",
        "https://securityigert.uic.edu/news",
        "https://securityigert.uic.edu/system/app/pages/recentChanges",
        "https://securityigert.uic.edu/People/fellows/stacy",
        "https://www.uic.edu/",
        "https://securityigert.uic.edu/People/faculty",
        "https://securityigert.uic.edu/events_calendar"
    ]
}