{
    "origin_link": "https://securityigert.uic.edu/research/publications",
    "title": "Publications - IGERT Electronic Security and Privacy: Technological, Human, Enterprise, and Legal Considerations",
    "contents": "              Search this site     Program Overview Sponsors FAQ People Faculty Staff Fellows Associates Alumni Research Publications Curriculum Courses Seminars Outreach International Partners Links And Resources Internships CyberCorps SFS Alumni HS-STEM Scholarships Apply           News ESP-IGERT Calendar Departments Contact Us Sitemap          Research ‎ > ‎   Publications     This page contains a list of publications of the ESP-IGERT Fellows, Associates, and Faculty since the start of the program. The publications are listed by year and type.     2014 | 2013 | 2012 | 2011     2014   Conferences    Terri L. Russ, Marne Austin, Renee M. Powers, Jennifer Adams, and Amanda Littauer.(November 2014) Roundtable presented  “Transgressive Pedagogies as a Mode of Social Justice.” at the 2014 National Women’s Studies Association Conference, San Juan, PR. Renee M. Powers  (November 2014)  Paper presented to the 2014 National Women’s Studies Association Conference,“Makeup, Reddit, and Radical Self(ie) Love\", San Juan, PR. Kelly Quinn and Renee M. Powers (October 2015) “Conceptualizing Sharing and Privacy through Reader Comments to Online News.” Paper presented to IR15: Association of Internet Researchers Conference, Daegu, Korea. Renee M. Powers and Kelly Quinn   (2014, September),  Beyond Distributive and Communicative: Sharing is Context-Specific , at\nthe 2014 Social Media and Society Conference, Toronto,Ontario.      2013    2012    Journals   Dong, F., Shatz, S.M., Xu, H., Majumdar, D. (2012). Price Comparison: A Reliable Approach to Identifying Shill Bidding in Online Auctions? Electronic Commerce Research and Applications, 11(2), 171-179.    Books and Book Chapters   Fornaciari, F.*. (in press). The language of technoself: storytelling, symbolic interactionism, and online identity. In R. Luppicini (Ed.), Handbook of Research on Technoself: Identity in a Technological Society. Hershey, PA: Idea Group Publishing.    Conferences   Fornaciari, F*. (2012, March). Uses and gratifications in Wayn: Study of a social network that gives voices to international audiences. Paper presented at the DGI-Conference 2012: Social Media and Web Science, Dusseldorf, Germany.     Kuo, B*. & Chandrasekaran, R. (2012, August). Knowledge Contribution in Online Patient to Patient Health Care Communities. Paper presented at the 18th Americas Conference on Information Systems: AMCIS 2012, Seattle, WA.     Skrupsky, N*., Monshizadeh, M., Bisht, P., Hinrichs, T., Venkatakrishnan, V. N. & Zuck, L. (2012, June). Don’t Repeat Yourself: Automatically Synthesizing Client-side Validation. Paper presented at WebApps 2012: The 3rd USENIX Conference on Web Application Development, Boston, MA.     Warner, R. & Sloan, R. H. (2012, June). Behavioral Advertising:  From One-Sided Chicken to Informational Norms. Paper presentation at the Privacy Law Scholars Conference, Washington, DC.    Kalpana, G., Bisht, P., Venkatachari, P., Sistla, A. P. & Venkatakrishnan, V. N. (2012). SWIPE: Eager Erasure of Sensitive Data in Large Scale Systems Software. In CODASPY '12: Proceedings of the second ACM conference on Data and Application Security and Privacy, (pp. 295-306). New York: ACM.     Feng. M., & Fornaciari, F*. (2012, October). Privacy is dead, long live privacy. The economy of information in the digital age. Paper presented at APC 2012: Amsterdam Privacy Conference, Amsterdam, The Netherlands.    Fornaciari, F*. (2012, October). What’s new about privacy? The evolution of media framing of privacy over the last two decades. Paper presented at APC 2012: Amsterdam Privacy Conference, Amsterdam, The Netherlands.    Presentations  Warner, R. (2012, March). Do Not Track: What Do We Want? What Can We Get?. Presentation at the Conference On Internet Privacy, Social Networks and Data Aggregation, Chicago (Kent College of Law), IL.           2011      Journals  Fornaciari, F. (2011). Framing the Egyptian Revolution: A content analysis of Al Jazeera English and the BBC. Journal of Arab & Muslim Media Research, 4(2-3), 217–229.    Blasiola, S*. (2011). Say, “Cheese!”: Cameras and Bloggers in Wisconsin’s Courtrooms. Reynolds Courts & Media Law Journal 1(2), 197-212.    Books and Book Chapters  Papacharissi, Z. & Gibson, P. (2011). 15 Minutes of Privacy: Privacy, Sociality an Publicity on Social Network Sites. In L. Reinecke & S. Tepte, (Eds.), Privacy Online: Theoretical Approaches and Research Perspectives on the Role of Privacy in the Social Web (pp. 75-89).  New York: Springer.     Venkatakrishnan, V. N. (2011). Web Browser Security and Privacy. In H.C.A. Van Tilborg and S. Jajodia (Eds.), Encyclopedia of Cryptography and Security  (pp. 1372-1373). New York: Springer.     Conferences    Bisht, P., Hinrichs, T., Skrupsky*, N. & Venkatakrishnan, V. N. (2011). WAPTEC: Whitebox Analysis of Web Applications for Parameter Tampering Exploit Construction. In Proceedings of the 18th ACM conference on Computer and communications Security: CCS '11 (pp. 575-586). New York: ACM.      Russom, M., Sloan, R. H. & Warner, R. (2011). Legal Concepts of Privacy Meet Technology: A 50-State Survey. In Proceedings of the Workshop on Governance of Technology, Information, and Policies (pp. 29-37).    Presentations   Jones, S. (2011). Human Augmentics and Persuasive Technologies: Bridging Communication and Computer Science. Invited lecture, University of Oslo, November 21.       * - IGERT Fellows                          Sign in | Recent Site Activity | Report Abuse | Print Page | Powered By  Google Sites                       ",
    "outlinks": [
        "https://securityigert.uic.edu/research",
        "https://securityigert.uic.edu/outreach",
        "https://securityigert.uic.edu/outreach/international",
        "https://securityigert.uic.edu/program/sponsors",
        "https://securityigert.uic.edu/contact-us",
        "https://securityigert.uic.edu/system/app/pages/sitemap/hierarchy",
        "https://securityigert.uic.edu/apply",
        "https://securityigert.uic.edu/hs-stem-scholarships",
        "https://securityigert.uic.edu/program/departments",
        "https://securityigert.uic.edu/program",
        "https://securityigert.uic.edu/People/fellows",
        "https://securityigert.uic.edu/curriculum/seminars",
        "https://securityigert.uic.edu/People",
        "https://securityigert.uic.edu/program/overview",
        "https://securityigert.uic.edu/CyberCorps",
        "https://securityigert.uic.edu/People/alumni",
        "https://securityigert.uic.edu/curriculum/courses",
        "https://securityigert.uic.edu/curriculum",
        "https://securityigert.uic.edu/People/staff",
        "https://securityigert.uic.edu/links",
        "https://securityigert.uic.edu/faq",
        "https://securityigert.uic.edu/research/securityigert.uic.edu/research/publications",
        "https://securityigert.uic.edu/People/associates",
        "https://securityigert.uic.edu/internship-announcements",
        "https://securityigert.uic.edu/CyberCorps/sfs-alumni",
        "https://securityigert.uic.edu/news",
        "https://securityigert.uic.edu/system/app/pages/recentChanges",
        "https://www.uic.edu/",
        "https://securityigert.uic.edu/People/faculty",
        "https://securityigert.uic.edu/events_calendar"
    ]
}