{
    "origin_link": "https://securityigert.uic.edu/People/associates",
    "title": "Associates - IGERT Electronic Security and Privacy: Technological, Human, Enterprise, and Legal Considerations",
    "contents": "              Search this site     Program Overview Sponsors FAQ People Faculty Staff Fellows Associates Alumni Research Publications Curriculum Courses Seminars Outreach International Partners Links And Resources Internships CyberCorps SFS Alumni HS-STEM Scholarships Apply           News ESP-IGERT Calendar Departments Contact Us Sitemap          People ‎ > ‎   Associates        Student Associates       Student Associates are PhD and other graduate students who are interested in training and doing research in electronic security and privacy at ESP-IGERT.   Core interdisciplinary coursework  Early and sustained engagement in cross-departmental and multi-disciplinary research  Concentration in Electronic Security and Privacy at graduation  Internship opportunities  Weekly colloquia  A strong advising and mentoring program  A cohort of fellow ESP-IGERT students who research and learn together  Opportunities to meet and interact with IGERT faculty in multiple settings Students interested in learning and doing research in this area are welcome to apply become an IGERT Associate.  To become an IGERT Associate and take advantage of these opportunities or for any other questions, please contact us at securityigert@uic.edu .       Current Associates                Abeer Alhuzalii  is is a PhD student in the Department of Computer Science at UIC. Her research interests include detecting and preventing security violations in web applications.  email -          Sadegh Momeni  is a PhD student in the Department of Computer Science at UIC. His research is focused on program analysis and security.  email - web          Maliheh Monshizadeh is a second year PhD student in the Department of Computer Science at UIC. Her research interests include security problems of web applications and software analysis.    email - web            Faculty Associates      We welcome collaborations with faculty members interested  in the research themes and focus areas of the ESP-IGERT program. For more information about this type of collaboration and our current projects, contact us at securityigert@uic.edu                         Sign in | Recent Site Activity | Report Abuse | Print Page | Powered By  Google Sites                       ",
    "outlinks": [
        "https://securityigert.uic.edu/research",
        "https://securityigert.uic.edu/research/publications",
        "https://securityigert.uic.edu/outreach",
        "https://securityigert.uic.edu/outreach/international",
        "https://securityigert.uic.edu/program/sponsors",
        "https://securityigert.uic.edu/contact-us",
        "https://securityigert.uic.edu/system/app/pages/sitemap/hierarchy",
        "https://securityigert.uic.edu/apply",
        "https://securityigert.uic.edu/hs-stem-scholarships",
        "https://securityigert.uic.edu/program/departments",
        "https://securityigert.uic.edu/program",
        "https://securityigert.uic.edu/People/fellows",
        "https://securityigert.uic.edu/curriculum/seminars",
        "https://securityigert.uic.edu/People",
        "https://securityigert.uic.edu/program/overview",
        "https://securityigert.uic.edu/CyberCorps",
        "https://securityigert.uic.edu/People/alumni",
        "https://securityigert.uic.edu/curriculum/courses",
        "https://securityigert.uic.edu/curriculum",
        "https://securityigert.uic.edu/People/staff",
        "https://securityigert.uic.edu/links",
        "https://smomen2.people.uic.edu/",
        "https://securityigert.uic.edu/faq",
        "https://securityigert.uic.edu/internship-announcements",
        "https://securityigert.uic.edu/CyberCorps/sfs-alumni",
        "https://securityigert.uic.edu/news",
        "https://securityigert.uic.edu/",
        "https://securityigert.uic.edu/system/app/pages/recentChanges",
        "https://securityigert.uic.edu/People/associates/maliheh-monshizadeh",
        "https://www.uic.edu/",
        "https://securityigert.uic.edu/People/faculty",
        "https://securityigert.uic.edu/events_calendar"
    ]
}