{
    "origin_link": "https://securityigert.uic.edu/program/overview",
    "title": "Overview - IGERT Electronic Security and Privacy: Technological, Human, Enterprise, and Legal Considerations",
    "contents": "              Search this site     Program Overview Sponsors FAQ People Faculty Staff Fellows Associates Alumni Research Publications Curriculum Courses Seminars Outreach International Partners Links And Resources Internships CyberCorps SFS Alumni HS-STEM Scholarships Apply           News ESP-IGERT Calendar Departments Contact Us Sitemap          Program ‎ > ‎   Overview     Program Description         The ESP-IGERT Program provides the opportunity for a unique\ninter-disciplinary education with internationally recognized advisors in\nmultiple disciplines. ESP-IGERT Fellows receive support at $30,000/year for two years\nplus full tuition and fees waivers. Mini-grants and travel allowances are available for\nthe duration of their PhD degree. In particular, our program offers:          A core of\n     interdisciplinary coursework consisting of six courses providing a\n     foundation in technical, \nbusiness, public policy,  and human factors aspects of electronic security and privacy. These courses are counted towards the PhD degree requirements in the students' home departments, so as not to delay the\n     time to PhD completion.  Early and\n     sustained engagement in cross-departmental and multi-disciplinary research\n     projects, including a capstone project in which cross-disciplinary teams\n     of students work on a project guided by experienced team of researchers\n     from the departments of Computer Science, Communication, Information &\n     Decision Science, and Health Informatics.  Two innovative,\n     hands-on internship opportunities through the Industry University\n     Collaborative Research Center on Security, with the possibility of\n     international experience.  Weekly\n     colloquia spanning pertinent topics such as current ethical issues in\n     security and privacy, ethical conduct in research, faculty research, and\n     presentations by visiting scholars and professionals.  A strong\n     advising and mentoring program designed to share the expertise of seasoned\n     researchers and more experienced Fellows.  A cohort of\n     fellow ESP Fellows and Associates who research and learn together in this important\n     emerging discipline.  Program At a Glance                      Eligibility        The ESP-IGERT program is available to PhD students at the University of Illinois at Chicago who demonstrate a strong interest in research and study in electronic security and privacy. Students may join the program as Fellows or as Associates. Fellowships are typically awarded to Fellows during the second and third year of the PhD program. In some cases, however, fellowships may be awarded to outstanding candidates starting from the first year of the PhD program. Each Fellow will fulfill the requirements of their chosen PhD program as well as the requirements of the ESP-IGERT program, and upon graduation will receive both a PhD and a Concentration in Electronic Security and Privacy. To find out more about application requirements and procedures please visit our application page.                       Sign in | Recent Site Activity | Report Abuse | Print Page | Powered By  Google Sites                       ",
    "outlinks": [
        "https://securityigert.uic.edu/People/fellows",
        "https://securityigert.uic.edu/curriculum/courses",
        "https://securityigert.uic.edu/program/departments",
        "https://securityigert.uic.edu/research/publications",
        "https://securityigert.uic.edu/People/associates",
        "https://securityigert.uic.edu/People/alumni",
        "https://securityigert.uic.edu/People/staff",
        "https://securityigert.uic.edu/research",
        "https://securityigert.uic.edu/links",
        "https://securityigert.uic.edu/outreach/international",
        "https://securityigert.uic.edu/program",
        "https://securityigert.uic.edu/hs-stem-scholarships",
        "https://securityigert.uic.edu/contact-us",
        "https://securityigert.uic.edu/CyberCorps/sfs-alumni",
        "https://securityigert.uic.edu/curriculum",
        "https://securityigert.uic.edu/People/faculty",
        "https://securityigert.uic.edu/system/app/pages/sitemap/hierarchy",
        "https://securityigert.uic.edu/internship-announcements",
        "https://securityigert.uic.edu/events_calendar",
        "https://securityigert.uic.edu/news",
        "https://securityigert.uic.edu/CyberCorps",
        "https://securityigert.uic.edu/program/sponsors",
        "https://securityigert.uic.edu/faq",
        "https://securityigert.uic.edu/system/app/pages/recentChanges",
        "https://www.uic.edu/",
        "https://securityigert.uic.edu/curriculum/seminars",
        "https://securityigert.uic.edu/outreach",
        "https://securityigert.uic.edu/People",
        "https://securityigert.uic.edu/apply"
    ]
}