{
    "origin_link": "https://grad.uic.edu/about/faculty-listings/",
    "title": "Faculty Listings | Graduate College | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Graduate College     Search the site     Toggle Menu      Search                  Graduate College      Graduate College   Main Menu    Admissions           Degree Admissions    Application Deadlines         Funding & Awards           Graduate Funding Overview    Fellowships & Awards    Other Funding         Programs           Graduate College Courses    Graduate Program in Neuroscience         Diversity           Recruitment    Fellows Mentoring & Support    DFI Program    PIF Program    PBRC-PREP Program    SROP Undergraduate Program         Academics           Dates & Events    Registration Info    Thesis    Exams & Defense    Policies & Procedures    TA Enrichment    Graduation Info    Student Forms    Student Resources         About Us           Staff Directory    Faculty Listings    Newsletters    Contact Us          Eyebrow menu    Faculty & Staff Resources    Alumni    +Give    UIC menu    UIC.edu    Campus Map       Search               View Menu           Breadcrumbs   Graduate College    About the UIC Graduate College    Faculty Listings        Faculty Listings       Intro Text   Standards for admission to membership in the Faculty of the Graduate College are determined jointly by the Dean and the Executive Committee of the Graduate College.  There are four levels of membership:  Full, Associate, Adjunct and Courtesy.  Note that the levels of membership are different than the professor’s rank of full professor, associate professor, etc., even though some of the same terminology is used for both.       List of UIC Graduate College Faculty   Graduate College Faculty Offline** –  This listing should be used by student and programs forming examination committees. Last updated October 2019.  Graduate College Faculty Online – Graduate Faculty with Full or Associate membership in the Graduate College. This listing does not include retired faculty who retain membership nor does it include Adjunct or Courtesy members.  Consult the complete list above for that information.  **This is a dynamic Excel spreadsheet file.  It is best viewed by downloading and opening in Microsoft Excel.    Graduate College Faculty Offline (Excel Spreadsheet)    Graduate Faculty Online         Membership Categories   Membership Categories  Membership categories of Graduate College Faculty allow different rights and privileges pertaining to student mentoring and serving on student committees.  The following is excerpted from the Bylaws of the Graduate College.    Graduate College Bylaws         Full Membership   Full Membership  Full Membership is granted for the term of employment to tenured or tenure track faculty in a UIC department that houses a program under the umbrella of the Graduate College who have been recommended by the department or other teaching or research divisions and approved by the Dean. In the College of Medicine recommendations for full membership are limited to appointments in the Research Track.  Retired faculty with Full membership automatically retain their memberships at the same level for three years after retirement. In special cases membership can be extended upon request to the Graduate Dean by the Executive Officer attesting to the fact that the nominated faculty is still active in graduate education.       Associate Membership   Associate Membership  Associate members are typically clinical track or non-tenure system faculty whose program wishes to grant them the right to serve as primary advisors to students in that program. Once appointed, Associate members retain their memberships so long as they continue to meet the criteria. Associate Membership is granted upon recommendation to the Dean by the Executive Officer of the department or equivalent unit. The nominating department must take a vote of the Full members of the Graduate Faculty on the question of the candidate’s membership. The results of that vote must accompany the membership request. In exceptional circumstances, distinguished individuals without a UIC appointment may be proposed for Associate membership and approved for a fixed term.  Retired faculty with Associate membership automatically retain their memberships at the same level for three years after retirement. In special cases membership can be extended upon request to the Graduate Dean by the Executive Officer attesting to the fact that the nominated faculty is still active in graduate education.       Adjunct Membership   Adjunct Membership  Adjunct members are typically UIC faculty or other employees who possess expertise that makes it likely and desirable for them to serve repeatedly on graduate student committees. Adjunct members must be UIC employees. They are appointed for three-year (renewable) terms through a recommendation to the Graduate Dean from the Executive Officer of the department or equivalent unit.       Courtesy Membership   Courtesy Membership  Courtesy members are typically non-UIC employees who possess some expertise that makes them desirable members of a particular graduate student committee. Courtesy members are appointed to sit on a specific committee, and need to be reappointed for each committee. Courtesy members are appointed through a recommendation to the Graduate Dean from the Executive Officer of the department or equivalent unit.       Graduate College Faculty Membership Nominations   Graduate College Faculty Membership Nominations  Graduate Faculty do not nominate themselves for membership. The Nomination Form for Graduate College Faculty Membership must be submitted from the Executive Officer’s (typically head or chair) office, of an academic department or equivalent unit that holds a graduate degree program.  If a faculty member is erroneously omitted from the list contact your unit’s Executive Officer.    Nomination Form for Graduate College Faculty Membership            About Us           Staff Directory    Faculty Listings    Newsletters    Contact Us                      ",
    "outlinks": [
        "https://uic.edu/about/job-opportunities",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/",
        "https://grad.uic.edu/about/contact-us/",
        "https://my.uic.edu/",
        "https://grad.uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://grad.uic.edu/about/giving/",
        "https://grad.uic.edu/academic-support/ta-enrichment/",
        "https://outlook.uic.edu/",
        "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/",
        "https://today.uic.edu/",
        "https://grad.uic.edu/admissions/",
        "https://library.uic.edu/",
        "https://grad.uic.edu/faculty-staff-resources/",
        "https://grad.uic.edu/diversity/pbrc-prep/",
        "https://grad.uic.edu/programs/graduate-program-in-neuroscience/",
        "https://grad.uic.edu/about/gc-newsletters/",
        "https://oae.uic.edu/sexual-misconduct/",
        "https://grad.uic.edu/diversity/recruitment/",
        "https://grad.uic.edu/academic-support/graduate-college-policies/",
        "https://grad.uic.edu/academic-support/exams-defense/",
        "https://grad.uic.edu/academic-support/",
        "https://grad.uic.edu/academic-support/student-resources/graduate-student-forms/",
        "https://grad.uic.edu/academic-support/thesis/",
        "https://uic.edu/about/visit-directions",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://grad.uic.edu/academic-support/registration-information/",
        "https://writingcenter.uic.edu/",
        "https://grad.uic.edu/academic-support/academic-dates-events/",
        "https://disabilityresources.uic.edu/",
        "https://grad.uic.edu/about/",
        "https://maps.uic.edu/",
        "https://grad.uic.edu/funding-awards/",
        "https://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://grad.uic.edu/diversity/fellows-mentoring-support-initiative/",
        "https://grad.uic.edu/alumni/",
        "https://grad.uic.edu/programs/",
        "https://accc.uic.edu/service/g-suite",
        "https://grad.uic.edu/about/graduate-college-directory/",
        "https://catalog.uic.edu/gcat/faculty/",
        "https://events.uic.edu/",
        "https://uic.edu/",
        "https://grad.uic.edu/admissions/deadlines/",
        "https://grad.uic.edu/funding-awards/graduate-college-fellowships/pif/",
        "https://grad.uic.edu/diversity/",
        "https://grad.uic.edu/academic-support/graduation-information/",
        "https://grad.uic.edu/funding-awards/graduate-funding-overview/",
        "https://uihealth.uic.edu/",
        "https://grad.uic.edu/diversity/dfi-program/",
        "https://grad.uic.edu/funding-awards/other-funding/",
        "https://grad.uic.edu/wp-admin",
        "https://grad.uic.edu/academic-support/student-resources/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://grad.uic.edu/faculty-staff-resources/governance/graduate-college-bylaws/",
        "https://emergency.uic.edu/",
        "https://grad.uic.edu/admissions/degree-admission/",
        "https://wellnesscenter.uic.edu/",
        "https://today.uic.edu/events",
        "https://grad.uic.edu/diversity/srop-program/",
        "https://grad.uic.edu/programs/graduate-college-courses/",
        "https://clery.uic.edu/"
    ]
}