{
    "origin_link": "https://securityigert.uic.edu/hs-stem-scholarships",
    "title": "HS-STEM Scholarships - IGERT Electronic Security and Privacy: Technological, Human, Enterprise, and Legal Considerations",
    "contents": "              Search this site     Program Overview Sponsors FAQ People Faculty Staff Fellows Associates Alumni Research Publications Curriculum Courses Seminars Outreach International Partners Links And Resources Internships CyberCorps SFS Alumni HS-STEM Scholarships Apply           News ESP-IGERT Calendar Departments Contact Us Sitemap            HS-STEM Scholarships     DHS Scholarships in Cybersecurity and Information Assurance V.N. Venkatakrishnan and Robert Sloan HS-STEM Scholarships is a DHS-funded program designed to train qualified professionals in cybersecurity and information assurance. This program supports graduate (M.S.) US citizen students during the course of their studies and provides excellent working opportunities after graduation. The Computer Science Department in collaboration with the IGERT in Electronic Security and Privacy (ESP-IGERT) has obtained several DHS scholarships for its M.S. students. Benefits Full tuition and fees waivers Stipend of $1800/month Eligibility US citizenship Must be a full time M.S. student in the CS department at UIC. Requirements Must commit to focus coursework on computing security with required courses and activities including CS 487 and 450 and others to be announced shortly Must commit to go at the annual federal job fair and conferences organized by the HS-STEM program (Expenses paid by program). Application Deadlines Fall Semester 2013: August 1, 2013 Spring Semester 2014: November 15, 2013 Application Procedure To apply, you must submit a letter and current (unofficial) transcript. The letter must state: That it is an application for the DHS Scholarship in Computer Security That you are a US citizen The number of credit hours you've completed prior to this semester The number of full time semesters until you will graduate The overall GPA and the GPA in Computer Science A four semester or shorter plan of courses that leads to graduation The name of at least one faculty reference Email the application letter and transcripts to our email at: securityigert@uic.edu For more information write to us at securityigert@uic.edu .                       Sign in | Recent Site Activity | Report Abuse | Print Page | Powered By  Google Sites                       ",
    "outlinks": [
        "https://securityigert.uic.edu/People/fellows",
        "https://securityigert.uic.edu/curriculum/courses",
        "https://securityigert.uic.edu/program/departments",
        "https://securityigert.uic.edu/research/publications",
        "https://securityigert.uic.edu/People/associates",
        "https://securityigert.uic.edu/People/alumni",
        "https://securityigert.uic.edu/People/staff",
        "https://securityigert.uic.edu/research",
        "https://securityigert.uic.edu/links",
        "https://securityigert.uic.edu/outreach/international",
        "https://securityigert.uic.edu/program",
        "https://securityigert.uic.edu/contact-us",
        "https://securityigert.uic.edu/CyberCorps/sfs-alumni",
        "https://securityigert.uic.edu/curriculum",
        "https://securityigert.uic.edu/People/faculty",
        "https://securityigert.uic.edu/system/app/pages/sitemap/hierarchy",
        "https://securityigert.uic.edu/internship-announcements",
        "https://securityigert.uic.edu/events_calendar",
        "https://securityigert.uic.edu/news",
        "https://securityigert.uic.edu/CyberCorps",
        "https://securityigert.uic.edu/program/sponsors",
        "https://securityigert.uic.edu/program/overview",
        "https://securityigert.uic.edu/faq",
        "https://securityigert.uic.edu/system/app/pages/recentChanges",
        "https://www.uic.edu/",
        "https://securityigert.uic.edu/curriculum/seminars",
        "https://securityigert.uic.edu/outreach",
        "https://securityigert.uic.edu/People",
        "https://securityigert.uic.edu/apply"
    ]
}