{
    "origin_link": "https://www.cs.uic.edu/~ifc/research.html",
    "title": "Isabel F. Cruz - Research",
    "contents": "   Research (see also Publications )  My main areas of research are in Database and Information Systems .\nSome of my particular interests are in the following topics ( note about manuscripts here provided):   Semantic Data Integration   Semantic Data\n\t\tIntegration in Hierarchical Domains (with Afsheen Rajendran). IEEE Intelligent\n\t\tSystems, March - April, pp. 66-73, 2003.  Using a Layered Approach for Interoperability on the Semantic Web (with Huiyong\n\t\tXiao). 4th International Conference on Web Information Systems Engineering, Rome, Italy, 2003.  Ontology\n\t\tDriven Data Integration in Heterogeneous Networks (with Huiyong Xiao).\n\t\tComplex Systems in Knowledge-Based Environments, eds. Andreas Tolk and Lakhmi Jain, pages 75-97, Springer, 2009.   Semantic Desktop for Personal Information Management   A Multi-Ontology Approach for Personal Information Management (with Huiyong Xiao).\n\t\t1st Workshop on The Semantic Desktop - Next Generation Personal Information Management and Collaboration Infrastructure,\n\t\tGalway, Ireland, November 2005 (in association with ISWC).  Semantically-Driven Multimedia Querying and Presentation (with Olga Sayenko).\n\t\tManaging Multimedia Semantics, Idea Group Publishing, 2005.  Semantic Organization of Multimedia Data for Meaningful Display (with Olga Sayenko).\n\t\tHCI International Conference, Las Vegas, NV, 2005.  A Layered\n\t\tFramework Supporting Personal Information Integration and Application Design for the Semantic Desktop  (with Huiyong Xiao),  VLDB Journal , vol 17, no. 6, pp 1385-1406, November 2008.   Schema and Ontology Alignment    Exploring a New Approach to the Alignment of Ontologies (with Afsheen Rajendran). Workshop on Semantic Web Technologies for Searching and Retrieving Scientific Data, Sanibel\n\t\tIsland, Florida, 2003.  Structural\n\t\tAlignment Methods with Applications to Geospatial Ontologies (with William\n\t\tSunna). Transactions in GIS, special issue on Semantic Similarity Measurement and Geospatial Applications, eds.\n\t\tKrzystof Janowicz, Martin Raubal, Angela Schwering, Werner Kuhn, vol. 12, no. 6, pages 683-711, December 2008.   Semantic Web and Security   A Role and Attribute\n\t\tBased Access Control System Using Semantic Web Technologies (with Lorenzo Cirio and Roberto Tamassia) , IFIP WG 2.12 and WG 12.4 International Workshop on Semantic Web and Web\n\t\tSemantics (SWWS), Lecture Notes in Computer Science 4806, Springer, pages 1256-1266, 2007.  A Secure Mediator\n\t\tfor Integrating Multiple Level Access Control Policies (with Rigel Gjomemo\n\t\tand Mirko Orsini). 12th International Conference on Knowledge-Based and Intelligent Information & Engineering\n\t\tSystems, XML Security Track, ed. Ernesto Damiani, Zagreb, Croatia, Springer, 2008.  A Location\n\t\tAware Role and Attribute Based Access Control System (Demo Paper) (with\n\t\tRigel Gjomemo, Benjamin Lin, and Mirko Orsini), ACM GIS, 2008.  A Constraint\n\t\tand Attribute Based Security Framework for Dynamic Role Assignment in Collaborative Environments (with Rigel Gjomemo, Benjamin Lin, and Mirko Orsini), CollaborateCom, 2008.   Geospatial Information Systems   Object Interoperability for Geospatial Applications. First Semantic Web Working\n\t\tSymposium, SWWS, Stanford, California, 2001.  Querying Heterogeneous Land Use Data: Problems and Potential (with Nancy Wiegand,\n\t\tDaniel Patterson, Naijun Zhou, Steve Ventura). dg.o 2002, Los Angeles, California, 2002.  Handling Semantic Heterogeneities\n\t\tusing Declarative Agreements (with Afsheen Rajendran, William Sunna, and\n\t\tNancy Wiegand). ACM GIS 2002.  A Web Query System for Heterogeneous Geospatial Data (with Nancy Wiegand, Naijun\n\t\tZhou). Scientific and Statistical Database Management, SSDBM, July 2003, pp. 262-265.  Data Integration\n\t\tfor Querying Geospatial Sources (with Huiyong Xiao).  Geospatial Services\n\t\tand Applications for the Internet, eds. John Sample, Kevin Shaw, Shengru Tu, and Mahdi Abdelguerfi, Springer, pages.113-137,\n\t\t2008.   User Interfaces for Multimedia Information Systems   A User Interface for Distributed Multimedia Database Querying with Mediator Supported\n\t\tRefinement (with Kim James). International Database Engineering and Applications Symposium, IDEAS '99, Montreal,\n\t\tCanada, pp. 433-441, IEEE Press, August 1999.  A Framework for the Dynamic Presentation of Fused Multimedia Databases (with\n\t\tHaiyan Lin, Yuan Feng Huang). International Workshop on Multimedia Information Systems, Ischia, Italy, pp.13-22,\n\t\t2003.  A Layered Architecture\n\t\tfor the Exploration of Heterogeneous Information Using Coordinated Views (with Yuan Feng Huan). IEEE Visual Languages, pp. 11-18, 2004 .  Visualization for the Semantic Web   Web Rendering Systems: Techniques, Classification Criteria, and Challenges (with\n\t\tTiziana Catarci and Stephen Kimani). Visualizing the Semantic Web, eds. V. Geroimenko and C. Chen, Springer Verlag,\n\t\t2002.   Visual Query Languages   Implementation of a Constraint-Based Visualization System (with Peter Leveille,\n\t\tIEEE Visual Languages, pp. 13-20, 2000). Best Paper Award.  As You Like It: Personalized Database Visualization Using a Visual Language (with\n\t\tPeter Leveille, Journal of Visual Languages and Computing, 2001) .  Information and Algorithm Visualization   Visualizing Geometric Algorithms over the Web (with James Baker, Giuseppe Liotta,\n\t\tand Roberto Tamassia, Computational Geometry: Theory and Applications, 12(1-2), pp. 125-152, 1999).   Graph Drawing , and in particular Declarative or Contraint-based Graph Drawing   Graph Drawing Tutorial (with Roberto Tamassia)  3D Graph Drawing with Simulated Annealing (with Joseph P. Twarog). Graph Drawing\n\t\t1995: 162-165  Drawing Graphs by Example Efficiently: Trees and Planar Acyclic Digraphs (with\n\t\tAshim Garg). Graph Drawing 1994: 404-415   Web Information Systems   WebSA: Database Support\n\t\tfor Efficient Web Site Navigation (with Leo Liu and Tony Wu, 5th IFIP\n\t\t2.6 Working Conference on Visual Database Systems (VDB5), Fukuoka - Japan, May 10-12, 2000, Kluwer Academic Publisher).  Measuring Structural Similarity\n\t\tAmong Web Documents: Preliminary Results (with Slava Borisov, Michael\n\t\tMarks, and Tim Webb, 7th International Conference on Electronic Publishing, EP '98, Lecture Notes in Computer Science,\n\t\tVol. 1375, Springer, 1998, pp. 513-524).    Other Links of Interest   Partial publication list in the excellent DBLP Bibliography Database , by Michael Ley .  Research groups and center:   The ADVIS Research\n\t\tGroup - ADVIS publications\n\t\tpage . Database and Information Systems Research Group at UIC .  Mobile Information Systems Research Center . Center for RITES (Research and Instruction\n\t\tin Technologies for Electronic Security)   Electronic Visualization Laboratory at UIC .  Research\n\tgroups in Computer Science at UIC .      Note: The manuscripts provided here are preliminary. The final\nversion of the papers can be obtained from the named sources.    Isabel F. Cruz  ",
    "outlinks": [
        "https://www.cs.uic.edu/~ifc/publications/",
        "https://www.evl.uic.edu/",
        "https://www.rites.uic.edu/",
        "https://www.cs.uic.edu/~ifc/dislnew.html",
        "https://www.cs.uic.edu/~advis/publications/",
        "https://www.cs.uic.edu/~ifc/advis.html",
        "https://www1.cs.uic.edu/CSweb/page.php?audience=public&page=research"
    ]
}