{
    "origin_link": "https://vrupl.evl.uic.edu/projects.htm",
    "title": "LINK",
    "contents": "         Virtual Reality Undergraduate Project Laboratories                About      News         Members         Projects      Feedback      Contact      Links        Projects   The VRUPL will conduct a wide variety of VR related projects, based on student \n\t\t\t\t\t\t\tand faculty interests and available resources. Here are a few of our initial \n\t\t\t\t\t\t\tplans:   Holodeck Project  One of the best ways to learn is through example.  The holodeck is intended \n\t\t\t\t\t\t\t\t\t\tto allow an instructor to create a completely virtual world to make a \n\t\t\t\t\t\t\t\t\t\tdemonstration.  The class will network in to the instructor's world and \n\t\t\t\t\t\t\t\t\t\tinteract while the teacher guides the students.  Virtual UIC  Explore the UIC Campus and find your way to class if you get lost.  This \n\t\t\t\t\t\t\t\t\t\tincludes BSB... No one knows how to work that building!  Virtual Reality Based Laboratory Accidents  Every year hundreds of students and others are injured in laboratory accidents, \n\t\t\t\t\t\t\t\t\t\tin spite of all safety precautions. One reason for this is that people tend to \n\t\t\t\t\t\t\t\t\t\tbecome forgetful and complacent, and stop observing safe laboratory procedures. Those who have experienced laboratory accidents , however, will remember \n\t\t\t\t\t\t\t\t\t\tthose experiences much longer than any set of written rules. Therefore the \n\t\t\t\t\t\t\t\t\t\toverall goal of this project is to produce a set of VR based accident \n\t\t\t\t\t\t\t\t\t\tsimulations, to allow users to experience first-hand the consequences of not \n\t\t\t\t\t\t\t\t\t\tfollowing safe laboratory procedures.  Eight to ten different accident scenarios are planned, each with both an \"obey \n\t\t\t\t\t\t\t\t\t\tthe rule\" and a \"disobey the rule\" option. In order to have the greatest \n\t\t\t\t\t\t\t\t\t\tpossible impact on the widest possible audience, the modules will be developed \n\t\t\t\t\t\t\t\t\t\tin both web-based ( VRML, Java3D, WorldUp ) formats and binary \n\t\t\t\t\t\t\t\t\t\texecutable ( C Programming, WorldToolKit, OpenGL ) formats, and will \n\t\t\t\t\t\t\t\t\t\tbe distributed free of charge via the world wide web.  Development of VR-Based Educational Simulations  This area is a continuation of previous work done at the Virtual Reality in Chemical Engineering Laboratory ( VRiChEL ) \n\t\t\t\t\t\t\t\t\t\tat the University of Michigan in Ann Arbor. Please see that site for further \n\t\t\t\t\t\t\t\t\t\tdetails.  Device Development and Testing  There are two types of projects planned for this general area:   Testing and evaluation of head-mounted displays, wired gloves, tracking \n\t\t\t\t\t\t\t\t\t\tdevices, and other peripheral devices, to determine their usefulness for \n\t\t\t\t\t\t\t\t\t\tPC-based virtual reality. ( Many of the products of VRUPL are intended for \n\t\t\t\t\t\t\t\t\t\tstudent use, who are presumed more likely to have access to high-speed personal \n\t\t\t\t\t\t\t\t\t\tcomputers than Silicon Graphics supercomputers. ) Development of new user interface devices for special purposes. This work may \n\t\t\t\t\t\t\t\t\t\t\tbe done in support of ongoing research at the Electronic \n\t\t\t\t\t\t\t\t\t\t\t\tVisualization Laboratory or independently.   Integration of Physical Equipment and/or Models with VR Display and Interfaces  This area involves a connection between a computer simulation and external \n\t\t\t\t\t\t\t\t\t\tphysical device(s), either as a control interface, or for real-time augmented \n\t\t\t\t\t\t\t\t\t\tdata visualization, or for other purposes. Some possible projects include:   Telerobotics - Interface a ( networked ) computer to a physical model \n\t\t\t\t\t\t\t\t\t\tsuch as a radio controlled car on a small track. Adding a digital video camera \n\t\t\t\t\t\t\t\t\t\tto the front of the car will allow users to remotely operate the car, either \n\t\t\t\t\t\t\t\t\t\tthrough a virtual reality interface or through more traditional computer \n\t\t\t\t\t\t\t\t\t\tcontrol. The controllability of the car can then be compared under three \n\t\t\t\t\t\t\t\t\t\tscenarios: 1. A user in the room with the car, using traditional RC controls. \n\t\t\t\t\t\t\t\t\t\t2. A user with a remote computer screen, controlling the car using camera \n\t\t\t\t\t\t\t\t\t\timagery and Java controls. 3. A remote user with a head-mounted display, wired \n\t\t\t\t\t\t\t\t\t\tglove(s), and/or other VR peripheral devices. ( Note: \"car\" is used as an \n\t\t\t\t\t\t\t\t\t\texample, and could just as easily be a plane, train, lunar rover, etc. ) Real-time visualization of experimental data. A computer equipped with data \n\t\t\t\t\t\t\t\t\t\t\tcollection hardware ( thermocouples, pressure gauges, strain gauges, \n\t\t\t\t\t\t\t\t\t\t\tetc. ) will feed experimental data in real time to a VR-based simulation. \n\t\t\t\t\t\t\t\t\t\t\tThe simulation could be either a realistic or idealized visualization of the \n\t\t\t\t\t\t\t\t\t\t\tprocess from which the data is being collected. Alternatively, augmented \n\t\t\t\t\t\t\t\t\t\t\treality could be utilized to provide a \"heads-up\" overlay of process \n\t\t\t\t\t\t\t\t\t\t\tvisualization on top of the users' view of the real equipment.   Scientific Visualization   Display of GAMESS ( molecular modeling ) data in VRML and/or the \n\t\t\t\t\t\t\t\t\t\tCAVE. Extension of traditional graphical calculational techniques to \n\t\t\t\t\t\t\t\t\t\t\thigher-dimensional space, through the three-dimensional immersive, interactive \n\t\t\t\t\t\t\t\t\t\t\tinterface of VR. ( This project is currently being started as a Masters \n\t\t\t\t\t\t\t\t\t\t\tlevel project, but there are also opportunities for undergraduate \n\t\t\t\t\t\t\t\t\t\t\tassistance. )   Human-Computer Interface  Development of a non hand-mimicking interfaces for wired glove input. E.g., \n\t\t\t\t\t\t\t\t\t\tdevelop manual tools & gestures instead of a virtual hand. ( Sign \n\t\t\t\t\t\t\t\t\t\tlanguage, hand-puppet, marionette interfaces? ) General study of gesture \n\t\t\t\t\t\t\t\t\t\trecognition and gesture-based HCI.       ",
    "outlinks": [
        "https://vrupl.evl.uic.edu/about.htm",
        "https://vrupl.evl.uic.edu/links.htm",
        "https://vrupl.evl.uic.edu/holodeck/",
        "https://www.evl.uic.edu/",
        "https://vrupl.evl.uic.edu/contact.htm",
        "https://vrupl.evl.uic.edu/news.htm",
        "https://vrupl.evl.uic.edu/virtualUIC/virtualUIC.html",
        "https://vrupl.evl.uic.edu/members.htm",
        "https://www.vrupl.evl.uic.edu/vrichel",
        "https://vrupl.evl.uic.edu/LabAccidents/index.htm"
    ]
}