{
    "origin_link": "https://cloudsweeper.cs.uic.edu/",
    "title": "Home | Cloudsweeper",
    "contents": "       Cloudsweeper           Cloudsweeper email tools  Safeguarding your cloud based storage.       Account theft audit    Cleartext password audit    Decrypt messages        Cloudsweeper is a research project being conducted by Peter Snyder and Chris Kanich at the\nUniversity of Illinois at Chicago. We provide tools to help users\nunderstand and control their risks online while also conducting\nresearch to better understand those risks at a systemic level. At\nthis site, you can both use these tools as well as participate in the\nresearch project. Please see our FAQ for more info.  Account theft audit  Securing your email account is incredibly important. What are the\nchances that sensitive information are stored in the email account you\nuse every day? If you were to lose your phone, leave your computer logged in,\nor have your account hacked, the possible harm might extend far further than you\nexpect.  Our account theft audit tool can help you\nget a handle on just how much a cybercriminal could access were they to take over\nyour email account. This tool will scan your account and give you a visualization\nof how many of your accounts hackers could take over if they got access to your\nemail account. The list might surprise you! Cleartext password audit  Passwords are the primary authentication mechanism in use on the web.\nYour email account, social networking account, online banking\naccount, and no doubt several others all rely on a password to\nallow you access. Combined with the fact that people tend to re-use\npasswords, emails like this become a severe security risk:  Your new blog has been successfully set up. You can log in with the following information: Username: chrisk Password: hunter3   As part of an academic study that investigates the intersection between\nsecurity and long-term cloud-based data storage, we have developed a tool\nto help users identify and redact private information. By using this tool,\nyou can preserve the useful but non-sensitive text of an email like that\npictured above while removing the private information. After using\nour tool, the same email will still be in your archive, but will\nhave been modified to appear like the one below. We'll give you a\ncode to print and store in a safe place just in case you need to\nrecover that information in the future.  Your new blog has been successfully set up. You can log in with the following information: Username: chrisk Password: [wImYDaM5DBJZqgLrSYekjQ== ZmwDVbzid7+7LQ6R3uDj+xPnDt1nuxEFDJTxhKPh5T0=]  This process protects you as a user in the case of an\nattacker who gains access to your account, an attacker who can eavesdrop on\nyour Internet session while reading email, or even someone who borrows your\nlaptop while you aren’t looking and starts digging around.  Using these tools should take between three and 30 minutes. The tool will\nrequest access to your email account, and then present to you what we\nthink are private pieces of information that you might not want to keep\naround in your email account (like the example above). We will then allow\nyou to either encrypt or permanently remove all plaintext passwords stored\nin your account, making it more safe in the event of an account\ncompromise. We are collecting non-personal data about some\npeoples' use of this tool as part of our research project. You may\nbe asked to participate in this study. If you consent to\nparticipate in the study, we will only collect non-personal\ninformation about the amount and type of information found and\nredacted, and NEVER keep any of your personally identifiable\ninformation.           Privacy Policy • Frequently Asked Questions      UIC BITSLab       ",
    "outlinks": [
        "https://www.cs.uic.edu/~ckanich/",
        "https://cloudsweeper.cs.uic.edu/faq",
        "https://www.cs.uic.edu/Bits/PeterSnyder",
        "https://www.cs.uic.edu/Bits/",
        "https://cloudsweeper.cs.uic.edu/audit",
        "https://cloudsweeper.cs.uic.edu/privacy",
        "https://cloudsweeper.cs.uic.edu/decrypt",
        "https://cloudsweeper.cs.uic.edu/search"
    ]
}