{
    "origin_link": "https://engineering.uic.edu/news-stories/three-phd-candidates-standout-at-annual-poster-competition/",
    "title": "Three PhD candidates standout at annual poster competition | College of Engineering | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the site search form , the site home page .           College of Engineering     Search the site     Toggle Menu      Search                  College of Engineering      College of Engineering   Main Menu    Undergraduate           Admitted Student Information    Admissions    Advising    Career Outcomes    Diversity    Engineering Expo    FAQ    Majors and Minors    Paid Internships    Scholarships    Student Groups    Student Resources    Women in Engineering         Graduate    Departments    Research           Interdisciplinary Research    Labs and Centers         Support UIC           Donate Online    How to Give    Help Students    Empower Faculty    Capital Projects         About           Dean    Faculty    Administration    Staff    Alumni    Advisory Board    Facilities    Summer Camp    News    Contact          Eyebrow menu    Give    Careers    Alumni    UIC menu    UIC.edu    Campus Map       Search                     Three PhD candidates standout at annual poster competition    by David Staudacher  |  Posted on June 04, 2019         story title      Three PhD candidates in the civil engineering program impressed the judges to win the top spots during the annual Christopher Burke and Susan S. Burke Civil Engineering Poster Competition held in the Department of Civil and Materials Engineering (CME) at UIC in May.  Mohammed Mujtaba Atif won first-place and was awarded $1,500 for his poster titled “Meshfree Modeling of Impact and Penetration into Soil.”  Researching the penetration into the granular media represents a class of complex physical problems, and it has a significance in military defense and commercial applications, which includes subsurface investigation of soil and rock, particularly at inaccessible locations and extraterrestrial surfaces, planetary impact, installation of deep-sea anchors and foundations, nuclear waste disposal, mining, and aircraft landing studies.  Atif is working under the direction of Assistant Professor Sheng Wei Chi in the Computational Mechanics laboratory at UIC and holds him in high regard.  “He is the main pillar of my research structure; he was always there to help and discuss the issues related to the problems,” Atif said. “He initially made sure that I have developed all the knowledge required to breakthrough on the focused research area. He mentored me to think in a researching way, he taught me how to approach a solution even though if it is dark area. He has an astute mind, which ensures that I stay on the right path for solving the problem.”  Ines Torra‐Bilal captured second-place and the $1,000 prize for her poster title “Performance of Precast Connections Under Cyclic Loading.”  Her research focuses on the advantages of precast concrete structural systems, which have been proven to be a cost-efficient alternative to cast-in-place reinforced concrete and structural steel systems.  “The importance of my research is the development, analysis, and behavior of safe and economical precast connections under cyclic loading,” she said. “The connections’ utilization can lead to improved construction time and cost and safer applications under earthquake events in order to limit the failure of precast structures.”  Torra‐Bilal is working under the direction of Dr. Mustafa Mahamid, and lauded him for his advice and encouragement.  “My advisor is Clinical Associate Professor Mustafa Mahamid and this award is truly dedicated to him for his continued guidance, support, and outstanding knowledge he shares with me,” she said. “He always encouraged me to keep going forward and without his persistent help, this award would have not been possible.”  Tanvir Ahamed was awarded third-place winner and $500 for his poster titled “Novel Meta-Heuristic Algorithm for Crowdsourced Urban Delivery in a Dynamic Environment.”  He is investigating the possibility of efficiently using ordinary people (i.e., crowdsources), who can walk, bike or drive to transport freight within cities. The work is based on the increase of on-demand delivery requirements, especially for food, grocery and retail.  “The motivation for the research came from the need to accommodate the explosive growth of e-commerce and reduce urban truck traffic,” Ahamed said. “Traditional employee- and vehicle asset-based deliveries have caused many negative consequences to the urban environment including increased congestion, pollution, wear-and-tear of road infrastructure, and shortage of parking space, which are increasingly at odds with the need and trend of developing livable and sustainable communities.”  He is working under the direction of Associate Professor Bo Zou in the TransLog Laboratory at UIC. He is working with Zou on an NSF funded project, and said he “really appreciate his constant guidance throughout the work.”  A total of 11 students displayed scientific posters, which provided a visual route into their research that engaged faculty, peers, and students. The participants were judged by Dr. Sheng-Wei Chi, Dr. Craig Foster, Dr. Didem Ozevin and Dr. Joseph Schulenberg, all of the civil and materials engineering.  Learn more at about the graduate studies program at http://cme.uic.edu/graduate-studies.      Modified on August 12, 2019                     ",
    "outlinks": [
        "https://engineering.uic.edu/undergraduate/resources/",
        "https://engineering.uic.edu/about/facilities/",
        "https://engineering.uic.edu/about/contact/",
        "https://engineering.uic.edu/undergraduate/",
        "https://library.uic.edu/",
        "https://engineeringalumni.uic.edu/support-uic-college-engineering/",
        "https://ecc.uic.edu/",
        "https://uic.edu/",
        "https://translog.uic.edu/",
        "https://engineering.uic.edu/undergraduate/undergraduate-admissions/",
        "https://engineering.uic.edu/",
        "https://engineering.uic.edu/about/dean/",
        "https://cme.uic.edu/graduate/",
        "https://engineering.uic.edu/undergraduate/student-groups/",
        "https://engineering.uic.edu/about/uic-engineering-summer-camp/",
        "https://engineering.uic.edu/undergraduate/diversity/",
        "https://engineering.uic.edu/about/coe-news/",
        "https://engineering.uic.edu/undergraduate/engineering-expo/",
        "https://engineering.uic.edu/coe-research/centers/",
        "https://engineering.uic.edu/support/how-to-give/",
        "https://engineering.uic.edu/coe-research/",
        "https://engineering.uic.edu/coe-research/interdisciplinary-research/",
        "https://engineering.uic.edu/undergraduate/majors-and-minors/",
        "https://uic.edu/about/job-opportunities",
        "https://engineering.uic.edu/about/",
        "https://today.uic.edu/events",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://today.uic.edu/",
        "https://engineering.uic.edu/about/administration/",
        "https://engineering.uic.edu/undergraduate/scholarships/",
        "https://engineering.uic.edu/support",
        "https://engineering.uic.edu/support/empower-faculty/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://engineering.uic.edu/support/invest-in-capital-projects/",
        "https://uihealth.uic.edu/",
        "https://engineering.uic.edu/about/advisoryboard/",
        "https://maps.uic.edu/",
        "https://engineering.uic.edu/about/staff/",
        "https://engineering.uic.edu/support/help-students/",
        "https://engineering.uic.edu/undergraduate/questions-answers/",
        "https://engineeringalumni.uic.edu/",
        "https://engineering.uic.edu/graduate/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://emergency.uic.edu/",
        "https://engineering.uic.edu/undergraduate/women-in-engineering/",
        "https://engineering.uic.edu/coe-departments/",
        "https://engineering.uic.edu/undergraduate/guaranteed-paid-internship-program/",
        "https://engineering.uic.edu/about/alumni/",
        "https://disabilityresources.uic.edu/",
        "https://engineering.uic.edu/undergraduate/advising/",
        "https://engineering.uic.edu/about/faculty/"
    ]
}