{
    "origin_link": "https://wellnesscenter.uic.edu/news-stories/college-students-and-anxiety/",
    "title": "College Students and Anxiety: How to Manage Your Anxiety | Wellness Center | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the site search form , the site home page .           Wellness Center     Search the site     Toggle Menu      Search                  Wellness Center      Wellness Center   Main Menu    About Us           Need Help?    FAQs    Contact         News & Events           Calendar of Events    Annual Events    Past Events         Resources & Services           Pop-Up Pantry    Individual Consultations    Homeless Assistance    Wellness Supplies    Stress Relief Place    Sexual Health/ Healthy Relationships    Literature Library & Videos    Alcohol & e-CHUG    Studying    Conflict Management    Sleep         Workshops           Workshops Offered    Request a Workshop         Policies           Alcohol and Other Drug    Smoke Free Campus Policy and Fine Payment    Student Disciplinary Policy    Cannabis Policy          Eyebrow menu    UIC Connection    Student Affairs    UIC menu    UIC.edu    Campus Map       Search                     College Students and Anxiety: How to Manage Your Anxiety    Posted on April 20, 2020                          Did you know?:      About 41% of college students report that they experience anxiety  About 36% of college students report that they experience depression  Almost 25% of college students take medication to help manage their mental health concerns  From: https://www.apa.org/monitor/2013/06/college-students        So what does this mean?   First off, it’s ok to not be ok! Mental illness is an illness just like any other. If you have the flu, you go to the doctor, you rest, you take care of yourself…So why is this so hard when we experience depression or anxiety? Sadly, there is a lot of stigma surrounding mental health and mental health treatment. But just like any other illness, it is important to take care of yourself. Don’t worry what others think or say, your top priority needs to be taking care of yourself. Never forget, your feelings and emotions are important and they are valid. The things you are feeling are very real and not “all in your head.” Mental illness is an illness and everyone deserves help and treatment.       What can you do?   If you’re nervous or unsure of where to start, do some research! Whether you’re looking for treatment options or just want to educate yourself, there are so many resources right at your fingertips. If you are looking for resources within the UIC community, you can visit the UIC Counseling Center in the Student Services Building (SSB) in suite 2010 or check out their website at https://counseling.uic.edu/ .    Some other UIC resources include:   UIC Department of Psychiatry’s Neuropsychiatric Institute https://www.psych.uic.edu/clinical/adult-services  Office of Applied Psychological Services https://psch.uic.edu/research-programs/clinical/office-of-applied-psychological-services/   If you’re looking for resources throughout Chicago (or the suburbs!) you can check out the National Alliance on Mental Illness, or NAMI, at https://www.namichicago.org/  If you’re looking for educational or advocacy information look at Hope for the Day at https://www.hftd.org/  If you have a friend or loved one that experiences mental health issues, try to be understanding and supportive! Educate yourself and try to share your resources with them.  College is one of the most stressful things that you will ever experience! If you ever doubt yourself, remember this: you are strong, you are capable, the stress of college is only temporary, and you will be successful!       COVID-19 and Anxiety   Top Ten Strategies to Manage Corona Virus Panic and Anxiety by Light On Anxiety COVID-19 Webinar    Limit usage of TV, internet, and social media concerning the Coronavirus. Do not google or research. Limit checking the latest news about the virus as well as your investments  Key is to find balance between avoidance and over checking  Limit or time how much time you spend on social media    Exercise your mindfulness muscle: practice compassionately disengaging from worries and ruminations and gently bring your attention back to what is most important in your life. Notice when your mind tries to bait you into catastrophic discussions about the imagined future  Watch out for body scanning. Notice when your mind is assessing what physical symptoms you are experiencing and how many relate to coronavirus  Notice when following health recommendations have been compulsions (which feed the anxiety cycle) such as compulsive hand washing. Taking off your clothes before you come into the house, over isolation and seclusion  Remind yourself of the facts: Use credible resources when looking up information such as the CDC and WHO.  Preserves some sense of normalcy: continue doing what you enjoy with modifications.be creative. (exercise inside your home or out in nature instead of at the gym).  Be productive and try new ways of enjoying life: organize a messy cabinet, go on a bike ride, do a jigsaw puzzle, reconnect with your children and family, etc.  Watch for social comparing. For example, “Everyone on social media seems to be enjoying this time with their kids and playing board games and using this time to bond. Why do I want to hide from my kids? I AM THE WORST”  Engage in stress reductions activities: guided meditation, yoga, exercise, gratitude journal, be kind to yourself for what can and cannot do  Seek out professional help. There are plenty of high-quality mental health providers offering web-based support (that is increasingly covered by insurance. Plus, many are offering sliding scales or free services). You need not move through these uncertain times alone.     More Strategies for Managing Coronavirus Panic & Anxiety by Light on Anxiety:      Viewing this as a gift of time  Exercise once a day with the awesome free apps companies are offering  Get outside once a day  FaceTime friends  Be more loving to self and others  Put my attention toward my dog  Cook (and eat), along with some meditation.  Practice living in the moment –  re-read the Power of Now and A New Earth by Eckhart Tolle  Continue to get together with friends virtually  The focus on what we can be grateful for  Take a walk every day listening to my favorite songs  Stop taking my temperature every day  Make more phone calls, especially when I would have ordinarily texted or emailed  Spend at least 30 minutes a day connecting without distraction with my kids and husband  Practice forgiveness towards self and others as we stumble  Stay away from constant newsfeeds  Go for lots of walks with my dog  Continue my meditation practice  Commit to taking care of my physical body  Find purpose in stillness    Additional tips:   Coping strategy  Headspace app  Insight Timer app  Calm app    Avoid negative people by…  Understanding everyone has a different mindset  Respect how they are moving through this crisis  Create your own little bubble to avoid those negative ideas          UIC Counseling Center:  Coping With Stress Related to COVID-19      NAMI  COVID-19 PDF Guide      CDC:  Managing Stress and Anxiety      BBC:  How to Protect Your Mental Health (Article)      Psych Hub Video Library:  Coping with Mental Health During COVID-19       How to Cope with Anxiety          Modified on April 20, 2020                   ",
    "outlinks": [
        "https://uic.edu/about/job-opportunities",
        "https://wellnesscenter.uic.edu/resources-and-services/wellness-supplies/",
        "https://wellnesscenter.uic.edu/news-and-events/",
        "https://wellnesscenter.uic.edu/resources-and-services/conflict-management/",
        "https://wellnesscenter.uic.edu/resources-and-services/",
        "https://www.psych.uic.edu/clinical/adult-services",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://wellnesscenter.uic.edu/about-us/",
        "https://studentaffairs.uic.edu/",
        "https://wellnesscenter.uic.edu/resources-and-services/pop-up-pantry/",
        "https://wellnesscenter.uic.edu/policies/",
        "https://today.uic.edu/",
        "https://library.uic.edu/",
        "https://counseling.uic.edu/news-stories/coping-with-stress-related-to-covid-19/",
        "https://wellnesscenter.uic.edu/resources-and-services/studying-2/",
        "https://wellnesscenter.uic.edu/workshops/",
        "https://connect.uic.edu/",
        "https://wellnesscenter.uic.edu/resources-and-services/literature-library/",
        "https://wellnesscenter.uic.edu/policies/student-disciplinary-policy/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://disabilityresources.uic.edu/",
        "https://wellnesscenter.uic.edu/resources-and-services/sexual-health/",
        "https://wellnesscenter.uic.edu/policies/alcohol-and-other-drug/",
        "https://maps.uic.edu/",
        "https://wellnesscenter.uic.edu/about-us/need-help/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://wellnesscenter.uic.edu/news-and-events/past-events/",
        "https://wellnesscenter.uic.edu/resources-and-services/sleep/",
        "https://wellnesscenter.uic.edu/news-and-events/calendar/",
        "https://uic.edu/",
        "https://wellnesscenter.uic.edu/about-us/contact/",
        "https://wellnesscenter.uic.edu/policies/cannabis-policy/",
        "https://wellnesscenter.uic.edu/news-and-events/annual-events/",
        "https://wellnesscenter.uic.edu/policies/smoke-free-campus-policy-fine-payment/",
        "https://uihealth.uic.edu/",
        "https://psch.uic.edu/research-programs/clinical/office-of-applied-psychological-services/",
        "https://wellnesscenter.uic.edu/workshops/request-a-workshop/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://wellnesscenter.uic.edu/resources-and-services/alcohol-e-chug/",
        "https://wellnesscenter.uic.edu/resources-and-services/stress-relief-place/",
        "https://wellnesscenter.uic.edu/resources-and-services/individual-consultations/",
        "https://counseling.uic.edu/",
        "https://emergency.uic.edu/",
        "https://wellnesscenter.uic.edu/",
        "https://today.uic.edu/events",
        "https://wellnesscenter.uic.edu/resources-and-services/homeless-assistance/",
        "https://wellnesscenter.uic.edu/about-us/faqs/",
        "https://wellnesscenter.uic.edu/workshops/workshops-offered/"
    ]
}