{
    "origin_link": "https://www.cs.uic.edu/~liub/FBS/sentiment-opinion-emotion-analysis.html",
    "title": "Sentiment Analysis, Opinion Mining, Emotion Classification",
    "contents": "        Sentiment Analysis: mining sentiments, opinions, and emotions   Bing Liu  Cambridge University Press, June 2015    Abstract : \nSentiment analysis is the computational study of people’s opinions, sentiments, emotions,\nand attitudes. This fascinating problem is increasingly important in business and\nsociety. It offers numerous research challenges but promises insight useful to anyone\ninterested in opinion analysis and social media analysis.\nThis book gives a comprehensive introduction to the topic from a primarily natural\nlanguage processing point of view to help readers understand the underlying structure\nof the problem and the language constructs that are commonly used to express opinions\nand sentiments. It covers all core areas of sentiment analysis; includes many emerging\nthemes, such as debate analysis, intention mining, and fake-opinion detection; and\npresents computational methods to analyze and summarize opinions. It will be a\nvaluable resource for researchers and practitioners in natural language processing,\ncomputer science, management sciences, and the social sciences.  Teaching and Learning : \nThis book is suitable for students, researchers, and practitioners \ninterested in natural language processing in general, and sentiment analysis, opinion mining, emotion analysis, debate analysis, and intention mining in specific. Lecturers can use the book in class. Get the book      Order from Amazon.com  Order from Cambridge University Press  Download chapter 1 and chapter 2     381 Pages, June 2015. Hardback: ISBN 9781107017894   If you would like an evaluation copy for teaching, please drop me an email.        Table of Contents  Preface Acknowledgments Introduction The Problem of Sentiment Analysis Document Sentiment Classification Sentence Subjectivity and Sentiment Classification Aspect Sentiment Classification Aspect and Entity Extraction Sentiment Lexicon Generation Analysis of Comparative Opinions Opinion Summarization and Search Analysis of Debates and Comments Mining Intentions Detecting Fake or Deceptive Opinions Quality of Reviews Conclusions    Lecture Slides   You can find slides from my sentiment analysis research page.  You may be interested in the following book   Lifelong Machine Learning   Errata List   Nothing yet! Your comments and errata are appreciated. Please drop me an email.    First Draft: by Bing Liu on November 25, 2016. ",
    "outlinks": [
        "https://www.cs.uic.edu/~liub",
        "https://www.cs.uic.edu/~liub/",
        "https://www.cs.uic.edu/~liub/lifelong-learning.html"
    ]
}