{
    "origin_link": "https://www.cs.uic.edu/~liub/FBS/SentimentAnalysis-and-OpinionMining.html",
    "title": "Sentiment Analysis and Opinion Mining",
    "contents": " Sentiment Analysis and Opinion Mining   (Introduction and Survey)   New Book , Bing Liu , Morgan & Claypool Publishers , May 2012 (165 pages) Synthesis Lectures on Human Language Technologies           Sentiment analysis and opinion mining is the field of study that\nanalyzes people's opinions, sentiments, evaluations, attitudes, and\nemotions from written language. It is one of the most active research\nareas in natural language processing and is also widely studied in\ndata mining, Web mining, and text mining. In fact, this research has\nspread outside of computer science to the management sciences and\nsocial sciences due to its importance to business and society as a\nwhole. The growing importance of sentiment analysis coincides with\nthe growth of social media such as reviews, forum discussions, blogs,\nmicro-blogs, Twitter, and social networks. For the first time in\nhuman history, we now have a huge volume of opinionated data\nrecorded in digital form for analysis. Sentiment analysis systems are being applied in almost every\nbusiness and social domain because opinions are central to almost all\nhuman activities and are key influencers of our behaviors. Our beliefs\nand perceptions of reality, and the choices we make, are largely\nconditioned on how others see and evaluate the world. For this\nreason, when we need to make a decision we often seek out the\nopinions of others. This is true not only for individuals but also for\norganizations.  Teaching and Learning : \nThis book is a comprehensive introductory and survey text. It covers\nall important topics and the latest developments in the field with\nover 400 references. It is suitable for students, researchers and\npractitioners who are interested in social media analysis in general\nand sentiment analysis in particular. Lecturers can readily use it in\nclass for courses on natural language processing, social media\nanalysis, text mining, and data mining. Order the book      Download from Morgan & Claypool Publishers . It is free if your institution has license with the publisher (over 400 such institutions worldwide). Buy printed copy from Amazon.com  Write to info@morganclaypool.com to request a desk copy.    167 Pages, May 2012. Paperback: ISBN 9781608458844 eBook: ISBN 9781608458851 Get the draft here   If you need an evaluation copy for teaching, you can drop me an email also.       Table of Contents ( full version ) - ( 403 references )   Preface  Chapter 1 : Sentiment Analysis: A Fascinating Problem 1.1 Sentiment Analysis Applications 1.2 Sentiment Analysis Research 1.3 Opinion Spam Detection 1.4 What.s Ahead Chapter 2 : The Problem of Sentiment Analysis 2.1 Problem Definitions 2.2 Opinion Summarization 2.3 Different Types of Opinions 2.4 Subjectivity and Emotion 2.5 Author and Reader Standing Point 2.6 Summary Chapter 3 : Document Sentiment Classification 3.1 Sentiment Classification Using Supervised Learning 3.2 Sentiment Classification Using Unsupervised Learning 3.3 Sentiment Rating Prediction 3.4 Cross-Domain Sentiment Classification 3.5 Cross-Language Sentiment Classification 3.6 Summary Chapter 4 : Sentence Subjectivity and Sentiment Classification 4.1 Subectivity Classification 4.2 Sentence Sentiment Classification 4.3 Dealing with Conditional Sentences 4.4 Dealing with Sarcastic Sentences 4.5 Cross-language Subjectivity and Sentiment Classification 4.6 Using Discourse Information for Sentiment Classification 4.7 Summary Chapter 5 : Aspect-based Sentiment Analysis 5.1 Aspect Sentiment Classification 5.2 Basic Rules of Opinions and Compositional Semantics 5.3 Aspect Extraction 5.4 Identifying Resource Usage Aspect 5.5 Simutaneous Opinion Lexicon Expansion and Aspect Extraction 5.6 Grouping Aspects into Categories 5.7 Entity, Opinion Holder and Time Extraction 5.8 Coreference Resolution and Word Sense Disambiguation 5.9 Summary Chapter 6 : Sentiment Lexicon Generation 6.1 Dictionary-based Approach 6.2 Corpus-based Approach 6.3 Desirable and Undesirable Facts 6.4 Summary Chapter 7: Opinion Summarization 7.1 Aspect-based Opinion Summarization 7.2 Improvements to Aspect-based Opinion Summarization 7.3 Contrastive View Summarization 7.4 Traditional Summarization 7.5 Summary Chapter 8 : Analysis of Comparative Opinions 8.1 Problem Definitions 8.2 Identify Comparative Sentences 8.3 Identifying Preferred Entities 8.4 Summary Chapter 9 : Opinion Search and Retrieval 9.1 Web Search vs. Opinion Search 9.2 Existing Opinion Retrieval Techniques 9.3 Summary Chapter 10 : Opinion Spam Detection 10.1 Types of Spam and Spamming 10.2 Supervised Spam Detection 10.3 Unsupervised Spam Detection 10.4 Group Spam Detection 10.5 Summary Chapter 11 : Quality of Reviews 11.1 Quality as Regression Problem 11.2 Other Methods 11.3 Summary Chapter 12 : Concluding Remarks  Bibliography (with 403 references)    Lecture Slides: PDF   This set of (215) slides has been used in a few tutorials at AAAI-2011, EACL-2012 and Sentiment Anlaysis Symposium 2012. But the book has much more content. References: you can download the book references on the right.  You may be interested in the following links   My Sentiment Analysis and Opinion Mining research page  Sentiment lexicon, annotated and un-annotated data, and much more ...  My Opinion Spam Detection research page  Detect fake reviews, reviewers, and reviewer groups  Some Media Coverages about my research on the topic   Errata List   Nothing yet Your comments and errata are appreciated. Please drop me an email if you have any.       First Draft: by Bing Liu on May 24, 2012.  ",
    "outlinks": [
        "https://www.cs.uic.edu/~liub/FBS/sentiment-analysis.html",
        "https://www.cs.uic.edu/~liub/FBS/media-coverage.html",
        "https://www.cs.uic.edu/~liub",
        "https://www.cs.uic.edu/~liub/FBS/fake-reviews.html"
    ]
}