{
    "origin_link": "https://www.cs.uic.edu/~rfathony/",
    "title": "Rizal Fathony - University of Illinois at Chicago (UIC)",
    "contents": "      Rizal Fathony     PhD Student @ UIC CS   EMAIL  rfatho2 at uic dot edu rizalzaf at gmail dot com   rizal.fathony.org redirects here  LinkedIn profile             Curriculum Vitae  About Me  Research  Publications  Awards  Experience          I graduated from UIC and moved to CMU as a post-doctoral fellow. Please visit my new homepage .  This page is no longer maintained.     About Me    I am Rizal Fathony [full name: Rizal Zaini Ahmad Fathony], a final-year PhD student at the Department of Computer Science , University of Illinois at Chicago . I work with my advisor Prof. Brian Ziebart in statistical machine learning theory and applications.\r\n\t\t\t\t Before attending PhD program at UIC, I completed Bachelor of Applied Science degree in Statistical Computing from the Institute of Statistics, Jakarta, Indonesia and Master of Science in Computer Science from the University of Illinois at Chicago .     Research   Performance-Aligned Learning Algorithms with Statistical Guarantees  My research focuses on designing robust adversarial learning algorithms for various tasks that simultaneously align with the learning objective by incorporating the performance metrics or loss functions into the learning process and provide the statistical guarantee of Fisher consistency. \r\n\t\t\t\t\t\tIn my previous and ongoing works, I design robust adversarial learning algorithms for the following tasks: - Multiclass classification - Ordinal classification with absolute loss and squared loss - Classification with abstention - Conditional graphical models (chain, tree, and low-treewidth graph structures) - Bipartite matching in graphs - Fairness in machine learning    Research interest:    Consistent learning algorithms  Fairness in machine learning    Multivariate metrics  Multi-task learning    Robust adversarial learning  Deep learning    Structured prediction  Causal machine learning    Approximate inference  Bayesian machine learning    Multivariate metrics  Multi-modal regression       Publications   In submission:   [1] Ashkan Rezaei*, Rizal Fathony* , Omid Memarrast, Brian D. Ziebart. “ Fair Logistic Regression: An Adversarial Perspective ”. [arXiv]    [2] Rizal Fathony , Kaiser Asif, Anqi Liu, Mohammad Bashiri, Xinhua Zhang, Brian D. Ziebart. “ Consistent Robust Adversarial Prediction for General Multiclass Classification ”. Journal manuscript in submission. [arXiv]     PhD Thesis:   [3] Rizal Fathony . “ Performance-Aligned Learning Algorithms with Statistical Guarantees ”. PhD Thesis. University of Illinois at Chicago. 2019. [pdf]  [slides]    Conferences:   [4] Rizal Fathony , Ashkan Rezaei, Mohammad Bashiri, Xinhua Zhang, Brian D. Ziebart. “ Distributionally Robust Graphical Models ”. Advances in Neural Information Processing Systems 31 (NeurIPS), 2018. [neurips]  [pdf]  [poster]  [code]    [5] Rizal Fathony* , Sima Behpour*, Xinhua Zhang, Brian D. Ziebart. “ Efficient and Consistent Adversarial Bipartite Matching ”. International Conference on Machine Learning (ICML), 2018. [pmlr/icml]  [pdf]  [poster]  [code]    [6] Rizal Fathony , Mohammad Bashiri, Brian D. Ziebart. “ Adversarial Surrogate Losses for Ordinal Regression ”. Advances in Neural Information Processing Systems 30 (NIPS), 2017. [nips]  [pdf]  [poster]  [code]    [7] Rizal Fathony , Anqi Liu, Kaiser Asif, Brian D. Ziebart. “ Adversarial Multiclass Classification: A Risk Minimization Perspective ”. Advances in Neural Information Processing Systems 29 (NIPS), 2016. [nips]  [pdf]  [poster]  [code]    Workshops:   [8] Rizal Fathony , Ashkan Rezaei, Mohammad Bashiri, Xinhua Zhang, Brian D. Ziebart. “ Distributionally Robust Graphical Models ”. The 3rd Workshop On Tractable Probabilistic Modeling (TPM) @ ICML, 2019    [9] Anqi Liu, Rizal Fathony , Brian D. Ziebart. “ Learning to Explore by Abstaining ”. 13th Women in Machine Learning Workshop (WiML) @ NeurIPS, 2018.    Preprints:   [10] Anqi Liu, Rizal Fathony , Brian D. Ziebart. “ Kernel Robust Bias-Aware Prediction under Covariate Shift ”. ArXiv Preprints, 2016. [arXiv]      Awards   NeurIPS Travel Award 2018  NIPS Travel Award 2017  NIPS Travel Award 2016  Won an International Fulbright Master of Science and Technology Scholarship Award (2012 - 2014)  Runner Up Developer at Indonesia Open Source Festival - Android Apps Competition (2010)  Nominee of Research and Development Category at Asia Pacific Information and Communication Technology Award (APICTA), Melbourne, Australia (2009)  Best Research and Development Category at Indonesia Information and Communication Technology Award, Jakarta, Indonesia (2009)  Grantee of a full scholarship and monthly stipend from the Indonesian government during  undergraduate study at the Institute of Statistics, Jakarta, Indonesia (2003 - 2007)     Experience   Research Assistant December 2014 - present  DEPARTMENT OF COMPUTER SCIENCE, UNIVERSITY OF ILLINOIS AT CHICAGO  Research Assistant at Prof. Brian Ziebart’s lab.    Research Intern May 201 - August 2017  TECHNICOLOR RESEARCH, ARTIFICIAL INTELLIGENCE LAB, SAN FRANCISCO BAY AREA  Conducted research in deep learning area especially in Generative Adversarial Networks (GAN): - Developed a network architecture  of GAN for discrete distribution - Applied Conditional Wasserstein GAN to image colorization tasks    Teaching Assistant August 2015 - December 2016  DEPARTMENT OF COMPUTER SCIENCE, UNIVERSITY OF ILLINOIS AT CHICAGO  CS 412 Introduction to Machine Learning (Fall 2016). CS 412 Introduction to Machine Learning (Spring 2016). CS 491 Introduction to Machine Learning (Fall 2015).    Statistical Dissemination System Developer January 2008 - June 2012  CENTRAL BUREAU OF STATISTICS INDONESIA  Developed web-based statistical data dissemination and visualization systems for major surveys and censuses conducted by Central Bureau of Statistics Indonesia.      Template Design by W3layouts       ",
    "outlinks": [
        "https://www.uic.edu/",
        "https://cs.uic.edu/Ziebart",
        "https://cs.uic.edu/"
    ]
}