{
    "origin_link": "https://www.evl.uic.edu/marai/",
    "title": "Liz Marai: Home",
    "contents": "        G. Elisabeta (Liz) Marai  Associate Professor of Computer Science Electronic Visualization Laboratory: http://evl.uic.edu Department of Computer Science University of Illinois at Chicago Chicago, IL                Research My research is in visual computing, an area of computer science that handles\nimages, 3D models, and the interaction between humans and data that can be\nrepresented visually. My research interests go from visual-system\nrelated problems that can be robustly solved through automation, to\nproblems that require human experts in the computational loop, and the\nprinciples behind this work. [ CV ] This body of research has been recognized by my peers with an NSF CAREER \nAward and by multiple NSF and multi-site NIH R01 awards , including one as an early-stage\ninvestigator. I have received multiple Oustanding Research\nAwards at conferences, along with my students. My research has been\nfeatured on journal and newsletter covers. I have co-authored scientific open-source \nsoftware adopted by thousands of users, and I am a patent co-author. I am an Associate Professor of Computer Science and a faculty member of the\nElectronic Visualization \nLaboratory at the University\nof Illinois at Chicago. The lab's research\npages are the best place to learn more about my current work. Prior to\nUIC, I was Research Faculty in the Robotics Institute at Carnegie\nMellon University and the founder and director of the Interdisciplinary\nVisualization Research Lab in the Rust Belt; the lab's research pages are the best place to learn more about my past work,\nmy group, our projects, results, publications, courses taught, alumni and\nsponsors.    Teaching   Current teaching\nschedule: CS529 Visual Data Science I have received six Teaching Awards for courses that blend teaching and\nresearch; \nalthough, or perhaps because, \nI often choose to experiment with my teaching and learn from the results. \nMy lab's teaching \nportfolio showcases some of the work produced by my students.  Service and Outreach Please see my CV for a complete list of professional service and \noutreach activities.         ",
    "outlinks": [
        "https://evl.uic.edu/cs529/",
        "https://evl.uic.edu/",
        "https://evl.uic.edu/marai"
    ]
}