{
    "origin_link": "https://jmich.people.uic.edu/",
    "title": "Joseph E Michaelis",
    "contents": "        Joseph E Michaelis    Home  UIC LIT Lab  Publications  Courses               Joseph E Michaelis      I am an Assistant Professor of Learning Sciences, and of Computer Science at the University of Illinois at Chicago in UIC’s College of Engineering. My research sits at the nexus of learning sciences and human-computer interaction disciplines with a focus on long-term interactions and developing interest in STEM. In this work, I design and assess educational technologies by utilizing human-centered methods and interaction modeling in HCI, and on interest, motivation and social-cultural learning perspectives in the learning sciences. These technologies are designed for social connection-making with learners to support learning and interest through long-term engagement, in ways that seamlessly integrate into existing educational activities in classrooms, informal learning environments, and at home. My current research focuses on designing learning companion robots to work with children while they read at home and while learning science in formal and informal settings. These companion robots “talk” to children while they read augmented books or participate in science activities by providing comments tailored to their interests and ability. The goal of each child-robot interaction is to build social connections, provide comprehension support, and promote interest in reading and STEM learning.        UIC LIT Lab  I am the director of the UIC LIT Lab. Our mission is to design and develop STEM interest scaffolding in technology-based learning. We specialize in developing learning-companion robots for children to support in-home learning and interest development for science, engineering, and related fields.      Pub Spacing  Select Publications   Michaelis, J. E. , Siebert-Evenstone, A., Shaffer, D. W. & Mutlu, B. (2020, April). Collaborative or Simply Uncaged? Understanding Human-Cobot Interactions in Automation. In CHI 2020, April 25-30, Honolulu, HI. PDF   Michaelis, J. E. , & Mutlu, B. (2019, June). Supporting interest development in science learning with a social robot. ACM Interaction Design and Children Conference. Boise, Idaho. PDF  Michaelis, J. E. , & Mutlu, B. (2018). Reading socially: Transforming the in-home reading experience with a learning-companion robot. Science Robotics, 3(21). PDF     Michaelis, J. E. (2017). The role of interest and motivation in science investigation and engineering design instruction. Paper commissioned for the National Academies of Sciences, Engineering, and Medicine committee on Science Investigations and Engineering Design for Grades 6-12. PDF    Michaelis, J. E. , & Mutlu, B. (2017, May). Someone to read with: Design of and experiences with an in-home learning companion robot for reading. In CHI 2017, May 06-11, Denver. PDF  Michaelis, J. E. , & Nathan, M. J. (2016, June). Observing and measuring interest development among high school students in an out-of-school robotics competition. Paper presented at 2016 ASEE Annual Conference & Exposition, New Orleans, LA. PDF   Michaelis, J. E. , & Nathan, M. J. (2015, June). The Four-Phase Interest Development in Engineering Survey. Paper presented at 2018 ASEE Annual Conference & Exposition, Educational Research Methods (ERM) Division. Seattle, WA. PDF      ",
    "outlinks": []
}