{
    "origin_link": "https://www.cs.uic.edu/~icst2016/index.htm",
    "title": "IEEE International Conference on Software Testing, Verification and Validation (ICST)",
    "contents": "              ICST 2016    Welcome to IEEE ICST 2016 in beautiful Chicago!  To register for the conference, please follow this link . Hotel reservation link  will be provided to you as part of your registration. Registration fees are  valid only when registering before March 15 and will be increased later.  We invite you to contribute to and attend the IEEE International Conference on   Software Testing, Verification and Validation (ICST) 2016! Our focus for 2016 is to   show that software testing, V&V can be applied to complex heterogeneous   distributed software systems. A multiplicity of various approaches, algorithms and   techniques have been developed by the ICST and the rest of software engineering   community, and they can and must be applied to large-scale software applications   to ensure their correctness and reliability.  ICST is the premier conference in all areas related to software testing. The   development of a software system involves human judgement and, sometimes,   political, legal and social processes. As a result, software testing, verification and   validation includes testing, inspections, safety certification, security, privacy and   draws upon a wide spectrum of disciplines, including engineering, mathematics   and also psychology. Verification and validation touches all aspects of computer   science and software engineering research and impacts every software practitioner.  ICST seeks to meet these challenges by bringing together researchers and   practitioners for a conference that includes all aspects of software testing,   verification, and validation. ICST includes research papers, industrial experience   reports and presentations, tool demonstrations, and tutorials. For the research   papers, ICST seeks high quality original work that has never been published and   that advances the state of the art in software testing, verification and validation.   For the industrial experience reports, ICST seeks papers and presentations that   present real world experience from which others can benefit. Tool demonstrations   are also welcome, especially those openly available for others to use. Finally, we   are seeking tutorials that are relevant to both practitioners and researchers. See   the specific calls for more details. Extended versions of the best papers from ICST   conferences are regularly published in special editions of JSTVR .      © Mark Grechanik, 2016      Welcome Message  Hello and Welcome to this  website! I am the General  Chair of ICST 2016 and with  the OC we will make this event  a huge success!  Chicago is an excellent venue  for meetings of all kinds. It  hosts millions of visitors every  year for a wide range of  commercial, technical, and  professional meetings and was  the site of the 2012 NATO and  G8 summits. It provides an  unmatched array of local  attractions and a center city  setting that ranks as one of the  world’s best for views,  amenities, and culture. With  direct flights to and from all  continents, it is easily and  economically accessible to  participants anywhere. We  believe is it therefore an  excellent site for ICST.  Mark Grechanik  University of Illinois at Chicago  and  the Organizing Committee  and  ICST Steering Committee                       Chicago, IL, USA    April 10-15, 2016                  Call For Papers Calls For Workshop Contributions Call For Industry Presentations Call For Workshop Proposals Ph.D. Symposium Testing Tool Track Tutorials and technical briefings Important Dates      ",
    "outlinks": [
        "https://www.cs.uic.edu/~icst2016/tutorialstrack.htm",
        "https://www.cs.uic.edu/~drmark/",
        "https://www.cs.uic.edu/~icst2016/calls.htm",
        "https://www.cs.uic.edu/~icst2016/organization.htm",
        "https://www.cs.uic.edu/~icst2016/toolstrack.htm",
        "https://www.cs.uic.edu/~icst2016/program.htm",
        "https://www.cs.uic.edu/~icst2016/industrytrack.htm",
        "https://www.cs.uic.edu/~icst2016/phdsymposium.htm",
        "https://www.cs.uic.edu/~icst2016/researchtrack.htm",
        "https://www.cs.uic.edu/~icst2016/gallery.htm",
        "https://www.cs.uic.edu/~icst2016/importantdates.htm",
        "https://www.cs.uic.edu/~icst2016/keynotespeakers.htm",
        "https://www.cs.uic.edu/~icst2016/location.htm",
        "https://www.cs.uic.edu/~icst2016/workkshops.htm",
        "https://www.cs.uic.edu/~icst2016/calls4workshopcontributions.htm"
    ]
}