{
    "origin_link": "https://www.cs.uic.edu/~hinrichs/",
    "title": "Timothy Hinrichs",
    "contents": "                  Research  Timothy L. Hinrichs is a researcher in Computer Security : the branch of Computer Science dedicated to improving the protection of computer systems against abuse while minimizing the degradation of their usability. At the heart of security is the idea that a system ought to be used in \nsome ways and ought not be used in others.  That is, the security of a \nsystem can only be evaluated in the context of the semantics for that \nsystem—the definition for how the system and its users are supposed to interact. Hinrichs's research focuses on leveraging a separate, formal representation \nof a system's semantics to improve that system's security in two ways.  The \nfirst is precisely assessing how well a system meets its security \nobjectives, a process that can be automated to some extent if the semantics \nis written in a machine-processable language.  The second is more ambitious: enforcing the semantics of the system automatically, which can be \naccomplished either by directly implementing the language in which the \nsemantics are written or by synthesizing code that obeys the semantics. Because it \nis often convenient to represent a system's semantics in a logical language, \nHinrichs's work draws upon and contributes to Computational Logic , the \nbranch of Computer Science concerned with the representation and processing \nof information in the form of logical statements.      Education Hinrichs received a B.S. from the University of Illinois at Urbana-Champaign in Computer Science in 2001 and a Ph.D. from Stanford University in the Computer Science department's Logic Group in 2008.  He is currently a Postdoctoral Researcher in Computer Science at the University of Illinois at Chicago . Documents Hinrichs is on the job market this year.  His application materials can be\nfound below.  Curriculum vitae  Research statement  Teaching statement       Home  Projects  Publications  Personal  Links     SEO 1216 Department of Computer Science 851 S. Morgan (M/C 152) Chicago, IL 60607-7053   hinrichs@uic.edu 312-355-0950        ",
    "outlinks": [
        "https://www.cs.uic.edu/~hinrichs/links.htm",
        "https://www.cs.uic.edu/",
        "https://www.cs.uic.edu/~hinrichs/index.html",
        "https://www.cs.uic.edu/~hinrichs/personal.htm",
        "https://www.uic.edu/",
        "https://www.cs.uic.edu/~hinrichs/projects.htm",
        "https://www.cs.uic.edu/~hinrichs/publications.htm"
    ]
}