{
    "origin_link": "https://www.cs.uic.edu/~dasgupta/",
    "title": "Homepage of Bhaskar DasGupta",
    "contents": "            Welcome to the home page of Bhaskar DasGupta   I am a Professor in the Computer Science department at University of Illinois at Chicago (UIC) .\r\nI am also an adjunct faculty at the Bioengineering department in UIC. My research interests span several areas such as\r\nTheoretical Computer Science/Discrete Mathematics/Algorithms, \r\nComputational Biology, Computational Geometry and Computational Finance.\r\nI received the NSF CAREER award in 2004 and the UIC College of Engineering Teaching Award in 2012. \r\nI thankfully acknowledge generous support from the National Science Foundation (NSF) for my research activities. For Spring 2020, I am teaching the following two courses:  CS 506 (CRN 41115): Introduction to Quantum Computing, M & W & F 1:00 - 1:50, TBH 180B CS 594 (CRN 33792): Randomized Techniques for Designing Algorithms and Proving Lower Bounds, M & W 3:00 - 4:30, TBH 180B  To know more about about myself, my research and other stuff, please follow one of the following links.        Click here for the website for Theoretical Computer Science Group at UIC         Quick links and information      &rtrif;  Detailed CV   &rtrif; Public Google Scholar Profile   &rtrif; Publications (with online copies)   &rtrif; Patents   &rtrif;  Contact Information    &rtrif; DasGupta's Creative Algorithms Lab   Funded by    &rtrif; Website for products related to the NSF grant IIS-1814931 (\" Collaborative Research: Network analysis and anomaly detection via global curvatures \", \r\n      08/15/2018 — 07/31/2021,\r\n      Collaborative PI: Réka Albert , Pennsylvania State University)  &rtrif; Slides for some presentations  ♦  See my list of publication for other presentation slides    &rtrif; Softwares    Software to \"un-gerrymander\" a gerrymandered US political districting map via minimizing the efficiency gap measure     FIN-STAB: an interactive software for shock simulator for financial networks     DNA-BAR -- Distinguisher Selection for Robust DNA Barcoding     Software for decomposing biological networks into monotone subsystems     NET-SYNTHESIS: Software for synthesis of a biological signal transduction network from \r\ndirect and indirect experimental evidences      KINALYZER: A Computer Program for Reconstructing Sibling Groups    &rtrif; Some media coverage stuff   Adding fake accounts to networks can make them less vulnerable to privacy violations, UIC Science Blog, 10/02/2018        &rtrif; Book         Bhaskar DasGupta and Jie Liang, Models and Algorithms for Biomolecules and Molecular Networks ,\r\nJohn Wiley & Sons, Inc. (January 2016)   Book excerpts:    Table of contents     List of Figures     List of Tables   Bibliography    Chapter 1     Chapter 2     Chapter 3     Chapter 4     Chapter 5     Chapter 6     Chapter 7      Index     Publisher website    &rtrif;  Some elementary publication related information     Erdös number : 3    list of co-authors via  DBLP            &rtrif;    Selected current editorial and other professional responsibilities             Associate editor ,   Discrete Mathematics, Algorithms and Applications       Member of editorial board ,   BioMed Research International (Bioinformatics area)              Other links      &rtrif; Program committee activities  Current    Program committee member,  International Conference on Computational Science (ICCS 2020),  Amsterdam, The Netherlands,\r\nJune 3-5, 2020   Program committee member,  26 th International Computing and Combinatorics Conference (COCOON 2020),  Atlanta, GA, \r\nAugust 29-31, 2020   Program committee member,  1 st International Applied Bioinformatics Conference (iABC'20),  Istanbul, Turkey, \r\nOctober 1-3, 2020   Program committee member,  9 th International Conference on Complex Networks and their Applications (CNA 2020),  Madrid, Spain, \r\nDecember 1-3, 2020   Past   SOFSEM 2020, CNA 2019, \r\nBIOKDD 2019, COCOON 2019, ICCS2019, ICDCS 2019, GLBIO 2019, IWBBIO 2019, CNA 2018, BIBM 2018, AAIM 2018, IWOCA 2018, COCOON 2018, \r\nBBC 2018,\r\nIWBBIO 2018, CNA 2017, BIBM 2017, SocInfo 2017, BIO-KDD 2017, ACM-BCB 2017, NetSci 2017, BBC 2017, IWBBIO 2017,\r\nCOCOA 2016, BIBM 2016, ACM-BCB 2016, BIOKDD'16, COCOON 2016, AAIM 2016,\r\nCOCOA 2015, FOCI 2015, BIBM 2015, BIOKDD 2015, ISBRA 2015, BBC 2015, COCOA 2014, BIBM 2014, COCOON 2014, WCCI 2014, AICoB 2014, ICCABS 2014, BICoB 2014, ICAA 2014, BIBM 2013, COCOA 2013, BRICS-SCI 2013, BICS 2013, ICCABS 2013, ACSE 2013, BICoB 2013, \r\nISAAC 2012, GIW 2012, BIBM 2012, HIBIBI 2012, ISNN 2012, ISBRA 2012, ACSE 2012, BICoB 2012, ICCABS 2012, SOFSEM 2012, BIBM 2011, COCOA 2011, FutureTech 2011, AAIM 2011, ISBRA 2011, ISSN 2011,\r\nFOCI 2011, BiCoB-2011, BIBM 2010, WABI 2010, IBW 2010, FutureTech 2010, ACS 2010, INSC 2010, BICoB-2010, ACSE 2010, GIW 2009, ISAAC 2009, BIBM 2009, CSB 2009, \r\nSOLI 2009, COCOON 2009, ISBRA 2009, FAW 2009, BICoB 2009, BIBE 2009, CBB 2008, GIW 2008, BIBM 2008, WASA 2008, FAW 2008, ISBRA 2008, \r\nINSC 2008, BIBM 2007, AAIM 2007, ISNN 2007, ISBRA 2007, \r\nICNSC 2007, ICTAI 2006, CASB 2006, EMBS 2006, IWBRA 2006, ICNSC 2006, APBC 2006,ICTAI 2005, ISDM 2005, EMBS 2005, BIDM 2005, COCOON 2005, IWBRA 2005, ICTAI 2004, BIDM 2004, EMBS 2004   Click here for details       &rtrif; Graduate student support  RA positions may be available. You may apply with CV or other related information. I will respond \r\nonly if I am interested in your qualifications.    &rtrif; Miscellaneous   Computer science department homepage at UIC    PhD students supervised   Current     Tanima Chatterjee     Prithviraj Sengupta     Nazanin Azarhooshang    Past      Lakshmi Kaligounder  (graduated 04/2014, thesis title: Global Stability of Financial Networks : Measures, Evaluations and Policy\r\nImplications , [ pdf of thesis ])    Venkatkumar Srinivasan (graduated 04/2017, thesis title: Analysis of Privacy Measures for Multi-Agent and Networked Systems , \r\n[ pdf of thesis ])    Nasim Mobasheri (graduated 07/2018, thesis title: Geodesic-Based Properties in Complex Networks , \r\n[ pdf of thesis ])    Farzane Yahyanejad (graduated 02/2019, thesis title: Curvature Analysis in Complex Networks: Theory and Application , \r\n[ pdf of thesis ])  Notable other (MS, BS, high-school etc.) students from UIC or from close to UIC that have co-authored research papers with me:   Kedsuda Apichonbancha (MS)  Marco Comi (MS)   Sergio Ferrarini (MS)   Uthra Gopalakrishnan (MS)   Rashmi Hegde (MS)   Emma Mendonca (MS)   Pradyut Paul (High-school student at publication time)   Laura Palmieri (MS)   Nisha Paryani (MS)   Gowri Sangeetha Sivanathan (MS)         View My Stats    ",
    "outlinks": [
        "https://www.cs.uic.edu/",
        "https://www.bioe.uic.edu/BIOE/BioeAdjuncts",
        "https://www.cs.uic.edu/~dasgupta/pc.html",
        "https://www.cs.uic.edu/~dasgupta/professional/algo-lab.html",
        "https://www.cs.uic.edu/~dasgupta/contact.html",
        "https://www.cs.uic.edu/~dasgupta/patent.html",
        "https://www.cs.uic.edu/~dasgupta/resume/publ/publ.html",
        "https://www.uic.edu/",
        "https://www.cs.uic.edu/~dasgupta/professional/software.html",
        "https://www.cs.uic.edu/~dasgupta/professional/NSF-IIS-1814931.html",
        "https://theory.cs.uic.edu/",
        "https://www.cs.uic.edu/~dasgupta/slides.html"
    ]
}