{
    "origin_link": "https://mie.uic.edu/graduate/phd-dissertations/",
    "title": "PhD Dissertations | Department of Mechanical and Industrial Engineering | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Department of Mechanical and Industrial Engineering     Search the site     Toggle Menu      Search                  Department of Mechanical and Industrial Engineering      Department of Mechanical and Industrial Engineering   Main Menu    Undergraduate           Admitted Students    Admissions    Accreditation    Courses    ME Major    IE Major    EM Major    Minors    Internships and Jobs    Student Groups    Student Profiles    Student Resources         Graduate           Admissions    Courses    International Programs    Master’s Programs    PhD Programs    PhD Dissertations    Post-Graduation Outcomes    Student Profiles    Student Resources         Research           Research Areas    Labs         Faculty and Staff           Department Head    Core Faculty    Affiliate Faculty    Emeritus Faculty    Staff    Open Positions         News           Department Seminars    News         About           Mechanical Engineering    Industrial Engineering    Energy Engineering    Advisory Board    Contact    Head's Message          Eyebrow menu    Giving    Alumni    College of Engineering Home    UIC menu    UIC.edu    Campus Map       Search               View Menu           Breadcrumbs   Department of Mechanical and Industrial Engineering    Graduate Programs    PhD Dissertations        PhD Dissertations       acc     2018-2019        a      Student Dissertation Title Advisor      Mechanical Engineering    Anton, Jayson Vibration Isolation of Sensitive Equipment Using Cohesionless Soil Royston, Thomas J.    Ibrahim, Ali Water Transport Over and Through a Thin Permeable Medium with Wettability Contrast Megaridis, Constantine M.    Maksud, Mahjabin Mechanical Characterization of Battery Nanomaterials Subramanian, Arunkumar    Industrial Engineering and Operations Research    Deutsch, Jason Development of Deep Learning Based Prognostics He, David           2017-2018        a      Student Dissertation Title Advisor      Mechanical Engineering    Behranginia, Amirhossein 2D-Materials: Synthesis and Investigation of Electrical and Thermal Properties Salehi-Khojin, Amin    Elsharkawy, Mohamed Study of Effects of Surface Wettability on Frosting and Droplet Manipulation Megaridis, Constantine M    Ghiasi, Seyyed Ziaoddin Large Eddy Simulation of Wall-bounded Turbulent Flows Using Discontinuous Spectral Element Method Mashayek, Farzad    Ghosh, Aritra Pumpless Fluid Management on Surfaces: Wettability Patterning and Applications Megaridis, Constantine    Han, Xu A Shock Tube Study of the Pyrolysis of Real Jet Fuels Jet A and JP10 Brezinsky, Kenneth    Khan, Altaf Multi Modal Fingertip Elastography and Reconstruction Methods Royston, Thomas J    Liszka, Miroslaw High Pressure and Temperature Study of Cyclohexane, Methylcyclohexane, and 6-Bromo-1-hexene Pyrolysis Brezinsky, Kenneth    Patel, Mohil Integration of a Continuum-Based Finite Element Tire Modeling Framework in Multibody Dynamics Algorithms Shabana, Ahmed A    Yasaei, Poya Thermal Transport and Power Dissipation in Two-Dimensional (2D) Materials and Interfaces Salehi-Khojin, Amin    Industrial Engineering and Operations Research     Chen, Yang Uncertainty-Aware Transactive Operation Decisions for Grid-Friendly Building Clusters Hu, Mengqi    Dababneh, Fadwa Cost Effective Joint Energy & Production Operations Decision Making for Sustainable Manufacturing System Li, Lin    He, Miao Development of Deep Learning Based Methodology on Rotating Machine Fault Diagnosis He, David    Jiang, Jie A Surface-based Volume Haptics Approach and Applications in Surgical Simulation Banerjee, Prashant    Sharabiani, Anooshiravan Novel Approaches Towards Fast and Accurate Time series Classification Darabi, Houshang           2016-2017        a      Student Dissertation Title Advisor      Mechanical Engineering    Behranginia, Amirhossein 2D-Materials: Synthesis and Investigation of Electrical and Thermal Properties Salehi-Khojin, Amin    Elsharkawy, Mohamed Study of Effects of Surface Wettability on Frosting and Droplet Manipulation Megaridis, Constantine M    Ghiasi, Seyyed Ziaoddin Large Eddy Simulation of Wall-bounded Turbulent Flows Using Discontinuous Spectral Element Method Mashayek, Farzad    Ghosh, Aritra Pumpless Fluid Management on Surfaces: Wettability Patterning and Applications Megaridis, Constantine    Han, Xu A Shock Tube Study of the Pyrolysis of Real Jet Fuels Jet A and JP10 Brezinsky, Kenneth    Khan, Altaf Multi Modal Fingertip Elastography and Reconstruction Methods Royston, Thomas J    Liszka, Miroslaw High Pressure and Temperature Study of Cyclohexane, Methylcyclohexane, and 6-Bromo-1-hexene Pyrolysis Brezinsky, Kenneth    Patel, Mohil Integration of a Continuum-Based Finite Element Tire Modeling Framework in Multibody Dynamics Algorithms Shabana, Ahmed A    Yasaei, Poya Thermal Transport and Power Dissipation in Two-Dimensional (2D) Materials and Interfaces Salehi-Khojin, Amin    Industrial Engineering and Operations Research     Chen, Yang Uncertainty-Aware Transactive Operation Decisions for Grid-Friendly Building Clusters Hu, Mengqi    Dababneh, Fadwa Cost Effective Joint Energy & Production Operations Decision Making for Sustainable Manufacturing System Li, Lin    He, Miao Development of Deep Learning Based Methodology on Rotating Machine Fault Diagnosis He, David    Jiang, Jie A Surface-based Volume Haptics Approach and Applications in Surgical Simulation Banerjee, Prashant    Sharabiani, Anooshiravan Novel Approaches Towards Fast and Accurate Time series Classification Darabi, Houshang           2015-2016        a      Student Dissertation Title Advisor      Mechanical Engineering    Asadi, Mohammad Advanced Transition Metal Dichalcogenides Catalysts for Energy Conversion and Storage Systems Salehi-Khojin, Amin    Brinker, Spencer Synchronous Measuring Techniques in Parallel to MRE: Study of Pressure, Pre-Tension, and Surface Dynamics Klatt, Dieter    Fu, Sin-Pui Investigation of the Wetting Behavior of Cerium Dioxide Coatings Abiade, Jeremiah    Fu, Xiao Partially Premixed Combustion in Counterflow Flame and Dual Fuel Compression Ignition Engine Aggarwal, Suresh K.    Kearney, Steven Advances in Elastography Using Geometrically Focused Actuation Royston, Thomas J.    Liu, Yifei High Resolution Cardiac Magnetic Resonance Elastography: From Phantom to Mouse Heart Royston, Thomas J.    O’Shea, James Use of Multibody System Techniques in the Analysis of Railroad Vehicle Stability and Derailment Shabana, Ahmed A.    Sett, Soumyadip Dynamics of Thin Surfactant Films Yarin, Alexander L.    Wallin, Michael https://indigo.uic.edu/handle/10027/21176 Shabana, Ahmed A.    Wang, Liang Integration of Different Constitutive Models in Multibody System Algorithms Shabana, Ahmed A.    Industrial Engineering and Operations Research     Hasanain, Bassam A Formal Approach for Detecting Masking in Medical Alarms Bolton, Matthew    Luo, Jia A Haptics and Virtual Reality Simulator for Cataract Surgery Banerjee, Prashant    Schuler, Francesca Generating Control Policies for Timed Discrete-Event Systems through Efficient State Space Exploration Darabi, Houshang    Sharabiani, Ashkan Medical Decision Making for Warfarin Dosing Using Machine Learning Methods Darabi, Houshang           2014-2015        a      Student Dissertation Title Advisor      Mechanical Engineering    Aboubakr, Ahmed Use of Non-inertial Coordinates and Implicit Integration for Efficient Solution of Multibody Systems Shabana, Ahmed A.    He, Qilu Bridging the Gap from Continuum Mechanics to Molecular Dynamics for Nanoscale Systems Lilley, Carmen    Mates, Joseph Tunable Multifunctional Nanomaterial and Polymer Composites: Nonwoven Applications Megaridis, Constantine M.    Peng, Ying Development & Experimental Validation of Finite Element Simulation of Sound Transmission in Lungs & Torso Royston, Thomas J.    Ramirez, Anita Quantified Analysis of a Production Diesel Injector Using X-Ray Radiography and Engine Diagnostics Aggarwal, Suresh K.    Sahu, Rakesh Fluid Mechanics of Nano-textured Coalescing Filters Yarin, Alexander    Industrial Engineering and Operations Research     Sun, Zeyi Energy Efficiency Management and Electricity Demand Response for Sustainable Manufacturing Systems Li, Lin    Van Hecke, Brandon Development of Novel Acoustic Emission Based Methodology and Tools for Bearing Fault Diagnostics He, David    Wang, Yong Joint Production and Energy Modeling for Sustainable Manufacturing Systems Li, Lin    Yoon, Jae Myung Development of Effective and Efficient Fault Diagnostic Methodologies and Tools for Planetary Gearboxes He, David    Zhao, Xiaorui Patient-specific Virtual Ultrasound Imagery for Virtual Reality Simulation of Central Line Placement Banerjee, Prashant           2013-2014        a      Student Dissertation Title Advisor      Mechanical Engineering    Abbassi, Hessamoddin Supersonic Flow Simulation with Entropy-Based Artificial Viscosity Stabilization Mashayek, Farzad    Alkam, Sameh New Methods in Modeling and Control of Modern Electrohydraulic Systems Cetinkunt, Sabri    Alzghier, Riad Synthesis and Atomic-Scale Characterization of Oxide Thermoelectric Materials and Devices Abiade, Jeremiah    Fridlyand, Aleksandr High Temperature Single Pulse Shock Tube Studies of Combustion Relevant Chemistry Brezinsky, Kenneth    Gonzalez, Mark Cementless Acetabular Revision with Rim Acetabular Defects: Experimental and FEA Investigation Amirouche, Farid    Hamed, Ashraf New Finite Element Mesh for Efficient Modeling of Spatial Flexible Link Articulated Systems Shabana, Ahmed A.    Hamper, Martin Multibody System Investigation of Contact Geometry: Application to Deformable and Variable Profile Rails Shabana, Ahmed A.    Lee, Gi-Hwan Study on the Production and Transport Properties of Nanofluids Megaridis, Constantine M.    Pelot, David Mechanics and Rheological Characterization of Construction Materials Yarin, Alexander    Schutzius, Thomas Large-area Coating and Patterning of Functional Nanocomposites: Design, Synthesis and Characterization Megaridis, Constantine M.    Yasar, Temel Optimal Pulse Sequences for Magnetic Resonance Elastography Royston, Thomas J.    Industrial Engineering and Operations Research     Benavides Gallego, Pahola Optimal Control of Batch Production of Biodiesel Fuel under Uncertainty He, David    David, Amy Use of Game Theory and Stochastic Programming for Supply Chain Optimization Li, Lin    Qu, Yongzhi Development of Effective and Efficient Acoustic Emission Based Gear Fault Diagnosis Methods and Tools He, David           2012-2013        a      Student Dissertation Title Advisor      Mechanical Engineering    Cantwell, Matthew Feedback Controlled Deformable Membrane Micropumps for Fluidic Delivery Applications Amirouche, Farid    Chong, Hwansoo An Experimental Investigation of the Oxidation Characteristics of Diesel Particulate Matter Aggarwal, Suresh K.    Dai, Zoujun The Audible Human Project: Modeling Sound Transmission in the Lungs and Torso Royston, Thomas    Das, Arindam Functional Polymer Nanocomposites and Nanohybrids: Synthesis, Characterization and Application Megaridis, Constantine M.    Gantoi, Florentina New Computational Framework for Biomechanical Multibody System Applications Shabana, Ahmed    Jun, Seongchul Transport Phenomena in Multi-phase Media: Slurries, Foams, Boiling Bubbly Media and Pulps Yarin, Alexander L.    Kanchi, Harish Fluidic Control of Shear Layer in Dump Combustors Using Microjets Mashayek, Farzad    Malewicki, Tomasz Development of a Jet A Chemical Surrogate Model Using High Pressure Shock Tube Speciation Data Brezinsky, Kenneth    Mohammadtalab Khansari, Shahrzad Biopolymer-Based Nanofiber Mats and Their Characterization and Applications Yarin, Alexander L.    Pelzmann, Christopher Contact-Based Assembly of Nano-scale Structures: Synthesis of Mechanics and Tools of Nanomanipulation Saggere, Laxman    Sud, Keshav Transient Modeling and Control of Split Cycle Clean Combustion Diesel Engine Cetinkunt, Sabri    Zaher, Mohamed Real Time Energy Management Control Strategies for Hybrid Powertrains Cetinkunt, Sabri    Industrial Engineering and Operations Research    Rizzi, Silvio Volume-based Graphics and Haptics Rendering Algorithms for Immersive Surgical Simulation Banerjee, Pat    Zhu, Junda Online Industrial Lubrication Oil Health Condition Monitoring, Diagnosis and Prognostics He, David           2011-2012        a      Student Dissertation Title Advisor      Mechanical Engineering    Afshari, Ali Investigation on the Wheel/Rail Contact and Longitudinal Train/Track Interaction Forces Shabana, Ahmed A.    Comandini, Andrea High Pressure Chemistry Of Phenyl Radical Reactions With Acetylene Brezinsky, Kenneth    Elezaby, Ahmed Virtual Autonomous Operator Model for Construction Equipment Applications Cetinkunt, Sabri    Ergene, Egemen Investigation of the Electrostatic Atomization Method for Remote Injection and High Pressure Mashayek, Farzad    Jonvaux, Julien Micro Fracture in Human Haversian Cortical Bone Under Compression Budyn, Elisa    Kalata, Wojciech Effects of Chiari Malformation on Cerebrospinal Fluid within the Spinal Canal Royston, Thomas J.    Industrial Engineering and Operations Research    Li, Ruoyu Rotating Machine Fault Diagnostics Using Vibration and Acoustic Emission Sensors He, David    Ma, Jinghua Development of Integrated Prognostics: Application to Bearing and Bevel Gear Life Prediction He, David    Ratisoontorn, Nantaporn Consignment Contract with Competition Goodman, Elodie                   Graduate           Admissions     Apply Now    Financial Aid and Funding    Graduate Admissions FAQ      Courses    International Programs    Master’s Programs     MS Thesis Information      PhD Programs     Preliminary Examination      PhD Dissertations    Post-Graduation Outcomes    Student Profiles    Student Resources                      ",
    "outlinks": [
        "https://uic.edu/about/job-opportunities",
        "https://mie.uic.edu/graduate/resources/",
        "https://mie.uic.edu/undergraduate/student-resources/",
        "https://mie.uic.edu/about/me/",
        "https://mie.uic.edu/undergraduate/em-major/",
        "https://mie.uic.edu/graduate/admissions/graduate-admissions-faq/",
        "https://mie.uic.edu/undergraduate/student-profiles/",
        "https://mie.uic.edu/faculty-and-staff/faculty-resources/",
        "https://mie.uic.edu/graduate/admissions/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://mie.uic.edu/undergraduate/admissions/",
        "https://mie.uic.edu/undergraduate/abet-accreditation/",
        "https://mie.uic.edu/undergraduate/me-major/",
        "https://mie.uic.edu/undergraduate/student-organizations/",
        "https://mie.uic.edu/about/ie/",
        "https://library.uic.edu/",
        "https://mie.uic.edu/graduate/",
        "https://engineering.uic.edu/support/",
        "https://mie.uic.edu/undergraduate/minors/",
        "https://mie.uic.edu/undergraduate/admitted-students/",
        "https://mie.uic.edu/about/advisory-board/",
        "https://mie.uic.edu/faculty-and-staff/affiliate-faculty/",
        "https://mie.uic.edu/about/contact/",
        "https://mie.uic.edu/research-page/mie-research-areas/",
        "https://mie.uic.edu/research-page/",
        "https://mie.uic.edu/graduate/masters-programs/ms-thesis-information/",
        "https://mie.uic.edu/graduate/admissions/funding-and-financial-aid/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://mie.uic.edu/graduate/phd-programs/preliminary-exam/",
        "https://mie.uic.edu/research-page/labs/",
        "https://disabilityresources.uic.edu/",
        "https://mie.uic.edu/undergraduate/courses/",
        "https://mie.uic.edu/graduate/international-programs/",
        "https://maps.uic.edu/",
        "https://mie.uic.edu/faculty-and-staff/department-head/",
        "https://engineering.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://engineeringalumni.uic.edu/",
        "https://mie.uic.edu/faculty-and-staff/open-positions/",
        "https://mie.uic.edu/undergraduate/ie-major/",
        "https://uic.edu/",
        "https://energyengineering.uic.edu/",
        "https://mie.uic.edu/graduate/masters-programs/",
        "https://mie.uic.edu/undergraduate/",
        "https://mie.uic.edu/about/",
        "https://uihealth.uic.edu/",
        "https://mie.uic.edu/undergraduate/internships-and-jobs/",
        "https://mie.uic.edu/graduate/courses/",
        "https://mie.uic.edu/graduate/phd-programs/",
        "https://mie.uic.edu/faculty-and-staff/faculty/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://mie.uic.edu/graduate/student-profiles/",
        "https://emergency.uic.edu/",
        "https://grad.uic.edu/admissions",
        "https://mie.uic.edu/",
        "https://mie.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://today.uic.edu/events",
        "https://mie.uic.edu/mie-news/",
        "https://today.uic.edu/",
        "https://mie.uic.edu/faculty-and-staff/",
        "https://mie.uic.edu/faculty-and-staff/staff/",
        "https://mie.uic.edu/seminars/"
    ]
}