{
    "origin_link": "https://mie.uic.edu/graduate/masters-programs/",
    "title": "Master's Programs | Department of Mechanical and Industrial Engineering | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Department of Mechanical and Industrial Engineering     Search the site     Toggle Menu      Search                  Department of Mechanical and Industrial Engineering      Department of Mechanical and Industrial Engineering   Main Menu    Undergraduate           Admitted Students    Admissions    Accreditation    Courses    ME Major    IE Major    EM Major    Minors    Internships and Jobs    Student Groups    Student Profiles    Student Resources         Graduate           Admissions    Courses    International Programs    Master’s Programs    PhD Programs    PhD Dissertations    Post-Graduation Outcomes    Student Profiles    Student Resources         Research           Research Areas    Labs         Faculty and Staff           Department Head    Core Faculty    Affiliate Faculty    Emeritus Faculty    Staff    Open Positions         News           Department Seminars    News         About           Mechanical Engineering    Industrial Engineering    Energy Engineering    Advisory Board    Contact    Head's Message          Eyebrow menu    Giving    Alumni    College of Engineering Home    UIC menu    UIC.edu    Campus Map       Search               View Menu           Breadcrumbs   Department of Mechanical and Industrial Engineering    Graduate Programs    Master's Programs        Master’s Programs       Intro      Follow the link at left for a PDF overview of our master's degree programs.    The Department of Mechanical and Industrial Engineering offers master’s programs that are designed to serve a broad range of student needs and career objectives in the field. Many students complete these programs and move directly into higher-level jobs in industry and government agencies, while others use the degree as a springboard to doctoral-level study in mechanical or industrial engineering.  In the last five years, UIC has graduated 371 students with an MS in mechanical engineering, 229 with an MS in industrial engineering, and 119 with a master of energy engineering.  Get acquainted with these programs in our master’s degree overview booklet (PDF) .       UIC MIE offers three master's degree programs:     Master of Science in Mechanical Engineering   A 36-credit program with both thesis and coursework-only options. See details below.     Master of Science in Industrial Engineering   A 36-credit program with both thesis and coursework-only options. See details below.     Master of Energy Engineering   A non-thesis master’s program focusing on energy use in buildings and power generation. Visit the program website for details.          MS in Mechanical Engineering   Required Semester Hours: 36  Coursework-Only Option  In the coursework-only option, students complete all the credit hours toward the MS in Mechanical Engineering through coursework. There is no thesis. Requirements are as follows:   16 semester hours of 500-level courses in the department, excluding ME 596, ME 598, and ME 599. Of these courses, 12 hours must be ME courses.  An additional 20 semester hours of courses at the 400 level or 500 level. Up to 4 semester hours of ME 596 can be applied toward this requirement. Of these courses, 8 hours must be ME courses.  ME 595 Mechanical Engineering Seminar. Students must enroll in this course for every fall and spring semester.     Thesis Option  In the thesis option, students complete a suite of coursework in preparation for a master’s-level research project, which they execute with the support of a faculty advisor. The thesis option is strongly recommended for students who may consider going on for a PhD after finishing the MS program. Requirements are as follows:   12 hours of courses at the 500 level, excluding ME 596, ME 598, and ME 599. Of these courses, 12 hours must be ME courses.  An additional 12 hours of courses at the 400 level or 500 level. Up to 4 semester hours of ME 596 can be applied toward this requirement. Of these courses, 4 hours must be ME courses.  12 hours of ME 598 MS Thesis Research  ME 595 Mechanical Engineering Seminar. Students must enroll in this course for every fall and spring semester.     For more information, visit the graduate catalog page for the MS in Mechanical Engineering.  See our graduate course offerings in mechanical engineering here .       MS in Industrial Engineering   Required Semester Hours: 36  Coursework-Only Option  In the coursework-only option, students complete all the credit hours toward the MS in Industrial Engineering through coursework. There is no thesis. Requirements are as follows:   16 semester hours of 500-level courses in the department, excluding IE 596, IE 598, and IE 599. Of these courses, 12 hours must be IE courses.  An additional 20 semester hours of courses at the 400 level or 500 level. Up to 4 semester hours of IE 596 can be applied toward this requirement. Of these courses, 8 hours must be IE courses.  IE 595 Industrial Engineering Seminar. Students must enroll in this course for every fall and spring semester.     Thesis Option  In the thesis option, students complete a suite of coursework in preparation for a master’s-level research project, which they execute with the support of a faculty advisor. The thesis option is strongly recommended for students who may consider going on for a PhD after finishing the MS program. Requirements are as follows:   12 hours of courses at the 500 level, excluding IE 596, IE 598, and IE 599. Of these courses, 12 hours must be IE courses.  An additional 12 hours of courses at the 400 level or 500 level. Up to 4 semester hours of IE 596 can be applied toward this requirement. Of these courses, 4 hours must be IE courses.  12 hours of IE 598 MS Thesis Research  IE 595 Industrial Engineering Seminar. Students must enroll in this course for every fall and spring semester.   For more information, visit the graduate catalog page for the MS in Industrial Engineering.  See our graduate course offerings in industrial engineering here .       Master of Energy Engineering   The Master of Energy Engineering program maintains a separate website. There, you can find information about admissions, the curriculum, and program outcomes. Find the MEE online at https://energyengineering.uic.edu .          Graduate           Admissions     Apply Now    Financial Aid and Funding    Graduate Admissions FAQ      Courses    International Programs    Master’s Programs     MS Thesis Information      PhD Programs     Preliminary Examination      PhD Dissertations    Post-Graduation Outcomes    Student Profiles    Student Resources                    ",
    "outlinks": [
        "https://mie.uic.edu/undergraduate/student-resources/",
        "https://mie.uic.edu/graduate/resources/",
        "https://mie.uic.edu/undergraduate/courses/",
        "https://mie.uic.edu/graduate/courses/",
        "https://mie.uic.edu/undergraduate/em-major/",
        "https://library.uic.edu/",
        "https://mie.uic.edu/seminars/",
        "https://mie.uic.edu/faculty-and-staff/faculty-resources/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/ie/",
        "https://mie.uic.edu/faculty-and-staff/staff/",
        "https://uic.edu/",
        "https://mie.uic.edu/graduate/phd-programs/preliminary-exam/",
        "https://engineering.uic.edu/",
        "https://mie.uic.edu/faculty-and-staff/affiliate-faculty/",
        "https://mie.uic.edu/undergraduate/ie-major/",
        "https://mie.uic.edu/research-page/",
        "https://mie.uic.edu/graduate/admissions/funding-and-financial-aid/",
        "https://mie.uic.edu/undergraduate/minors/",
        "https://mie.uic.edu/research-page/mie-research-areas/",
        "https://mie.uic.edu/about/me/",
        "https://mie.uic.edu/about/",
        "https://mie.uic.edu/undergraduate/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/me/ms/",
        "https://mie.uic.edu/graduate/admissions/graduate-admissions-faq/",
        "https://mie.uic.edu/faculty-and-staff/",
        "https://grad.uic.edu/admissions",
        "https://mie.uic.edu/graduate/admissions/",
        "https://mie.uic.edu/",
        "https://mie.uic.edu/undergraduate/admitted-students/",
        "https://mie.uic.edu/undergraduate/me-major/",
        "https://uic.edu/about/job-opportunities",
        "https://mie.uic.edu/graduate/international-programs/",
        "https://today.uic.edu/events",
        "https://mie.uic.edu/undergraduate/internships-and-jobs/",
        "https://mie.uic.edu/graduate/student-profiles/",
        "https://mie.uic.edu/about/ie/",
        "https://mie.uic.edu/undergraduate/abet-accreditation/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/ie/ms/",
        "https://mie.uic.edu/graduate/masters-programs/ms-thesis-information/",
        "https://today.uic.edu/",
        "https://engineering.uic.edu/support/",
        "https://mie.uic.edu/faculty-and-staff/open-positions/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://mie.uic.edu/undergraduate/student-profiles/",
        "https://mie.uic.edu/faculty-and-staff/department-head/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://mie.uic.edu/about/contact/",
        "https://mie.uic.edu/graduate/phd-programs/",
        "https://mie.uic.edu/research-page/labs/",
        "https://mie.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://maps.uic.edu/",
        "https://mie.uic.edu/about/advisory-board/",
        "https://mie.uic.edu/undergraduate/admissions/",
        "https://energyengineering.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://mie.uic.edu/graduate/phd-dissertations/",
        "https://mie.uic.edu/faculty-and-staff/faculty/",
        "https://mie.uic.edu/mie-news/",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://mie.uic.edu/graduate/",
        "https://mie.uic.edu/undergraduate/student-organizations/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/me/"
    ]
}