{
    "origin_link": "https://mie.uic.edu/graduate/phd-programs/",
    "title": "PhD Programs | Department of Mechanical and Industrial Engineering | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Department of Mechanical and Industrial Engineering     Search the site     Toggle Menu      Search                  Department of Mechanical and Industrial Engineering      Department of Mechanical and Industrial Engineering   Main Menu    Undergraduate           Admitted Students    Admissions    Accreditation    Courses    ME Major    IE Major    EM Major    Minors    Internships and Jobs    Student Groups    Student Profiles    Student Resources         Graduate           Admissions    Courses    International Programs    Master’s Programs    PhD Programs    PhD Dissertations    Post-Graduation Outcomes    Student Profiles    Student Resources         Research           Research Areas    Labs         Faculty and Staff           Department Head    Core Faculty    Affiliate Faculty    Emeritus Faculty    Staff    Open Positions         News           Department Seminars    News         About           Mechanical Engineering    Industrial Engineering    Energy Engineering    Advisory Board    Contact    Head's Message          Eyebrow menu    Giving    Alumni    College of Engineering Home    UIC menu    UIC.edu    Campus Map       Search               View Menu           Breadcrumbs   Department of Mechanical and Industrial Engineering    Graduate Programs    PhD Programs        PhD Programs  Doctoral students in mechanical and industrial engineering develop their own research agendas in one (or more than one) of our 22 research labs, working alongside faculty mentors who are pursuing investigations with National Science Foundation funding and other grants. Our doctoral programs are highly selective and turn out top-tier candidates for high-level industry jobs, postdoctoral research positions, and tenure-track faculty roles at universities around the world.       UIC MIE offers two PhD programs:     PhD in Mechanical Engineering   Conduct research on the forefront of biomedical engineering, computational mechanics, energy, microscale and nanoscale science and engineering, and other areas.     PhD in Industrial Engineering and Operations Research   Develop expertise in core disciplines in industrial engineering, such as data-driven decision-making and design, controls, and manufacturing.          Program Overview   The PhD requires 108 semester hours, beginning with coursework and culminating in the research, writing, and defense of an original dissertation. UIC MIE welcomes applicants who are completing (or who have already completed) a master’s degree in their field as well as applicants with only an undergraduate degree.  For students admitted with a prior master’s degree in their field of study , the degree requirements for the PhD in mechanical engineering or the PhD in industrial engineering and operations research include 24 credit hours of traditional coursework, 52 credit hours of doctoral-level research, and semesterly enrollment in the zero-credit ME 595 or IE 595 Departmental Seminar, which builds students’ current knowledge of the field by exposing them to presentations from UIC scholars and external researchers.  For students who are directly admitted after a bachelor’s degree in their field of study , the degree requirements for the PhD in mechanical engineering or the PhD in industrial engineering and operations research include 48 hours of traditional coursework, 60 credits of doctoral-level research, and semesterly enrollment in the zero-credit ME 595 or IE 595 Departmental Seminar.  Please expand the sections below to learn about the requirements in more detail.       PhD Degree Requirements     PhD in Mechanical Engineering with a prior MS degree         ME requirements   24 credit hours of coursework   12 of these credit hours must be at the 500 level, excluding ME 596, ME 598, and ME 599. At least 8 of these credit hours must be ME courses. 4 credit hours of ME 594 may be used toward this requirement.  The remaining 12 of these credit hours must be in courses at the 400 level or 500 level. At least 4 of these credit hours must be ME courses. Up to 4 hours of ME 596 and up to 4 hours of 400-level or 500-level mathematics and statistics can be used toward this requirement.   52 credit hours of research   Students must complete 52 hours of ME 599 PhD Thesis Research.   Additional notes   Students must enroll in and complete the ME 595 Departmental Seminar in all fall and spring semesters.  Students must get the director of graduate studies’ approval to take online courses.  All courses must be approved first by the student’s advisor and then by the director of graduate studies.  No credit toward the degree will be given for courses taken as credit/no-credit.         PhD in Mechanical Engineering without a prior MS degree         ME requirements - direct admission   48 credit hours of coursework   24 of these credit hours must be at the 500 level, excluding ME 596, ME 598, and ME 599. At least 12 of these credit hours must be ME courses. 4 credit hours of ME 594 may be used toward this requirement.  The remaining 24 of these credit hours must be in courses at the 400 level or 500 level. At least 8 of these credit hours must be ME courses. Up to 4 hours of ME 596 and up to 4 hours of 400-level or 500-level mathematics and statistics can be used toward this requirement.   60 credit hours of research   Students must complete 60 hours of ME 599 PhD Thesis Research.   Additional notes   Students must enroll in and complete the ME 595 Departmental Seminar in all fall and spring semesters.  Students must get the director of graduate studies’ approval to take online courses.  All courses must be approved first by the student’s advisor and then by the director of graduate studies.  No credit toward the degree will be given for courses taken as credit/no-credit.         PhD in Industrial Engineering and Operations Research with a prior MS degree         IE requirements   24 credit hours of coursework   12 of these credit hours must be at the 500 level, excluding IE 596, IE 598, and IE 599. At least 8 of these credit hours must be IE courses.  The remaining 12 of these credit hours must be in courses at the 400 level or 500 level. At least 4 of these credit hours must be IE courses. Up to 4 hours of IE 596 and up to 8 hours of 400-level or 500-level mathematics and statistics can be used toward this requirement.   52 credit hours of research   Students must complete 52 hours of IE 599 PhD Thesis Research.   Additional notes   Students must enroll in and complete the IE 595 Departmental Seminar in all fall and spring semesters.  Students must get the director of graduate studies’ approval to take online courses.  All courses must be approved first by the student’s advisor and then by the director of graduate studies.  No credit toward the degree will be given for courses taken as credit/no-credit.         PhD in Industrial Engineering and Operations Research without a prior MS degree         IE requirements - direct admission   48 credit hours of coursework   24 of these credit hours must be at the 500 level, excluding IE 596, IE 598, and IE 599. At least 12 of these credit hours must be IE courses.  The remaining 24 of these credit hours must be in courses at the 400 level or 500 level. At least 8 of these credit hours must be IE courses. Up to 4 hours of IE 596 and up to 8 hours of 400-level or 500-level mathematics and statistics can be used toward this requirement.   60 credit hours of research   Students must complete 60 hours of IE 599 PhD Thesis Research.   Additional notes   Students must enroll in and complete the IE 595 Departmental Seminar in all fall and spring semesters.  Students must get the director of graduate studies’ approval to take online courses.  All courses must be approved first by the student’s advisor and then by the director of graduate studies.  No credit toward the degree will be given for courses taken as credit/no-credit.              Preliminary Examination   PhD students must pass a preliminary examination before they begin the final phase of their doctoral study. Visit the Preliminary Examination page for full details.       Dissertation Process   Upon completion of all degree requirements and the dissertation, students must orally defend their work before their committee.       Additional Resources for PhD Students in MIE    Course descriptions:  ME – IE  Degree requirements:  PhD in Mechanical Engineering  Degree requirements:  PhD in Industrial Engineering and Operations Research  Graduate courses page  Graduate student resources page           Graduate           Admissions     Apply Now    Financial Aid and Funding    Graduate Admissions FAQ      Courses    International Programs    Master’s Programs     MS Thesis Information      PhD Programs     Preliminary Examination      PhD Dissertations    Post-Graduation Outcomes    Student Profiles    Student Resources                    ",
    "outlinks": [
        "https://mie.uic.edu/undergraduate/student-resources/",
        "https://mie.uic.edu/graduate/resources/",
        "https://mie.uic.edu/undergraduate/courses/",
        "https://mie.uic.edu/graduate/courses/",
        "https://mie.uic.edu/undergraduate/em-major/",
        "https://library.uic.edu/",
        "https://mie.uic.edu/seminars/",
        "https://mie.uic.edu/faculty-and-staff/faculty-resources/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/ie/",
        "https://mie.uic.edu/faculty-and-staff/staff/",
        "https://uic.edu/",
        "https://mie.uic.edu/graduate/phd-programs/preliminary-exam/",
        "https://engineering.uic.edu/",
        "https://mie.uic.edu/faculty-and-staff/affiliate-faculty/",
        "https://mie.uic.edu/undergraduate/ie-major/",
        "https://mie.uic.edu/research-page/",
        "https://mie.uic.edu/graduate/admissions/funding-and-financial-aid/",
        "https://mie.uic.edu/undergraduate/minors/",
        "https://mie.uic.edu/research-page/mie-research-areas/",
        "https://mie.uic.edu/about/me/",
        "https://mie.uic.edu/about/",
        "https://mie.uic.edu/undergraduate/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/ie/phd/",
        "https://mie.uic.edu/graduate/admissions/graduate-admissions-faq/",
        "https://mie.uic.edu/faculty-and-staff/",
        "https://grad.uic.edu/admissions",
        "https://mie.uic.edu/graduate/admissions/",
        "https://mie.uic.edu/",
        "https://mie.uic.edu/undergraduate/admitted-students/",
        "https://mie.uic.edu/undergraduate/me-major/",
        "https://uic.edu/about/job-opportunities",
        "https://mie.uic.edu/graduate/international-programs/",
        "https://today.uic.edu/events",
        "https://mie.uic.edu/undergraduate/internships-and-jobs/",
        "https://mie.uic.edu/graduate/student-profiles/",
        "https://mie.uic.edu/about/ie/",
        "https://mie.uic.edu/undergraduate/abet-accreditation/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://mie.uic.edu/graduate/masters-programs/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/me/phd/",
        "https://mie.uic.edu/graduate/masters-programs/ms-thesis-information/",
        "https://today.uic.edu/",
        "https://engineering.uic.edu/support/",
        "https://mie.uic.edu/faculty-and-staff/open-positions/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://mie.uic.edu/undergraduate/student-profiles/",
        "https://mie.uic.edu/faculty-and-staff/department-head/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://mie.uic.edu/about/contact/",
        "https://mie.uic.edu/research-page/labs/",
        "https://mie.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://maps.uic.edu/",
        "https://mie.uic.edu/about/advisory-board/",
        "https://mie.uic.edu/undergraduate/admissions/",
        "https://energyengineering.uic.edu/",
        "https://engineeringalumni.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://mie.uic.edu/graduate/phd-dissertations/",
        "https://mie.uic.edu/faculty-and-staff/faculty/",
        "https://mie.uic.edu/mie-news/",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://mie.uic.edu/graduate/",
        "https://mie.uic.edu/undergraduate/student-organizations/",
        "https://catalog.uic.edu/gcat/colleges-schools/engineering/me/"
    ]
}