{
    "origin_link": "https://www.ece.uic.edu/~dliu/R/CIL/",
    "title": "CIL - Computational Intelligence Laboratory",
    "contents": " This is the Computational Intelligence Laboratory | Click here for Derong Liu's web site   Computational Intelligence Laboratory     Keywords: Liu, D. Liu, Derong Liu,\ncomputational intelligence,\n        intelligent systems, intelligent control,\n    reinforcement learning, machine learning,\n    adaptive critic designs, ACDs, neuro-dynamic programming, NDP,\n    approximate dynamic programming,\nasymptotic dynamic programming,\nadaptive dynamic programming, ADP,\n        neural networks,\n    recurrent neural networks, cellular neural networks, CNNs, associative memories,\n    control systems, nonlinear dynamical systems,\n    multimedia, traffic control, call admission control, CAC,\n    traffic modeling, performance analysis,\n    wireless networks, cellular networks, CDMA wireless networks,\n    power control,\n        broadband networks, ATM networks, video processing,\n    financial engineering       Welcome from the Lab Director Professor Derong Liu   Mission Statement and Project Descriptions   People from the Laboratory   Research Support   Useful Links      Welcome from Professor Derong Liu   Welcome to the Computational Intelligence Laboratory (CIL) in\nthe Department of Electrical and Computer Engineering at the University of Illinois near downtown Chicago, Illinois.\nThis laboratory was established in August 1999.\nThe purpose of setting up such a laboratory\nis to provide a lab that supports a research program which strives to bring\ntogether the results of academic research in\nthe field of computational intelligence and the problems encountered in\nengineering practice. If you have any questions,\ncomments, or suggestions, please send e-mail to dliu@ece.uic.edu .        Computational Intelligence Laboratory (CIL)  The mission of CIL is to develop\nmethods, tools, and technology\nfor the design and implementation of learning systems which mimic\nthe learning process of humans, and apply them to real world problems.\nThe goal is to solve complex engineering problems\nwhich are difficult to deal with using conventional approaches.\nCurrent application areas include traffic control/management in telecommunication networks\n    and learning control methodologies for automotive engines,\n among others.\nThe emphasis in CIL is on collaboration with\nresearchers and practitioners from academia and industry.\n\nSome of the current projects in the laboratory are:     Computational Intelligence  Click here  Computational intelligence combines elements of learning, adaptation, evolution and\nfuzzy logic (rough sets) to create systemss that are, in some sense, intelligent.\nOur research covers neural\nnetworks, fuzzy systems and evolutionary computation, including swarm intelligence,\nas well as their applications.  Computational Neuroscience  Click here    Intelligent Control and Learning Control  Click here  Click here  Click here   Click here  Book | Book | Book | Book   Our current interest in this field is\n    neural network-based approaches for intelligent systems and learning control.\n    In particular, our study is focused on neural network-based\n    adaptive critic designs. Adaptive critic designs are designs\n    that approximate dynamic\n       programming in the general case, i.e., approximate optimal control\n    over time in noisy, nonlinear environments. There are many practical\n       problems that can be formulated as to minimize or maximize\n    a measure of cost.\n    It is well-known that dynamic programming is very useful in\n    solving these problems.\n       However, it is often computationally untenable to run true dynamic\n    programming due to the backward numerical process required for its\n       solutions, i.e., due to the \"curse of dimensionality.\"\n    Over the years, progress has been made to circumvent the\n    \"curse of dimensionality\" by\n       building a system, called \"critic\" to approximate the cost\n    function in dynamic programming. The idea is to approximate dynamic\n       programming solutions by using a function approximation structure\n    such as neural networks to approximate the cost function.\n    Our work includes methodology\n    development and applications of adaptive\n       critic designs to automotive engine control.  Click here for publications      This laboratory contains\n       a cluster of multimedia Pentium PCs. The laboratory is located in 910 SEO.    People from the Lab   Current members:    Derong Liu, Director  Xinliang Liu, Ph.D. Student, Aug. 2015 - present\n(BS, 2015, Beijing University of Technology) Shu Wang, Ph.D. Student, Aug. 2008 - present\n(BS, 2008, Northeastern University)  Visiting members:   Alessandro Bastari (Italy), 2006  Hossein Javaherian (USA), 2003-2013 Qi Kang (China), 2007-2008 Xiaofeng Lin (China), 2008-2009 Le Liu (China), 2008-2010 Frank Meier (Germany), 2002 Dan Meng (China), 2006-2007 Alexander Molchanov (Russia), 2000, 2002 Hector D.\nPatino (Argentina), 1997-1998 Jinhua Sheng (China), 2001-2003 Chonghui Song (China), 2006-2008 Stefano Squartini (Italy), 2004 Guofang Tu (China), 2003-2004 Lei Wang (China), 2007-2008 Guowei Yang (China), 2008-2009 Huaguang Zhang (China), 2004  Former members:   Dr. Ying Cai (Ph.D., 2005)   Dr. Myron E. Hohil (Ph.D., 1998)   Dr. Sanqing Hu (Ph.D., 2006)   Dr. Ting Huang (Ph.D. 2011)   Dr. Ning Jin (Ph.D. 2011)   Dr. John C. Kiss\n    (Ph.D., 1996)   Dr. Sergio Ledesma (Ph.D., 2000)  Dr. Zanjun\n    Lu (Ph.D., 1999)   Dr. Yingying Ma (Ph.D. 2014)   Dr. Zhongyu Pang (Ph.D., 2007)   Dr. Endre I.\n    Sara (Ph.D., 1999)   Dr. Zhuo Wang (Ph.D. 2013)   Dr. Xiaoxu Xiong (Ph.D., 2006)  Dr. Yi Zhang (Ph.D., 2004)  Ms. Sthitaprajna Acharya (M.Sc., 2000)  Ms. Gayathri Kalyanaraman (M.Sc., 2003)  Ms. Olesia Kovalenko (M.Sc., 2005)  Ms. Priyagayatry Krishnaswamy (M.Sc., 2003)  Mr. Saumya Tripathi (M.Sc., 2000)  Mr. Vijay Vemuri (M.Sc., 2000)    Research Support  Research in this laboratory has been supported by:   Blonder Broadcasting Corporation  General Motors  National Science Foundation  UIC\nCampus Research Board  UIC Department of Electrical Engineering and Computer Science (now ECE and CS departments)    Useful Links   The ECE Department   The Bioengineering Department   The CS Department   University of Illinois Main Page   Web Resources on Intelligent Control  Applied Computational Intelligence Laboratory   Computational Intelligence Applications Laboratory   Computational Intelligence Laboratory   NW\n                     Computational Intelligence Laboratory      Author: Derong Liu  E-Mail: dliu@ece.uic.edu  ",
    "outlinks": [
        "https://www.cs.uic.edu/",
        "https://www.ece.uic.edu/~dliu/R/CIL/Visitors/xlin.html",
        "https://tigger.uic.edu/depts/ovcr/research/funding/crb.shtml",
        "https://www.ece.uic.edu/~dliu/R/CIL/index.html",
        "https://www.ece.uic.edu/~dliu/LIU/alumni.html",
        "https://www.ece.uic.edu/~dliu/R/CIL/Visitors/hjava.html",
        "https://www.ece.uic.edu/~dliu/R/main.html",
        "https://www.ece.uic.edu/~dliu/R/CIL/Visitors/gtu.html",
        "https://www.ece.uic.edu/~dliu/R/CIL/Visitors/lwang.html",
        "https://www.ece.uic.edu/~dliu/R/CIL/Visitors/lliu.html",
        "https://www.ece.uic.edu/~dliu/R/CIL/als.html",
        "https://www.ece.uic.edu/~dliu/R/TCIC",
        "https://www.ece.uic.edu/~dliu/R/CIL/Visitors/hzhang.html",
        "https://www.ece.uic.edu/~dliu/index.html",
        "https://www.ece.uic.edu/~dliu/R/CIL/Visitors/dmeng.html",
        "https://www.ece.uic.edu/~dliu/R/CIL/Visitors/qkang.html",
        "https://www.ece.uic.edu/~dliu/R/CIL/Visitors/csong.html",
        "https://www.ece.uic.edu/~dliu/R/CIL/Visitors/gyang.html",
        "https://www.uic.edu/",
        "https://www.ece.uic.edu/",
        "https://www.eecs.uic.edu/",
        "https://www.uic.edu/depts/bioe/"
    ]
}