{
    "origin_link": "https://ece.uic.edu/graduate/admissions/",
    "title": "Admissions | Department of Electrical and Computer Engineering | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Department of Electrical and Computer Engineering     Search the site     Toggle Menu      Search                  Department of Electrical and Computer Engineering      Department of Electrical and Computer Engineering   Main Menu    Undergraduate           Admitted Students    Admissions    Accreditation    CE Major    EE Major    EP Major    Courses    Internships and Jobs    Minors    Student Groups    Student Profiles    Student Resources         Graduate           Admitted Students    Admissions    Courses    MS Program    PhD Program    PhD Dissertations    Post-Graduation Outcomes    Student Profiles    Student Resources         Research           Research Areas    Featured Research    Labs    Research Experiences for Undergraduates    Sponsors         Faculty and Staff           Department Head    Faculty    Emeritus Faculty    Adjunct Faculty    Professional Organizations    Resources    Staff    Open Positions         News    Events     Eyebrow menu    Giving    Alumni    College of Engineering Home    UIC menu    UIC.edu    Campus Map       Search               View Menu           Breadcrumbs   Department of Electrical and Computer Engineering    Graduate    Admissions        Admissions       Preparing for Graduate Study at UIC      MS applicants: Successful master’s program applicants should have an undergraduate degree from an accredited college or university in electrical engineering, computer engineering, or a related field. MS applicants should have a GPA of 3.0 or higher on a scale of 4.0, based on the last 60 hours of undergraduate coursework completed. Download our MS degree booklet for an overview of our master’s program.  PhD applicants: Successful applicants for doctoral study should have a master of science degree in electrical engineering, computer engineering, or a related field and should have completed substantial coursework in the chosen field of study. The department does consider outstanding PhD applicants who have only a bachelor’s degree through a program called “direct admission.” Please see the direct admission section below for more information. PhD applicants should have a GPA of 3.5 or higher on a scale of 4.0, based on the last 60 hours of undergraduate coursework completed.  Note: In making all admissions decisions, the department does consider the institution where you earned your prior degrees: for example, the requirements above may be relaxed slightly if you studied at a top-ranked school in your country.       Application Process   There are two phases to the admissions process for graduate study in electrical and computer engineering.  Step 1: Graduate College review. Prospective graduate students must apply for admission through the UIC Graduate College . Within two to three days of completing your online Graduate College application, you will receive an email acknowledging receipt and indicating that you can log back into the system to begin uploading supplementary application materials (see Step 2 below).  Step 2: Departmental review. The department is very interested in reviewing the additional documents you will upload as part of the application process. These include your statement of purpose, résumé, GRE general test scores, specialization form (for PhD applicants only), and other documents you might want to submit for consideration. These documents will help to distinguish you from other applicants. The next section explains them in detail.       Application Requirements for MS and PhD Students   Applicants must meet the requirements of the Graduate College and the requirements of the electrical and computer engineering department. In general, applicants should be prepared with the following:   Admissions application  completed online  Transcripts of all previous undergraduate and graduate work  GRE general test scores (non-U.S. degree holders only). GRE general test scores are required for applicants earned their undergraduate degree outside the United States. Students who received degrees from U.S. colleges and universities do not need to submit scores but are encouraged to do so if they feel their test performance would enhance their prospects for admission or financial aid. For score reporting, our institution code is 1851, and no department code is required.  English competency test. Applicants whose native language is not English are required to take an English competency test. Minimum required scores are: iBT Internet-based TOEFL of 80, with subscores of Reading 19, Listening 17, Speaking 20, and Writing 21; New Paper-Based TOEFL (after August 2018) of 60, with subscores of Reading 19, Listening 17, Writing 21; Institutional Testing Paper-Based TOEFL (prior to August 2018) of 550; IELTS of 6.5, with all four subscores of at least 6.0; or PTE-Academic of 54, with subscores of Reading 51, Listening 47, Speaking 53, and Writing 56.  Application for Graduate Appointment form, personal statement, and résumé/CV (PhD applicants only). These items are required for PhD applicants who want to be considered for fellowships, assistantships, tuition and fee waivers, and other forms of financial aid.  Letters of recommendation (PhD applicants only). Letters should be written by people who are familiar with your academic work and who can assess your potential for success in graduate studies and research. Note: during the application process, you will be asked to provide the email addresses of your references, and UIC will contact these individuals to request the references directly.          Direct Admission for PhD Applicants   Most PhD applicants already have earned (or are about to complete) a master of science degree in electrical engineering, computer engineering, or a related field. However, exceptional applicants who seek to start the PhD with only an undergraduate degree may be considered for what is called “direct admission.” Students who are admitted to the PhD program with only a bachelor’s degree in electrical engineering, computer engineering, or a related field must complete all 108 credit hours toward the PhD degree (compared with students entering with an MS degree, who can transfer in 32 earned credits from their master’s program).       Deadlines     For students seeking to begin study in the fall semester:   January 15: Recommended deadline for PhD applicants to be considered for financial aid  February 15: International PhD applicants  May 1: New extended deadline for international MS applicants  May 15: Domestic PhD applicants  June 15: New extended deadline for domestic MS applicants   For students seeking to begin study in the spring semester:   July 15: All international applicants (MS and PhD)  November 1: All domestic applicants (MS and PhD)   All current application deadlines are available on the Graduate College’s admissions deadlines page .          Graduate           Admitted Students    Admissions     Apply Now    Financial Aid and Funding    Graduate Admissions FAQ      Courses    MS Program    PhD Program     Qualifying Examination    Preliminary Examination    Dissertation Process      PhD Dissertations    Post-Graduation Outcomes    Student Profiles    Student Resources                    ",
    "outlinks": [
        "https://ece.uic.edu/undergraduate/courses/",
        "https://ece.uic.edu/",
        "https://ece.uic.edu/ece-research/",
        "https://ece.uic.edu/graduate/admissions/financial-aid-and-funding/",
        "https://ece.uic.edu/undergraduate/internships-and-jobs/",
        "https://library.uic.edu/",
        "https://ece.uic.edu/undergraduate/accreditation/",
        "https://ece.uic.edu/faculty-and-staff/staff/",
        "https://ece.uic.edu/faculty-and-staff/",
        "https://uic.edu/",
        "https://ece.uic.edu/graduate/student-profiles/",
        "https://engineering.uic.edu/",
        "https://ece.uic.edu/faculty-and-staff/faculty/",
        "https://ece.uic.edu/faculty-and-staff/department-head/",
        "https://ece.uic.edu/undergraduate/admitted-students/",
        "https://ece.uic.edu/ece-research/areas/",
        "https://ece.uic.edu/undergraduate/student-profiles/",
        "https://ece.uic.edu/undergraduate/student-resources/",
        "https://ece.uic.edu/ece-research/reus/",
        "https://grad.uic.edu/admissions",
        "https://ece.uic.edu/graduate/phd-program/dissertation-process/",
        "https://ece.uic.edu/graduate/ms-program/",
        "https://ece.uic.edu/contact/",
        "https://ece.uic.edu/ece-events/",
        "https://ece.uic.edu/undergraduate/student-organizations/",
        "https://ece.uic.edu/graduate/student-resources/",
        "https://ece.uic.edu/ece-news/",
        "https://uic.edu/about/job-opportunities",
        "https://ece.uic.edu/ece-research/labs/",
        "https://ece.uic.edu/faculty-and-staff/open-positions/",
        "https://ece.uic.edu/undergraduate/undergraduate-admissions/",
        "https://today.uic.edu/events",
        "https://ece.uic.edu/faculty-and-staff/adjunct-faculty/",
        "https://ece.uic.edu/undergraduate/",
        "https://ece.uic.edu/ece-research/featured-research/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://today.uic.edu/",
        "https://ece.uic.edu/ece-research/sponsors/",
        "https://engineering.uic.edu/support/",
        "https://ece.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://ece.uic.edu/undergraduate/minors-in-ece/",
        "https://ece.uic.edu/faculty-and-staff/professional-organizations/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://ece.uic.edu/undergraduate/ce-major/",
        "https://ece.uic.edu/graduate/admissions/graduate-admissions-faq/",
        "https://ece.uic.edu/graduate/phd-program/qualifying-examination/",
        "https://ece.uic.edu/graduate/",
        "https://maps.uic.edu/",
        "https://ece.uic.edu/graduate/courses/",
        "https://ece.uic.edu/graduate/phd-program/preliminary-examination/",
        "https://engineeringalumni.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://ece.uic.edu/graduate/phd-program/",
        "https://ece.uic.edu/undergraduate/ep-major/",
        "https://ece.uic.edu/faculty-and-staff/faculty-resources/",
        "https://admissions.uic.edu/graduate-professional/requirements-deadlines",
        "https://admissions.uic.edu/graduate-professional/apply",
        "https://grad.uic.edu/deadlines",
        "https://disabilityresources.uic.edu/",
        "https://ece.uic.edu/graduate/phd-dissertations/",
        "https://emergency.uic.edu/",
        "https://ece.uic.edu/graduate/admitted-graduate-students/",
        "https://ece.uic.edu/undergraduate/ee-major/"
    ]
}