{
    "origin_link": "https://ece.uic.edu/undergraduate/internships-and-jobs/",
    "title": "Internships and Jobs | Department of Electrical and Computer Engineering | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the secondary menu , the site search form , the site home page .           Department of Electrical and Computer Engineering     Search the site     Toggle Menu      Search                  Department of Electrical and Computer Engineering      Department of Electrical and Computer Engineering   Main Menu    Undergraduate           Admitted Students    Admissions    Accreditation    CE Major    EE Major    EP Major    Courses    Internships and Jobs    Minors    Student Groups    Student Profiles    Student Resources         Graduate           Admitted Students    Admissions    Courses    MS Program    PhD Program    PhD Dissertations    Post-Graduation Outcomes    Student Profiles    Student Resources         Research           Research Areas    Featured Research    Labs    Research Experiences for Undergraduates    Sponsors         Faculty and Staff           Department Head    Faculty    Emeritus Faculty    Adjunct Faculty    Professional Organizations    Resources    Staff    Open Positions         News    Events     Eyebrow menu    Giving    Alumni    College of Engineering Home    UIC menu    UIC.edu    Campus Map       Search               View Menu           Breadcrumbs   Department of Electrical and Computer Engineering    Undergraduate    Internships and Jobs        Internships and Jobs  This page is designed to help electrical engineering, computer engineering, and engineering physics students focus on the career resources that align with their fields. Undergraduates are encouraged to complete at least two internships before graduation—for skill development as well as a competitive edge in the full-time job search. The Engineering Career Center (ECC)  is here to help you along the way! Visit its site early (and often) to make the most of its resources and dedicated staff.       Learn how Research Experiences for Undergraduates can advance your career in ECE            Visit our ECE REUs page               Visit the NSF's REUs page          Prepare for your search     ECE-related titles to search:    Computer Architect  Data Scientist  Design Engineer  Digital Operations Engineer  Embedded Systems Engineer  Full Stack Web Developer  Hardware Engineer          IT Software Analyst  IT Specialist  Mobile Application Developer  Network Engineer  Patent Engineer  Project Engineer  Software Developer          Software Engineer  Software Quality Assurance Analyst  System Verification Engineer  Systems Engineer  Technology Analyst  Wireless Network Engineer           Where to search     ECE-related websites:    1871 job board  Angel’s List  Association Connecting Electronics Industries  Built in Chicago  Dice          EngineerJobs.com – Computer  EngineerJobs.com – Electrical  IEEE job board          Visit the  Engineering Career Center       What do ECE alumni do after graduation?   The mini-profiles below offer a few examples of the thousands of rewarding careers pursued by alumni of UIC’s undergraduate programs in electrical engineering and computer engineering.       Rina Binxhiu, BS ’18      Systems Engineer  Dell  What’s great about your job? Working in a big company can be overwhelming, but I appreciate the opportunity to learn about a variety of products and technologies without needing to change jobs. Getting to work with people who have 15 years of experience is a very valuable experience, too. You get to learn from the people who developed a lot of great technologies and have so much knowledge to share.  Why did you choose UIC? I based my decision on the classes that were offered from different schools. I was interested in UIC’s computer engineering curriculum. My former professors have impressive engineering backgrounds, and I am honored I got to learn from them.  What was the most valuable student organization you joined, and why? Being a part of the Society of Women Engineers (SWE) was one of the best experiences at UIC. I got to be part of a community of girls whom I still keep in contact with, and I helped other young girls get introduced to engineering. I got my current job through the SWE career fair and will always be thankful for the support this organization gave me.  Would you recommend the College of Engineering to new applicants? If so, why? Choosing UIC gave me valuable skills and opened many doors for me. If you are hardworking and engineering is your passion, I would strongly recommend it and encourage everyone to give engineering a chance.       Zach Hellriegel, BS ’19      Systems Integration/Test Engineer  Lockheed Martin Corporation  What are some of your day-to-day tasks? I meet and collaborate with other engineers and planners to achieve set goals, develop integration and test processes for various system components, and create test and validation procedures for various test equipment.  What’s great about your job? Learning new things on the job and meeting many different types of people in the field. Also, I have a flexible schedule with every other Friday off work.  What was the most valuable student organization you joined, and why? The most valuable student organization I joined was the Society of Asian Scientists and Engineers because it helped me to meet other students in the field and led me to my first job out of college.  Fun fact about you that few people are aware of: I am a second-degree black belt in Tae Kwon Do.       Megan Dague, BS ’19      Hardware Engineer  Northrop Grumman  What are some of your day-to-day tasks? Testing hardware in the lab, writing test procedures, assisting in the design process, and other things!  Why did you choose UIC? I chose UIC because of the many opportunities the College of Engineering offered. One in particular is the Guaranteed Paid Internship Program . I don’t think any other school offers internships to students after their first year of college, and it helps students get that first internship, which can be the hardest to get!  What was your favorite course?  ECE 412 Introduction to Filter Synthesis .  Engineering-industry person you admire most, and why: Edith Clarke, the first female electrical engineer!  One-sentence “Words of wisdom” to share with students: Get involved with student organizations and take advantage of all opportunities the college gives you!            Undergraduate           Admitted Students    Admissions    Accreditation    CE Major    EE Major    EP Major    Courses    Internships and Jobs    Minors    Student Groups    Student Profiles    Student Resources                    ",
    "outlinks": [
        "https://ece.uic.edu/undergraduate/courses/",
        "https://ece.uic.edu/",
        "https://ece.uic.edu/ece-research/",
        "https://library.uic.edu/",
        "https://ece.uic.edu/undergraduate/accreditation/",
        "https://ece.uic.edu/faculty-and-staff/staff/",
        "https://ece.uic.edu/faculty-and-staff/",
        "https://ecc.uic.edu/",
        "https://uic.edu/",
        "https://ece.uic.edu/graduate/student-profiles/",
        "https://engineering.uic.edu/",
        "https://ece.uic.edu/faculty-and-staff/faculty/",
        "https://ece.uic.edu/faculty-and-staff/department-head/",
        "https://ece.uic.edu/undergraduate/admitted-students/",
        "https://ece.uic.edu/ece-research/areas/",
        "https://swe.engr.uic.edu/",
        "https://ece.uic.edu/undergraduate/student-profiles/",
        "https://ece.uic.edu/undergraduate/student-resources/",
        "https://ece.uic.edu/ece-research/reus/",
        "https://ece.uic.edu/graduate/ms-program/",
        "https://ece.uic.edu/contact/",
        "https://ece.uic.edu/ece-events/",
        "https://ece.uic.edu/undergraduate/student-organizations/",
        "https://ece.uic.edu/graduate/student-resources/",
        "https://ece.uic.edu/ece-news/",
        "https://uic.edu/about/job-opportunities",
        "https://ece.uic.edu/ece-research/labs/",
        "https://ece.uic.edu/faculty-and-staff/open-positions/",
        "https://ece.uic.edu/undergraduate/undergraduate-admissions/",
        "https://today.uic.edu/events",
        "https://ece.uic.edu/faculty-and-staff/adjunct-faculty/",
        "https://ece.uic.edu/undergraduate/",
        "https://ece.uic.edu/ece-research/featured-research/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://ece.uic.edu/graduate/admissions/",
        "https://ece.uic.edu/ece-research/sponsors/",
        "https://engineering.uic.edu/support/",
        "https://ece.uic.edu/faculty-and-staff/emeritus-faculty/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://ece.uic.edu/undergraduate/minors-in-ece/",
        "https://ece.uic.edu/faculty-and-staff/professional-organizations/",
        "https://uihealth.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://ece.uic.edu/undergraduate/ce-major/",
        "https://ece.uic.edu/graduate/",
        "https://maps.uic.edu/",
        "https://ece.uic.edu/graduate/courses/",
        "https://engineeringalumni.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://ece.uic.edu/graduate/phd-program/",
        "https://ece.uic.edu/undergraduate/ep-major/",
        "https://ece.uic.edu/faculty-and-staff/faculty-resources/",
        "https://ecc.uic.edu/students/freshman-internship-program/",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/",
        "https://ece.uic.edu/graduate/phd-dissertations/",
        "https://ece.uic.edu/graduate/admitted-graduate-students/",
        "https://catalog.uic.edu/all-course-descriptions/ece/",
        "https://ece.uic.edu/undergraduate/ee-major/"
    ]
}