{
    "origin_link": "https://blog.business.uic.edu/",
    "title": "UIC Business",
    "contents": "           Home  //  UIC Business                         Featured Posts       04.28.20 by Kamalika Mitra  Celebrating Student Success & Awards | Bruna Tavares  This year 25 UIC Business students were recognized with the\nChancellor’s Student Service and Leadership Award for the\noutstanding contribution they have made to the university... read more      04.21.20 by Liautaud Stories  Guaranteed and Preferred Graduate Admissions  During these challenging and unique times, the need for advanced\neducation in business is more important than ever. Having an\nadvanced degree can provide you with higher income... read more      04.14.20 by Alumni Posts  Six Questions for Manny Favela  UIC Business caught up with alumnus Manny Favela BS ’88 and asked\nhim six questions about his career experience in the restaurant\nindustry. 1) What inspired you to become an... read more      04.07.20 by Student Posts  UIC Business AMA Visits Facebook Chicago HQ  Our organization, the American Marketing Association - UIC Chapter,\norganizes site visits every semester for our members. We believe\nsite visits are great opportunities for... read more         Read Older Posts              03.14.18   // The Lasting Impact of a UIC Business Education  As the first in his family to receive a college education, Don\nHermanek (BS Marketing ’70) chose to attend The University of\nIllinois at Chicago for his undergraduate...   read more posts >             04.14.20   // Six Questions for Manny Favela  UIC Business caught up with alumnus Manny Favela BS ’88 and asked\nhim six questions about his career experience in the restaurant\nindustry. 1) What inspired you to become...   read more posts >             08.27.18   // Sarah Siderius Gets the Job Done at Google  Ranked third on the Forbes: Best American Employers list, Google is\none of the most recognized companies on the planet. While most know\nthe company as a high-powered...   read more posts >              04.07.20   // UIC Business AMA Visits Facebook Chicago HQ  Our organization, the American Marketing Association - UIC Chapter,\norganizes site visits every semester for our members. We believe\nsite visits are great opportunities...   read more posts >             02.28.19   // Making Black History at UIC: Dr. Benet DeBerry-Spence  As Black History Month comes to a close, UIC Business would\nlike to highlight one of our own Black History makers, Dr. Benet\nDeBerry-Spence, Professor and Department...   read more posts >             04.29.19   // Commencement Countdown with Anurag Vuthunuri  Anurag Vuthunuri is an undergraduate student majoring in Finance\nand minoring in Business Analytics. Anurag has been the President\nof the Finance and Investment Group for...   read more posts >             Events  Twitter  Facebook  Instagram         Copyright © 2020 Board of Trustees of the University of Illinois   ",
    "outlinks": [
        "https://www.business.uic.edu/",
        "https://blog.business.uic.edu/blog/liautaud-student-posts/uic-business-ama-visits-facebook-chicago-hq",
        "https://blog.business.uic.edu/blog/uic-liautaud-blog/guaranteed-and-preferred-graduate-admissions",
        "https://blog.business.uic.edu/blog/liautaud-alumni-profiles/six-questions-for-manny-favela",
        "https://business.uic.edu/events",
        "https://blog.business.uic.edu/blog/research",
        "https://blog.business.uic.edu/blog/liautaud-student-posts",
        "https://blog.business.uic.edu/blog/kamalika-mitra/celebrating-student-success-awards-bruna-tavares-v2",
        "https://blog.business.uic.edu/blog/career-services",
        "https://blog.business.uic.edu/blog/uic-liautaud-blog",
        "https://blog.business.uic.edu/blog/uic-liautaud-graduate-school-of-business",
        "https://blog.business.uic.edu/blog/living-classroom",
        "https://blog.business.uic.edu/blog/imani-watson/making-black-history-at-uic:-dr-benet-deberry-spence",
        "https://blog.business.uic.edu/blog/kamalika-mitra",
        "https://blog.business.uic.edu/blog/student-profiles",
        "https://blog.business.uic.edu/blog/liautaud-alumni-profiles",
        "https://blog.business.uic.edu/blog",
        "https://blog.business.uic.edu/blog/admissions-undergrad",
        "https://blog.business.uic.edu/blog/alumni",
        "https://blog.business.uic.edu/blog/liautaud-alumni-profiles/the-lasting-impact-of-a-uic-business-education",
        "https://blog.business.uic.edu/blog/imani-watson/sarah-siderius-gets-the-job-done-at-google"
    ]
}