{
    "origin_link": "https://business.uic.edu/about-uic-business/",
    "title": "About UIC Business | UIC Business | University of Illinois at Chicago",
    "contents": "                  Skip to the content of this page ,  the main menu , the site search form , the site home page .           UIC Business     Search the site     Toggle Menu      Search                  UIC Business      UIC Business   Main Menu    Undergraduate           Undergrad Admissions    Undergraduate Degrees    UIC Business Scholars    Pre-College Programs    Student Life at UIC Business    Business Career Center    Professional Development         Graduate           Graduate Admissions    Graduate Degrees    Guaranteed and Preferred Admissions    Graduate Career Services         Doctoral           Doctoral Degrees    UIC Doctoral Students         Alumni           Give to UIC Business    Why I Give    Donor Recognition Society    Student Scholarship Support    Ways to Get Involved    Alumni Leadership Academy    Contact the Office of Advancement         Recruiters           Center for Applied Analytics         Faculty/Research           Faculty    Research    International Center for Futures and Derivatives (ICFD)    Institute for Leadership Excellence and Development (iLEAD)    UIC Entrepreneurial Support Program    For the Media    Faculty Recruitment          Eyebrow menu    Give Now    Visit Our Blog    Current Students    About Us    UIC menu    UIC.edu    Campus Map       Search                     About UIC Business       50 Years of Transforming Potential into Success      In 1965, UIC left Navy Pier and the shores of Lake Michigan to build a sprawling urban campus in the Loop’s backyard. As the concrete structures of its Brutalist design began to rise at the border of the city’s financial district, so too did the university’s new College of Business Administration.  What began with three programs—accounting, economics and general business—has proliferated into a top-ranked, research-based business school with an international reputation.  In the college’s 50-year lifespan, it has introduced, discontinued, merged or augmented its offerings to meet the demands of the time. Today, the college is home to four academic departments—accounting, finance, information and decision sciences, and managerial studies.  Our nearly 150 faculty members teach more than 2,500 undergraduate students in seven degree programs in accounting, business administration, entrepreneurship, finance, information and decision sciences, management, and marketing. And we contribute to the creation of new knowledge through our two doctoral programs—the PhD in Business Administration and the PhD in Management Information Systems.  In 2003, thanks to the generosity of the Liautaud family of Chicago, our graduate offerings were named and endowed as the UIC Liautaud Graduate School of Business. Today it serves 300 graduate students in six masters programs—the MBA, Master of Accounting, Master of Business Analytics, Master of Finance, Master of Management Information Systems, and Master of Marketing.  As the city and the world of business have changed, the UIC College of Business Administration has kept pace. In 2012, we introduced the Business Scholars Program, an in-house honors college for high-achieving undergraduate students. Last year, we enriched our curriculum with professional development coursework. This year, we relaunched our online business degree completion program.  Each year, we grow and change so as to be a destination of choice for aspiring business leaders from around the corner or across the globe. Our diverse student body and international Corporate MBA Programs reflect the global business community and provide endless multicultural opportunities for our students and faculty.  Though they come from far and wide, our students and faculty are a reflection of Chicago—hardworking, grounded and resourceful. With each new graduate who joins our rank of 30,000+ alumni, our influence and positive global contributions grow.  Both the college and the campus it was born with have seen tremendous changes in their 50 years. And UIC Business will continue to evolve to meet the changing demands of business and to serve the needs of all our students: past, present and future.  I am proud to be a part of such a storied heritage and I look forward to continuing to help UIC Business produce tomorrow’s business leaders.  Michael Mikhail, Dean of UIC Business       History      UIC’s College of Business Administration had its start at the Circle Campus and conferred its first degrees in June 1966 . The CBA graduate 37 students in its three programs: Accounting, Economics and General Business.  In 1969 , the Board of Trustees gave approval for the CBA to begin offering a Masters of Business Administration. That same year, the Business Advisory Council was formed, an organization that remains to this day and provides a nexus for the college and the business community.  In 1970 , the college formed departments to handle the responsibility of each curriculum. The departments were: Accounting, Economics, Finance, Management, Marketing, and Quantitative Methods.  In 1971 , the college received its initial accreditation from the American Assembly of Collegiate Schools of Business.  In 1980 , the Bachelor of Business Administration was established. In 1981, the Master of Science in Accounting was added and in 1983 , the Doctor of Philosophy in Business Administration was established.  Entrepreneurship made its debut at the college in 1986 with the establishment of the entrepreneurship concentration in the MBA program.  In 2003 ,  thanks to the generosity of the Liautaud family of Chicago, the UIC Liautaud Graduate School of Business was successfully endowed. Jim Liautaud, a lifetime member of the University of Illinois Alumni Association, along with his wife Gina, and their son Jimmy John, provided a generous gift to the college. The Liautaud family is a longtime supporter of the College of Business Administration and the University of Illinois at Chicago. Jim and son Jimmy John both have been inducted to the UIC Entrepreneurship Hall of Fame.       Douglas Hall      Douglas Hall is home to the UIC Business Career Center and is also our main classroom facility for business courses.  The renovation of UIC Douglas Hall provides a state-of-the-art learning environment in the center of the UIC campus.  The three-story building was originally designed as a shared multi -purpose general classroom facility in 1963 using the original concept of Walter Netsch’s Brutalist design, which defined UIC’s campus. The renovation consisted of a total remodel of the existing structure. The building provides an ultra-modern environment with, 6 learning studios, 12 breakout rooms, collaboration space for networking and student projects on each floor and a café.  Among the building’s new features is the CME Market Training Lab that highlights and strengthens the college’s relationships with the Chicago financial exchanges, as well as high-tech student work areas for team projects. It provides students with the experience of a real-world financial services setting in a learning environment.  The project was awarded LEED Gold Certification through the United States Green Building Council’s (USGBC). The completion of this project positions UIC at the forefront of green architecture in Chicago and amongst peer institutions throughout the country. Sustainable features include geothermal power used for central heating and cooling, Photovoltaic power generation using solar panels, low VOC materials such as made from recycled tires and terrazzo flooring made from recycled glass and mirrors, FSC certified wood, and Recycled Rainwater.       Leadership      Sid\n    \n    Bhattacharyya  Professor, Director of Master of Science in Business Analytics (MSBA) Graduate Studies, and Department Head    Phone:   (312) 996-8794     Email:   sidb@uic.edu      View Profile       Andriy\n    \n    Bodnaruk  Professor and Interim Department Head    Phone:   (312) 355-4742     Email:   bodnaruk@uic.edu      View Profile       Benét\n    \n    DeBerry-Spence  Professor and Department Head    Phone:   (312) 996-4614     Email:   benet@uic.edu      View Profile       Michael\n    \n    Kirschenheiter  Professor and Department Head    Phone:   (312) 996-2284     Email:   mkirsche@uic.edu      View Profile       Robert\n    C.\n    Liden  Professor, Coordinator of OB/HR PhD Program, and Associate Dean of PhD Programs    Phone:   (312) 996-0529     Email:   bobliden@uic.edu      View Profile       Abagail\n    \n    McWilliams  Professor and Associate Dean of BBA Programs    Phone:   (312) 996-5201     Email:   abby@uic.edu      View Profile       Michael\n    \n    Mikhail  Professor and Dean    Phone:   (312) 996-2671     Email:   mmikhail@uic.edu      View Profile       Mark\n    \n    Shanley  Professor and Associate Dean for Academic Affairs    Phone:   (312) 996-6229     Email:   mshanley@uic.edu      View Profile       Sandy J.\n    \n    Wayne  Professor, Associate Dean for Faculty Affairs, Faculty Director for Business Scholars, and Co-Director of the Institute for Leadership Excellence and Development (iLEAD)    Phone:   (312) 413-1717     Email:   sjwayne@uic.edu      View Profile                           ",
    "outlinks": [
        "https://business.uic.edu/",
        "https://business.uic.edu/faculty-and-research/",
        "https://business.uic.edu/undergraduate-programs/pre-college-programs/",
        "https://business.uic.edu/graduate-programs/graduate-degrees/",
        "https://business.uic.edu/undergraduate-programs/ilead-professional-development-program/",
        "https://business.uic.edu/faculty-and-research/research-2/",
        "https://business.uic.edu/profiles/michael-kirschenheiter/",
        "https://library.uic.edu/",
        "https://business.uic.edu/faculty-and-research/for-the-media/",
        "https://business.uic.edu/undergraduate-programs/",
        "https://business.uic.edu/undergraduate-programs/student-life-uic-business/",
        "https://business.uic.edu/faculty-and-research/faculty/",
        "https://business.uic.edu/profiles/bhattacharyya-sid/",
        "https://business.uic.edu/profiles/robert-c-liden/",
        "https://uic.edu/",
        "https://business.uic.edu/news-2/",
        "https://business.uic.edu/profiles/benet-deberry-spence/",
        "https://business.uic.edu/profiles/mikhail-michael/",
        "https://business.uic.edu/cmba/",
        "https://business.uic.edu/profiles/sandy-j-wayne/",
        "https://business.uic.edu/undergraduate-programs/uic-business-scholars/",
        "https://business.uic.edu/contact-uic-business/",
        "https://business.uic.edu/profiles/andriy-bodnaruk/",
        "https://business.uic.edu/profiles/abagail-mcwilliams/",
        "https://business.uic.edu/doctoral-programs/degrees/",
        "https://business.uic.edu/faculty-and-research/ilead-institute-leadership-excellence-development/",
        "https://business.uic.edu/undergraduate-programs/business-career-center/",
        "https://uic.edu/about/job-opportunities",
        "https://business.uic.edu/doctoral-programs/uic-doctoral-students/",
        "https://business.uic.edu/faculty-and-research/uic-entrepreneurial-support-program/",
        "https://blog.business.uic.edu/",
        "https://today.uic.edu/events",
        "https://businessconnect.uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://today.uic.edu/",
        "https://business.uic.edu/graduate-programs/graduate-career-services/",
        "https://business.uic.edu/undergraduate-programs/undergraduate-admissions/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://business.uic.edu/profiles/mark-shanley/",
        "https://business.uic.edu/doctoral-programs/",
        "https://www.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://business.uic.edu/graduate-programs/",
        "https://business.uic.edu/events-2/",
        "https://maps.uic.edu/",
        "https://business.uic.edu/graduate-programs/guaranteed-and-preferred-admissions/",
        "https://business.uic.edu/faculty-and-research/international-center-futures-derivatives/",
        "https://www.uic.edu/admissions-aid/visit-campus",
        "https://accc.uic.edu/service/directory",
        "https://www.uic.edu/apps/departments-az/search",
        "https://business.uic.edu/graduate-programs/graduate-admissions/",
        "https://disabilityresources.uic.edu/",
        "https://emergency.uic.edu/",
        "https://business.uic.edu/faculty-and-research/faculty/faculty-recruitment/",
        "https://business.uic.edu/undergraduate-programs/undergraduate-degrees/"
    ]
}