{
    "origin_link": "https://accessweb.uic.edu/",
    "title": "Digital Accessibility Committee | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , the site search form , the site home page .           Digital Accessibility Committee     Search the site     Toggle Menu      Search                  Digital Accessibility Committee      Digital Accessibility Committee   Main Menu    Red Accessibility    Resources and Tools           Non-HTML Content    Online Resources    Tools    Captioning at UIC         Contact Us           About the Digital Accessibility Committee          Eyebrow menu    Office for Access and Equity    Disability Resource Center    UIC menu    UIC.edu    Campus Map       Search                              Digital Accessibility Committee       Digital Accessibility Committee  Promoting Accessible Digital Information at UIC                    What is Digital Accessibility?   Digital accessibility enables all people, including those with disabilities, to access electronic resources (including web pages, software, mobile devices, e-readers, etc.) and communications. The Digital Accessibility Committee advocates a holistic approach to examining and governing UIC’s web content, services, and technology, with the goal of achieving universal accessibility and usability of digital communications, appropriate use of resources, and compliance with web accessibility standards and regulations.  A goal of the Digital Accessibility Committee is to help the UIC campus continually improve its web accessibility, so that people with disabilities can access web content. Web accessibility also benefits others, including people with changing abilities due to aging. Web accessibility encompasses all disabilities that affect access to the web, including visual, auditory, physical, speech, cognitive, and neurological disabilities.         About this site   This site has been designed to help UIC webmasters create and maintain accessible websites in accordance with UIC’s official commitment to persons with disabilities, the Illinois Board of Higher Education (IBHE) , the Illinois Information Technology Accessibility Act (IITAA) , and other federal and state legislative acts applying to electronic resources.         Why websites must be accessiblie and how to join the committee            Why Websites Must Be Accessible            Join the Committee            UIC Digital Accessibility Committee   Mission  The University of Illinois at Chicago  Digital Accessibility Committee oversees the policy and procedures relating to accessibility of online information. This committee supports the campus in the process of advancing Web accessibility through:   coordinating training and assistance with Web accessibility  providing accessibility assessment tools  providing reports and recommendations on how campus webmasters can improve their sites to meet current best practices and established accessibility guidelines  developing policies to make online information more accessible and usable  assisting webmasters by providing clear campus guidelines on how to improve accessibility  helping the campus prioritize efforts in creating new websites and modifying older websites.   The Digital Accessibility Committee is dedicated to the long term effort of improving the accessibility of our campus websites, but will need the active cooperation and efforts of campus webmasters for accessibility to be implemented at UIC.         Resource and Site Checks   The Digital Accessibility Committee is available to support campus webmasters. For more information and help with checking a site for accessibility, contact the committee .         Digital Accessibility News and Events       DOE Rescinds “Mass Filer” Rule, Reopening Door for Web Accessibility Complaints    Posted on December 13, 2018        50 Colleges Hit With ADA Lawsuits    Posted on December 13, 2018        24 Accessibility:  24 days of digital accessibility gifts during the season of giving and sharing    Posted on November 30, 2018        Department of Justice Affirms ADA’s Coverage of Websites    Posted on October 29, 2018                              ",
    "outlinks": [
        "https://accessweb.uic.edu/news-stories/50-colleges-hit-with-ada-lawsuits/",
        "https://drc.uic.edu/",
        "https://accessweb.uic.edu/news-stories/department-of-justice-affirms-adas-coverage-of-websites/",
        "https://accessweb.uic.edu/contact-us/",
        "https://library.uic.edu/",
        "https://accessweb.uic.edu/news-stories/24-accessibility-24-days-of-digital-accessibility-gifts-during-the-season-of-giving-and-sharing/",
        "https://accessweb.uic.edu/resources-and-tools/non-html-content/",
        "https://uic.edu/",
        "https://accessweb.uic.edu/accessibility-techniques-for-uic-red-pages/",
        "https://accessweb.uic.edu/resources-and-tools/online-resources/",
        "https://accessweb.uic.edu/resources-and-tools/tools/",
        "https://accessweb.uic.edu/resources-and-tools/non-html-content/captioning-at-uic/",
        "https://uic.edu/about/job-opportunities",
        "https://today.uic.edu/events",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://uihealth.uic.edu/",
        "https://oae.uic.edu/",
        "https://accessweb.uic.edu/why-websites-must-be-accessible/",
        "https://maps.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://accessweb.uic.edu/resources-and-tools/",
        "https://emergency.uic.edu/",
        "https://disabilityresources.uic.edu/",
        "https://today.uic.edu/"
    ]
}