{
    "origin_link": "https://uic.edu/academics",
    "title": "Academics",
    "contents": "        Map  Directory  Contact Us  Library  Athletics  International  Current Students  Faculty and Staff  UI Health  + Give                  University of Illinois at Chicago       Expand menu   Menu   Admissions & Aid   Visit Campus  Paying for College     Academics   Programs of Study  Colleges & Schools  Student Support     Research   Research Impact  Research Strengths  Resources & Facilities  Student Research     Life at UIC   Living On & Around Campus  Campus Resources     Chicago   Exploring Chicago  City Transportation  Essential Chicago     Alumni    About   Visit & Directions  History  Leadership  Public & Media Resources  Job Opportunities  Contact Us  Acerca de la UIC (en español)            The University of Illinois at Chicago   Academics                Academics      Programs of Study    Colleges & Schools    Student Support             At UIC, there’s a lot to learn        University of Illinois at Chicago features 16 academic colleges, 86 bachelor’s, 111 master’s and 66 doctoral degree programs. That means plenty of opportunities to explore your interests.        Undergraduate degrees and minors  Find the one that's right for you      Graduate and professional degrees  Study in innovative, nationally ranked programs      Graduate College  Supporting the research, scholarship and success of graduate and professional students           Our faculty        At UIC, you’ll learn from award-winning professors: American Association for the Advancement of Science fellows, Fulbright scholars and National Science Foundation Career Award winners.  With nearly 2,821 faculty members and a low 1-to-19 faculty-student ratio, UIC undergraduates have exceptional access to the scientists, artists, writers, clinicians, educators and innovators whose work shapes our world.      Undergraduate faculty     Graduate faculty              Arts and humanities        UIC courses in the arts and humanities help students develop critical-thinking skills and a comprehensive world view.  The College of Architecture, Design, and the Arts is a diverse community of artists, architects, designers and performers. Humanities studies in the College of Liberal Arts and Sciences —  including the School of Literatures, Cultural Studies and Linguistics — reflect the global identities of UIC and Chicago.      College of Architecture, Design, and the Arts     College of Education     College of Liberal Arts and Sciences                    Be innovative   The UIC Innovation Center is a place for collaboration, education and incubation that brings together industry, educators and students to find solutions to real-world problems. Students in the MAD Lab (Medical Accelerator for Devices) created a diagnostic tool for women’s health exams.    More about the Innovation Center            Basic and social sciences        Whether you want to view the world through an electron microscope or the perspective of an entire culture, UIC offers a broad range of programs in the basic and social sciences. UIC researchers study important issues like energy production and conservation, the survival of wildlife in the city, the cultures of lost Amazonian civilizations and the behaviors that surround binge-drinking. Their work translates into classroom learning and student research opportunities.      College of Liberal Arts and Sciences              Business        UIC produces leaders for the global economy of the future. The College of Business Administration reinforces the core disciplines — accounting, finance, information and decision sciences, marketing and management — with solid, real-world experience.  For students whose career goals expand beyond one area of study, UIC offers joint degree options that combine business with medicine, public health, pharmacy, economics, nursing and management information systems.      College of Business Administration     Joint degree programs                    See the futures   Today’s financial trading relies on high-speed software and instant access to real-time information from enormous volumes of data. In its market training lab, UIC’s International Center for Futures and Derivatives teaches students in an environment that simulates the trading room at a big investment firm.    International Center for Futures and Derivatives            Computing and engineering        UIC is a place where ideas become reality. Researchers are designing more efficient batteries and more powerful computer chips, finding better ways to manage storm water surge and making microelectronics for space exploration. If you’re interested in computer science — gaming, manipulation of big data, computers that understand natural language or visualization, securing healthcare data, the intersection of art and science — you’ll find it at UIC.      College of Engineering     College of Liberal Arts and Sciences     The Richard and Loan Hill Department of Bioengineering     MAD Lab     Biomedical and Health Information Sciences              Health sciences        UIC’s health sciences colleges emphasize clinical skills, research and community focus. You can prepare for a wide range of health careers in one of the applied health sciences, dentistry, medicine, nursing, pharmacy, public health or social work. Ten pre-health programs in the College of Liberal Arts and Sciences prepare students for future study in UIC health sciences programs and veterinary medicine.  For students whose goals expand beyond one area of study, UIC offers joint degrees that combine health care studies with other disciplines. The Medical Scientist Training Program is an MD/Ph.D. program for physician-scientists. Bioengineering, a department in both the colleges of Medicine and Engineering, trains students for careers in the growing biomedical field.      College of Applied Health Sciences     College of Dentistry     College of Medicine     College of Nursing     College of Pharmacy     School of Public Health     Jane Addams College of Social Work                    Health care simulation   UIC has more than seven dedicated simulation centers that use specially trained actors, advanced and computerized manikins of all ages, and simulated environments to help students and health care professionals practice clinical skills, communication and decision-making skills, and get hands-on training in medical diagnosis, treatment and care. Together, these centers facilitate more than 50,000 hours of hands-on learning in the health sciences.    More about UIC's new simulation centers            Law        UIC is the home to Chicago’s only public law school. Through its varied juris doctor and graduate degree programs, UIC John Marshall Law School provides an education that combines the understanding of both the theory and the practice of law. Students seeking degrees from the School have the option to study many substantive areas of the law – from tax law and estate planning to sustainability and international human rights – and benefit from its many educational centers and nine community-based, pro bono legal clinics.      UIC John Marshall Law School              Social justice        UIC offers more than 200 courses focused on issues of equality, fairness and inclusion. A minor in social justice in Gender and Women’s Studies explores ethical, social, historical and political questions facing Chicago and the world. Students and faculty are involved in social justice work, from public policy to arts projects, human rights to urban health disparities.        Social justice courses and programs of study     Gender and Women's Studies Program     Department of Disability and Human Development                    Social Justice Initiative   The UIC Social Justice Initiative links scholars and activists in Chicago and beyond through programs related to social justice, democracy and human rights. The campus-wide project builds critical thinking and research skills that make students effective change agents and socially conscious professionals.    More about the Social Justice Initiative            Urban planning        UIC educates city planners and administrators to evaluate needs, find solutions — then make them happen.  The College of Urban Planning and Public Affairs offers undergraduate and degrees, including Chicago’s only accredited graduate program in urban planning.  Eight research centers specialize in neighborhood development, economics, transportation, race and public policy, criminal justice and other issues.      College of Urban Planning and Public Affairs                    Gentrification or not?   A gentrification index developed by UIC researchers measures neighborhood change in Chicago’s 77 community areas. It quantifies each area’s residents by ethnicity, age, education, income, occupation, home ownership and home values. Researchers found more neighborhoods declining than gentrifying, despite concerns that long-time residents are being priced out of some areas.    More about the Gentrification Index            More academic links           Honors College  An environment for advanced intellectual growth, a foundation for life-long learning      Global Learning Community  Certificate program for incoming freshmen promotes global thinking      Study Abroad  Programs on six continents      Undergraduate Research Experience  Opportunities for undergraduates to participate in research      Summer Research Opportunities Program  Undergraduates work one-on-one with a faculty mentor               1200 West Harrison St.  Chicago, Illinois 60607  (312) 996-7000     Tools    Blackboard    G Suite    my UIC    My UI Info: Pay    UIC Outlook Online    UIC Safe (Mobile App)    Contact the webmaster      Resources    Academic Calendar    Current Students    Event Calendar    Faculty and Staff    Patients    UIC Today    Visit & Directions    Clery Compliance    Nondiscrimination Policy    Title IX: Sexual Misconduct    Student Information Disclosures      Quick Links    Athletics    Directory    Disability Resources    Emergency Information    International    Job Opportunities    Library    Maps    Veterans Affairs    UI Health    Acerca de la UIC (en español)          Book a Visit    Request Info    Apply Now    Give    Join Alumni Association    Contact Us                                       Cookie Settings          © 2020 The Board of Trustees of the University of Illinois |  Privacy Statement    University of Illinois System  |  Urbana-Champaign  |  Springfield     UIC on Google+  ",
    "outlinks": [
        "https://uic.edu/chicago/city-transportation",
        "https://tigger.uic.edu/htbin/codewrap/bin/orgs/ura/cgi-bin/",
        "https://education.uic.edu/",
        "https://uic.edu/research/resources-facilities",
        "https://www.nursing.uic.edu/",
        "https://uic.edu/academics/student-support",
        "https://sji.uic.edu/our-work/programs/",
        "https://uic.edu/chicago",
        "https://catalog.uic.edu/ucat/the-university/faculty/",
        "https://admissions.uic.edu/visit-us",
        "https://jmls.uic.edu/",
        "https://uic.edu/about/job-opportunities",
        "https://madlab.uic.edu/",
        "https://oae.uic.edu/UnlawfulDiscrimination/index.htm",
        "https://lcsl.uic.edu/",
        "https://uic.edu/academics/colleges-schools",
        "https://business.uic.edu/home-uic-business/faculty-departments-research/international-center-for-futures-and-derivatives",
        "https://ahs.uic.edu/",
        "https://uic.edu/chicago/essential-chicago",
        "https://today.uic.edu/uic-opens-three-new-health-care-simulation-centers",
        "https://www.las.uic.edu/",
        "https://uic.edu/life-at-uic/campus-resources",
        "https://www.uic.edu/depts/oaa/global_learning/",
        "https://give.uic.edu/",
        "https://cada.uic.edu/",
        "https://uic.edu/research/research-impact",
        "https://dentistry.uic.edu/",
        "https://uic.edu/about/leadership",
        "https://engineering.uic.edu/",
        "https://www.medicine.uic.edu/",
        "https://catalog.uic.edu/gcat/degree-programs/",
        "https://uic.edu/about",
        "https://grad.uic.edu/summer-research-opportunities-program-undergraduates",
        "https://my.uic.edu/",
        "https://grad.uic.edu/",
        "https://uic.edu/research",
        "https://advance.uic.edu/alumni-association/",
        "https://uihealth.uic.edu/",
        "https://uic.edu/research/research-strengths",
        "https://admissions.uic.edu/undergraduate/request-information",
        "https://uic.edu/life-at-uic/living-on-around-campus",
        "https://publichealth.uic.edu/",
        "https://ahs.uic.edu/dhd/",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/",
        "https://catalog.uic.edu/gcat/degree-programs/grad-prof-degree-programs/",
        "https://business.uic.edu/",
        "https://events.uic.edu/",
        "https://today.uic.edu/resources/faculty-staff",
        "https://www.uic.edu/honors/",
        "https://catalog.uic.edu/ucat/degree-programs/degree-minors/",
        "https://uic.edu/about/history",
        "https://www.uic.edu/pharmacy/",
        "https://clery.uic.edu/",
        "https://news.uic.edu/social-media-directory",
        "https://uic.edu/academics/programs-of-study",
        "https://www.bioe.uic.edu/",
        "https://accc.uic.edu/service/g-suite",
        "https://innov-vm-1.cc.uic.edu/wordpress/",
        "https://today.uic.edu/resources/current-students",
        "https://uic.edu/about/public-media-resources",
        "https://uic.edu/admissions-aid/visit-campus",
        "https://www.uic.edu/depts/oaa/sji/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://oae.uic.edu/sexual-misconduct/",
        "https://ahs.uic.edu/bhis/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://uic.edu/about/contact-us",
        "https://uic.edu/admissions-aid",
        "https://admissions.uic.edu/apply-now",
        "https://uic.edu/life-at-uic",
        "https://uic.edu/research/student-research",
        "https://uic.edu/chicago/exploring-chicago",
        "https://library.uic.edu/",
        "https://www.uic.edu/jaddams/college/",
        "https://uic.edu/admissions-aid/paying-for-college",
        "https://uic.edu/",
        "https://voorheescenter.uic.edu/what-we-do/areas-of-research/gentrification-index/",
        "https://uic.edu/alumni",
        "https://outlook.uic.edu/",
        "https://oge.uic.edu/",
        "https://studyabroad.uic.edu/",
        "https://gws.uic.edu/",
        "https://www.uic.edu/cuppa/",
        "https://uic.edu/about/acerca",
        "https://catalog.uic.edu/gcat/faculty/",
        "https://uic.edu/about/visit-directions",
        "https://maps.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://disabilityresources.uic.edu/",
        "https://www.uic.edu/depts/dos/studentveteranaffairs.shtml"
    ]
}