{
    "origin_link": "https://hpsc.org.uic.edu/",
    "title": "Health Professions Student Council",
    "contents": "                           Home 2019-2020 Executive Board 2019-2020 Representatives Requirements Grants & Funding Project Grants Part I - Deadlines and Application Details Part II - Project Grant Application Part III - After Application is Submitted Project Grant FAQs Travel Grants Application Details Travel Grant FAQ's General Body Meetings HPSC Collaborative Healthcare Series Past CHS Events Calendar Documents & Links Campus Issues Suggestion Box          Home     What is HPSC? We are happy to explain... The UIC Health Professions Student Council (HPSC) is a liaison organization between the individual health professions students, student groups, and the university at large. We appoint students to university and campus-wide committees to represent the interest of the health professional student body. Additionally, we fund the individual health professional student councils and provide additional funding to students for travel and interdisciplinary projects. Our student-run organization has also provided a forum for interdisciplinary discourse through our Collaborative Healthcare Series. The following schools/organizations have representatives for HPSC: College of Medicine, College of Nursing, Graduate Nursing Student Organization, College of Applied Health Sciences, College of Dentistry, College of Pharmacy, University Medical Student Council, College of Social Work, and the School of Public Health Contact Us: uic.hpsc@gmail.com Grant/Funding Contact: hpscgrants@gmail.com HPSC General Meetings College of Pharmacy (833 S Wood) in Rm 270 from 6-8pm October 31st November 21st January 30th February 27th April 16th Last GBM of the academic year, will be held virtually Announcements      Subscribe to posts    October 31st GBM   posted Oct 30, 2019, 10:51 AM by UIC-HPSC Eboard [\n  \n  \n  \n  \n  updated Oct 31, 2019, 1:37 PM ]    The October General Body Meeting of HPSC will be Thursday October 31st from 6-8pm at the College of Pharmacy (833 S Wood) Room 270        Stop the Bleed!  posted Oct 16, 2019, 4:03 PM by UIC-HPSC Eboard   HPSC is excited to support Stop the Bleed! Find more information at their website https://www.bleedingcontrol.org/ Contact Patrick O'Carroll to set up a training session which can include emergency kits and naloxone pocarr2@uic.edu . All UIC Health Professions Colleges are welcome to host a training session for students and community members.        September General Body Meeting 9/26  posted Sep 24, 2019, 6:25 AM by UIC-HPSC Eboard   HPSC will host its General Body Meeting on the last Thursday of each month. This month the meeting will take place on Thursday 9/26 at the College of Pharmacy. Please reach out to Secretary Nicole Blumenstein for more information. Happy Fall!        School of Public Health - World Health Day  posted Apr 1, 2015, 5:49 PM by UIC-HPSC Eboard   WORLD HEALTH DAY Program Launch of \" Living global health \" Luncheon and Discussion **Lunch Provided** Tuesday, April 7, 2015 11:30- 12:45pm School of Public Health I Room 932  \"Living  global  health”  is  an  accessible  social  conversation  about  the  realities  of  our  health,globally,  through  our  own  personal  stories  and  reflections.  We  are  providing  a  platform  to  share  ourstories.  We  will  be  prompting  the  world  to  respond  to  a  series  of  questions,  Real  Voices  that  aredirected  at  a  global  audience,  as  individuals.  Through  this  initiative  we  will  gather  real  voices  fromindividuals  everywhere  in  order  to  raise  awareness  and  begin  a  truly  global  conversation through social  media  about  health  equity. PLEASE RSVP BY ENTERING YOUR NAME ON THE DOODLE POLL: http://doodle.com/bdvdsdcfpfg2px3c ”   | Attachments:   World Health Day.png       Collaborative Healthcare Series Event #4: INTERNATIONAL NIGHT  posted Feb 27, 2015, 12:50 PM by UIC-HPSC Eboard   HPSC's LAST COLLABORATIVE HEALTHCARE SERIES EVENT of the year: UIC School of Public Health presents INTERNATIONAL NIGHT For those of you who enjoyed “Taboo,” the intergroup dialogues event sponsored by SNMA, HPSC and several other student organizations from the College of Medicne, HPSC would like to invite you to our last Collaborative Healthcare Series event on WEDNESDAY, MARCH 4th at 6pm at the School of Public Health. UIC SPH will be holding an event focused on Global Health with amazing speakers, performances, photo contests, Henna painting, and even a DJ and open dance floor at night. Please come out for an exciting, informative, and fun evening with FREE FOOD!!! (see flyer for additional details) *If you have been keeping tract of your Leadership events and activities Please bring their HPSC Collaborative Healthcare Series Passport and get credit for attending. ********* WHAT? International Night WHEN? Wednesday, March 4th from 6-9:30pm WHERE? School of Public Health (corner of Ashland and Taylor) *********   | Attachments:   CHS 4 - International Night.png       UNC Minority Health Conference Webcast  posted Feb 9, 2015, 2:19 PM by UIC-HPSC Eboard   What: Webcast of UNC Minority Health Conference, Lecture and Discussion When: Friday, February 27th, 12:30 - 3pm Where: School of Public Health Auditorium (1603 W. Taylor) *Light Refreshments will be served This event will be a live-stream of the annual keynote speaker of the University of North Carolina-Chapel Hill's Minority Health Conference. Their keynote speaker, Dr. Allison E. Aiello, is an internationally recognized expert on social determinants of health, with a focus on infectious diseases. Her research investigates the impact of individual- and neighborhood-level socioeconomic and psychosocial determinants across the life course within minority populations. Her speak will focus on the theme of the conference \"Economic Mobility and Minority Health\". This event will be a great opportunity to showcase some of the scholarship happening at other institutions on health inequities. Health Professional across all disciplines will benefit learning about how economic mobility can influence health outcomes in marginalized communities. If you have any questions, please contact Cindy San Miguel at: csanmig2@uic.edu   | Attachments:   UNC Webcast flyer - FINAL (1).png       TABOO  posted Feb 8, 2015, 9:04 PM by UIC-HPSC Eboard [\n  \n  \n  \n  \n  updated Feb 9, 2015, 2:16 PM ]    HPSC is is sponsoring its 3rd CHS EVENT THIS WEDNESDAY FEBRUARY 11th at 5 pm at the College of Medicine. The purpose of this event is to promote a raw dialogue about our vast differences in race, culture, religion and sexuality as a healthcare providers and as we prepare to interact with patients in the future. When? Wednesday, February 11, 2014 at 5:00 Where? CMWT Room 429  (4th Floor TBL Room) What? FREE DINNER and an AWESOME EVENT!!!!! Please RSVP at the following link (we need an approximate count for food): https://docs.google.com/spreadsheets/d/1F6aTumlx8F9r6tjiRAX8nv5dBnViGi3YwJZHuwe4l3k/edit?usp=sharing  If you have been keeping tract of your Leadership events and activities Please bring their HPSC Collaborative Healthcare Series Passport and get credit for attending. We look forward to seeing and talking (candidly!) with you. UIC HPSC Executive Board   | Attachments:   HPSC Collaporative Healthcare Series 3.png       IPE Immersion Day  posted Jan 20, 2015, 1:48 PM by UIC-HPSC Eboard   The concepts of interprofessional education (IPE) and collaborative practice (CP) are part of a growing imperative to embrace the changing models of health care delivery. You are invited to participate in an “immersion day” on Friday, April 10, 2015 , when students from across the health sciences and other UIC colleges will convene in the UIC Forum for a half-day of interactive learning as part of a blended course. Readings and preparatory work are assigned in Blackboard prior to that day. The April 10 workshop itself is a face-to-face experience; students are expected to participate in person. Please note that if you are scheduled for your practicum during this time the practicum will take priority . Also, this is the date of the Illinois HIM Association Annual meeting in Springfield, Illinois if you are planning to attend that See attachment for more details on the IPE Immersion Day at UIC. Enrollment closes at 4:00 p.m. January 30, 2015 . Registration is on a first come, first-served basis and requires program approval. Students may choose to participate in this course as either a \"resume-enhancing experience\" (accrues no course credit) or by enrolling in a one-credit hour independent study, which may result in an additional charge for tuition. A written and submitted self-reflection summarizing the interprofessional education experience will be required for the credit-bearing independent study. If you are interested in learning together to improve your future collaborative skills in order to build a safer and better patient-centered U.S. health care system, please contact: · HIM undergraduates and Post-Baccalaureate HIM students: Karen Patena, RHIA, patena@uic.edu · Health Informatics students: Annette Valenta, DrPH, valenta@uic.edu   | Attachments:   IPE Immersion Day flyer HIHIM_2015.pdf       College of Nursing Simulation Lab Event  posted Jan 6, 2015, 9:55 AM by Jonathan Czyscon [\n  \n  \n  \n  \n  updated Jan 10, 2015, 8:32 AM by UIC-HPSC Eboard\n]    The UIC College of Nursing has once again agreed to open the doors to their patient simulation lab to allow students from each college to learn basic medical and emergency techniques. The event is a unique opportunity to meet students from other colleges and work together to learn and utilize new skills. If you are interested in participating, please RSVP using the link below. If planning to register, please understand that space is EXTREMELY limited due to the capacity of the CON Simulation Lab. With your RSVP, you are expected to attend the event. Please do not RSVP unless you are entirely sure that you can attend and stay the full amount of time. Please note that this qualifies as one of the two HPSC-organized events required for the HPSC Collaborative Healthcare Series Award. Event Details: January 28, 5-8 PM College of Nursing (South of UIC Sports & Fitness Center) Dinner provided, Free giveaways, and Raffle RSVP Here:  https://docs.google.com/forms/d/1OOpMjAwJjh3ynu5l_00KtEBxpNDLDpiGEUkKTEq8aus/viewform?usp=send_form        World Aids Day - December 1st  posted Nov 26, 2014, 10:28 AM by UIC-HPSC Eboard   Please join us for another great Collaborative Healthcare Series Event on December 1st - World Aids Day. Dinner will be provided, please RSVP. More information can be seen in the attached announcement.   | Attachments:   World Aids Day Flier (1).pdf        1-10 of 20                        Sign in | Recent Site Activity | Report Abuse | Print Page | Powered By  Google Sites                        ",
    "outlinks": [
        "https://hpsc.org.uic.edu/home/calendar",
        "https://hpsc.org.uic.edu/home/executive-board",
        "https://hpsc.org.uic.edu/system/app/pages/recentChanges",
        "https://hpsc.org.uic.edu/home/grants-funding/travel-grants-1/part-ii---project-grant-application",
        "https://hpsc.org.uic.edu/home/grants-funding/travel-grants/travel-grant-faq-s",
        "https://hpsc.org.uic.edu/home/grants-funding/travel-grants-1/part-i---deadlines-and-application-details",
        "https://hpsc.org.uic.edu/home/grants-funding/travel-grants-1/project-grant-faqs",
        "https://hpsc.org.uic.edu/home/general-body-meetings",
        "https://hpsc.org.uic.edu/home/septembergeneralbodymeeting926",
        "https://hpsc.org.uic.edu/home/collaborativehealthcareseriesevent4internationalnight",
        "https://hpsc.org.uic.edu/home/grants-funding",
        "https://hpsc.org.uic.edu/home/schoolofpublichealth-worldhealthday",
        "https://hpsc.org.uic.edu/home/taboo",
        "https://hpsc.org.uic.edu/home/collegeofnursingsimulationlabevent",
        "https://hpsc.org.uic.edu/home/hpsc-collaborative-healthcare-series/past-events",
        "https://hpsc.org.uic.edu/home/uncminorityhealthconferencewebcast",
        "https://hpsc.org.uic.edu/home/campus-issues",
        "https://hpsc.org.uic.edu/home/representative-info/requirements",
        "https://hpsc.org.uic.edu/home/grants-funding/travel-grants-1",
        "https://hpsc.org.uic.edu/home/worldaidsday-december1st",
        "https://hpsc.org.uic.edu/home/representative-info",
        "https://hpsc.org.uic.edu/home/grants-funding/travel-grants/part-i---deadlines-and-application-details",
        "https://hpsc.org.uic.edu/home/hpsc-collaborative-healthcare-series",
        "https://hpsc.org.uic.edu/home/ipeimmersionday",
        "https://hpsc.org.uic.edu/home/stopthebleed",
        "https://hpsc.org.uic.edu/home/posts.xml",
        "https://hpsc.org.uic.edu/home/grants-funding/travel-grants",
        "https://hpsc.org.uic.edu/home/links",
        "https://hpsc.org.uic.edu/home/october31stgbm",
        "https://hpsc.org.uic.edu/home/suggestion-box",
        "https://hpsc.org.uic.edu/home/grants-funding/travel-grants-1/part-iii---after-application-is-submitted"
    ]
}