{
    "origin_link": "https://cada.uic.edu/support/covid-19-response/",
    "title": "COVID-19 Response - University of Illinois at Chicago College of Architecture, Design, and the Arts",
    "contents": "   Skip to content      Menu        UIC.EDU  CAMPUS MAP  Search       ×        Schools    Architecture    Art & Art History    Design    Theatre & Music      Admissions    Why CADA?    Book a Visit    How to Apply    Admitted Students      News and Events    News    Events    Newsletter        About the College    COVID-19    Mission    Dean’s Message    History    Job Opportunities      Academics    Degree Requirements    Advising    Student Support    Financial Aid    CADA Commencement      Creative Spaces    Gallery 400    Jane Addams Hull-House Museum    Innovation Center        People    About the Dean    Administration    Faculty and Staff      Support    COVID-19 Response    Ways to Give    Funding Priorities    Meet              instagram        facebook-f        twitter      Privacy Policy    Contact    UIC.edu   Campus Map       Support      COVID-19 Response          “No country, however rich, can afford the waste of its human resources. Demoralization caused by vast unemployment is our greatest extravagance. Morally, it is the greatest menace to our social order.” – Franklin Delano Roosevelt, 1934     SUPPORT UIC’S RESPONSE TO COVID-19 UIC College of Architecture, Design, and the Arts and Chicago Shakespeare Theater are partnering to support the urgent medical and economic needs posed by the COVID-19 pandemic. Our partnership seeks to directly support the medical needs of the city while providing critical employment for skilled artists.  Chicago Shakespeare Theater will manage and facilitate the creation of source control masks approved by UI Health. Skilled theater artisans throughout the Chicago area will be compensated for this work, addressing the professional displacement of Chicago’s theater community by this crisis.  The CDC has recommended that all patients entering medical facilities wear source control masks. The associated increase in demand has the potential to outpace the supply of commercial masks. UI Health has now approved a prototype of a 100% cotton, double layer source control mask for patients.  MASKS FOR FACES AND FOR NOSES* Based on a prototype approved by UI Health (modified from a pattern published by Deaconess Health System), Chicago Shakespeare Theater has assembled kits for professional fabricators to sew masks. CST is joined by other nonprofit theaters and university costume shops in managing and facilitating this work. The UIC and Chicago Shakespeare Theater partnership in this effort has been approved as an Essential Service to the medical community by the City of Chicago — CST is authorized to continue these management and fabrication efforts through the State of Illinois Stay At Home Order.        THE WORK BEGINS IMMEDIATELY.        To become involved, please email Chicago Shakespeare Theater at this link.         To make a financial gift, donate here — please note that your contribution is for “Masks for faces and for noses.”         BUSINESS MODEL  Goal: Fabricate 250,000 masks for distribution at hospitals and convalescence wards throughout the Chicagoland area.  DISTRIBUTION TARGETS  Advocate Hospital System Edward-Elmhurst Hospital System Jesse Brown VA (Veterans Affairs) Medical Center Mercy Hospital Rush Stroger Hospital of Cook County UI Health University of Chicago  FINANCIAL MODEL  UIC support: UIC leadership has provided $20,000 seed money to support the startup of the project, and to pay for the first 5,000 masks for UI Health.       EXPENSE  Per pc / Per 250 / Per 25,000      Locally Sourced Materials  $0.50 / $125 / $12,500      Kit Development and Coordination  $0.10 / $25 / $2,500      Labor (roughly $15/hr.)  $2.40 / $600 / $60,000      TOTAL  $3.00 / $750 / $75,000       ASSUMPTIONS Chicago Shakespeare Theater will manage and facilitate the creation of patient source control masks approved by UI Health.  Cost: Fabrication and assembly cost of $3/mask (as a base-line target, NY Governor Cuomo called for production models of $4/mask).  Materials: Materials used will be locally sourced and fabricated with 100% cotton tight-weave quilting fabrics or tight-weave cotton muslin.  Design: Masks will be fabricated with either elastic ear loops or ties (in case of inability to source elastic).  In-home assembly: An assembly team at Chicago Shakespeare will create kits of materials for 50 masks and deliver to artisans across Chicago.  On-site assembly: An assembly team at Chicago Shakespeare will lead an on-site team of 100 artisans at Navy Pier to fabricate masks to optimize mass production.  Production capability: Initial prototype production suggests that each fabricator can fabricate 250 masks per 40-hour workweek.  Delivery to institutions: Completed masks will be packaged at Chicago Shakespeare Theater and deployed to hospitals in need by CST team members on a rolling basis. Once delivered, they will be stored for a waiting period of 72 hours post-delivery to ensure that they contain no virus.    *From The Winter’s Tale by  William Shakespeare, originally published in 1623          Ways to Give  Funding Priorities  Impact  Meet       BACK TO TOP   Resource Center            instagram        facebook-f        twitter      Privacy Policy    Contact    UIC.edu   Campus Map            ",
    "outlinks": [
        "https://cada.uic.edu/news-events/news/",
        "https://cada.uic.edu/about/mission/",
        "https://cada.uic.edu/academics/financial-aid/",
        "https://cada.uic.edu/support/funding-priorities/",
        "https://gallery400.uic.edu/",
        "https://cada.uic.edu/about/deans-message/",
        "https://cada.uic.edu/admissions/book-a-visit/",
        "https://arch.uic.edu/",
        "https://cada.uic.edu/news-events/events/",
        "https://cada.uic.edu/academics/advising/",
        "https://theatreandmusic.uic.edu/",
        "https://cada.uic.edu/academics/student-report/",
        "https://innovationcenter.uic.edu/",
        "https://cada.uic.edu/admissions/admitted-students-week/",
        "https://cada.uic.edu/support/impact/",
        "https://cada.uic.edu/contact/",
        "https://maps.uic.edu/",
        "https://cada.uic.edu/support/ways-to-give/",
        "https://cada.uic.edu/job-opportunities/",
        "https://cada.uic.edu/academics/degrees-and-requirements/",
        "https://artandarthistory.uic.edu/",
        "https://cada.uic.edu/admissions/how-to-apply/",
        "https://uic.edu/",
        "https://cada.uic.edu/support/meet/",
        "https://design.uic.edu/",
        "https://cada.uic.edu/",
        "https://cada.uic.edu/about/covid-19-updates/",
        "https://cada.uic.edu/admissions/why-cada/",
        "https://cada.uic.edu/about/history/",
        "https://cada.uic.edu/people/administration/",
        "https://cada.uic.edu/people/about-dean-rugg/",
        "https://cada.uic.edu/news-events/newsletter/",
        "https://cada.uic.edu/resource-center/",
        "https://cada.uic.edu/people/faculty-staff/"
    ]
}