{
    "origin_link": "https://oge.uic.edu/uic-global-partnership/",
    "title": "UIC Global Partnership | Office of Global Engagement | University of Illinois at Chicago",
    "contents": "               Skip to the content of this page ,  the main menu , Google Translate , the site search form , the site home page .           Office of Global Engagement     Search the site     Toggle Menu      Search                  Office of Global Engagement      Office of Global Engagement   Google Translate        Main Menu    OIA           Office of International Affairs         OIS           Office of International Services         PIP           Programs for International Partnerships         SAO           Study Abroad Office         TIE           Tutorium in Intensive English         UIC Global     Eyebrow menu    International Admissions    International Centers and Programs    UIC menu    UIC.edu    Campus Map       Search                      UIC Global Partnership               Idk        Partnership   The University of Illinois at Chicago launched UIC Global, its partnership with Shorelight Education, in January 2017. Chancellor Michael Amiridis and Provost Susan Poser envisioned UIC Global as a key part of the University’s strategy to increase undergraduate international student enrollment at UIC.  In addition to other benefits, increasing the international student population provides an opportunity to create a more globally engaged campus, bringing together students from diverse international and U.S. backgrounds in our classrooms, residence halls, dining facilities, and other venues.         Program   Undergraduate UIC Global students are admitted to one of four program options based on the student’s English proficiency and academic record: ● English as a Second Language (ESL) or Pre-Sessional English (PSE): English language study at OGE’s Tutorium in Intensive English. ● Extended Academic Accelerator: a three-semester pathway that mixes English language instruction and general education. ● Academic Accelerator: a two-semester pathway that mixes English language instruction and general education. ● International Direct: two semesters of academic coursework within the student’s chosen major.           After completing the UIC Global Program, students who meet UIC’s criteria are integrated into their UIC academic program with the general student population.   After completing the UIC Global Program, students who meet UIC’s progression criteria are integrated into their UIC academic program with the general student population.    In addition, UIC partnered with UIC Global and Shorelight Education to launch the UIC Global Graduate Direct Program in 2019.  Through this program, UIC Global recruits and screens high-quality applicants to more than 30 UIC masters programs. The relevant academic program or department reviews and selects the best students from the applicant pool.  This approach engages UIC colleges to recruit a strong and diverse set of students from around the U.S. and the globe.  For both the undergraduate and graduate programs, UIC Global and Shorelight Education use several regional overseas centers and a web of international recruiters embedded in countries around the world to attract and support international students and their parents who face the daunting challenge of selecting a university abroad.  UIC Global also works in close partnership with key UIC offices such as Admissions, the Office of International Services, and colleges to bring high performing students to UIC.  The result to date is more than 1,200 undergraduate and graduate students who are in the UIC Global program or have progressed in their academic programs.      Important Links        UIC Global          UIC Global Staff Directory          FAQs and Reports          UIC Global Steering Committee and Subcommittees          Document Library          UIC Global Graduate Director FAQ                         ",
    "outlinks": [
        "https://aacc.uic.edu/",
        "https://uic.edu/about/job-opportunities",
        "https://aarcc.uic.edu/",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://arabamcc.uic.edu/",
        "https://global.uic.edu/",
        "https://pip.uic.edu/",
        "https://library.uic.edu/",
        "https://chicago.medicine.uic.edu/departments___programs/departments/obgyn/global_women_s_health/global_women_s_health_fellowship/",
        "https://ask.uic.edu/",
        "https://oge.uic.edu/neal-r-mccrillis-vice-provost-international-affairs-2/international-centers-institutes-programs/",
        "https://studyabroad.uic.edu/",
        "https://ready.uic.edu/digital-materials/uic-safe-mobile-app/",
        "https://global.uic.edu/about-uic/meet-the-team/",
        "https://disabilityresources.uic.edu/",
        "https://maps.uic.edu/",
        "https://www.medicine.uic.edu/international_education",
        "https://latinocultural.uic.edu/",
        "https://dos.uic.edu/student-veterans-affairs/",
        "https://oge.uic.edu/",
        "https://uic.edu/",
        "https://lclc.uic.edu/",
        "https://oia.uic.edu/",
        "https://uihealth.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://admissions.uic.edu/undergraduate/requirements-deadlines/international-requirements",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/events",
        "https://globalhealth.uic.edu/",
        "https://www.ois.uic.edu/",
        "https://today.uic.edu/",
        "https://grad.uic.edu/faculty-staff-resources/uic-global-graduate-direct-faq/",
        "https://tie.uic.edu/"
    ]
}