{
    "origin_link": "https://today.uic.edu/8m-to-uic-to-lead-doe-materials-research-center",
    "title": "$8M to UIC to lead DOE materials research center | UIC Today",
    "contents": "       Skip to main content      Updated: May 08, 2020 at 12:39 PM         Today      Submit       Campus News  Academics & Research  Events  Resources   Current Student Resources  Faculty & Staff Resources  Photography/Video  Social Media Account Request Form  UIC Social Media Guidelines and Best Practices    COVID-19   Frequently Asked Questions  What you need to know about COVID-19  Support for the UIC community (COVID-19)  Teaching, learning and working resources  In the News: COVID-19    Contact   Communicating On Campus  Sending Announcements / DDDH  UIC Social Media Directory                                $8M to UIC to lead DOE materials research center  April 27, 2020    The Department of Energy’s National Nuclear Security Administration, or NNSA, has awarded $8 million over four years to the University of Illinois at Chicago to lead a multisite, interdisciplinary center focused on research, training and technique development in the study of materials in extreme conditions.  As part of the NNSA’s Stewardship Science Academic Alliances program, UIC will manage the Chicago/DOE Alliance Center, or CDAC, a Center of Excellence for High Pressure Science and Technology led by Russell Hemley, College of Liberal Arts and Sciences Distinguished Chair in the Natural Sciences and professor of physics and chemistry at UIC.  “The center will continue to increase the visibility of NNSA science and UIC’s leading research to the broader U.S. academic community. We are pleased by UIC’s commitment to the center and excited by the proximity of its headquarters to the Advanced Photon Source at Argonne National Laboratory, with which CDAC partners for research and training, ” said Hemley, who has long been engaged in forefront developments in high-pressure physics, chemistry and materials science.  The center, which had been headquartered in Washington, D.C., since 2003, will continue its coordinated education and outreach program. The program exposes graduate students to extreme conditions science through training at CDAC laboratories and facilitating interactions between NNSA laboratory scientists and academic groups.  CDAC will lead research and training in a broad range of studies of the behavior of materials at various pressures and temperatures, including crystalline solids, fluids and glasses, nanostructured to mesostructured materials, and complex composites.  “This work will expand the boundaries of knowledge in\nmaterials and high pressure science, while also developing the next generation\nof scientists to support the stockpile stewardship mission,” said Mark\nAnderson, assistant deputy administrator for research, development, test and\nevaluation in NNSA’s Office of Defense Programs.  Launched in 2002, the Stewardship Science Academic Alliances program supports areas of fundamental research and development relevant to NNSA’s stockpile stewardship mission and helps recruit the next generation of highly trained scientists and engineers for the Nuclear Security Enterprise.  Additional UIC-affiliated staff involved includes research professors Stephen Gramsch, CDAC deputy director, and Muhtar Ahart, Ravhi Kumar and Zhenxian Liu. External academic partners include researchers from Michigan State University, Northwestern University, University of Buffalo, University of Illinois at Urbana-Champaign, University of Tennessee and University of Utah.     Contact   Brian Flood 312-996-7681  bflood@uic.edu  twitter.com/bflooduic      Categories   Research , Top Faculty Staff News , Top Student News   Topics  chemistry , College of Liberal Arts and Sciences , Department of Energy , material science , physics              ",
    "outlinks": [
        "https://today.uic.edu/author/bflood",
        "https://uic.edu/about/job-opportunities",
        "https://today.uic.edu/campus-news/campus-newspaper/subscribe-to-uic-today",
        "https://today.uic.edu/category/category-research",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://today.uic.edu/academics-research",
        "https://today.uic.edu/resources/photo-video-policies",
        "https://today.uic.edu/tag/department-of-energy",
        "https://today.uic.edu/what-you-need-to-know-about-covid-19",
        "https://library.uic.edu/",
        "https://today.uic.edu/uic-social-media-guidelines-and-best-practices",
        "https://today.uic.edu/campus-news",
        "https://today.uic.edu/category/ts-news",
        "https://today.uic.edu/category/tfs-news",
        "https://today.uic.edu/contact",
        "https://disabilityresources.uic.edu/",
        "https://today.uic.edu/contact/social-media-directory",
        "https://maps.uic.edu/",
        "https://dos.uic.edu/studentveteranaffairs.shtml",
        "https://today.uic.edu/coronavirus",
        "https://today.uic.edu/resources",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/social-media-inquiry-form",
        "https://today.uic.edu/resources/faculty-staff",
        "https://today.uic.edu/in-the-news-covid-19",
        "https://uic.edu/",
        "https://events.uic.edu/",
        "https://today.uic.edu/tag/physics",
        "https://today.uic.edu/news-release/news-release/",
        "https://today.uic.edu/tag/college-of-liberal-arts-and-sciences",
        "https://www.uic.edu/apps/departments-az/search",
        "https://today.uic.edu/teaching-learning-and-working-resources",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/frequently-asked-questions",
        "https://today.uic.edu/events",
        "https://today.uic.edu/tag/material-science",
        "https://today.uic.edu/experts-guide",
        "https://today.uic.edu/",
        "https://today.uic.edu/tag/chemistry",
        "https://today.uic.edu/submit-an-event"
    ]
}