{
    "origin_link": "https://today.uic.edu/uic-physics-and-mathematics-student-named-goldwater-scholar",
    "title": "UIC physics and mathematics student named Goldwater Scholar | UIC Today",
    "contents": "       Skip to main content      Updated: May 01, 2020 at 11:42 AM         Today      Submit       Campus News  Academics & Research  Events  Resources   Current Student Resources  Faculty & Staff Resources  Photography/Video  Social Media Account Request Form  UIC Social Media Guidelines and Best Practices    COVID-19   Frequently Asked Questions  What you need to know about COVID-19  Support for the UIC community (COVID-19)  Teaching, learning and working resources  In the News: COVID-19    Contact   Communicating On Campus  Sending Announcements / DDDH  UIC Social Media Directory                                UIC physics and mathematics student named Goldwater Scholar  April 8, 2020   Lopa Bhatt, a UIC Honors College member who is majoring in physics and mathematics in the College of Liberal Arts and Sciences.  A University of Illinois at Chicago undergraduate student\nstudying electron microscopy has been recognized for her academic achievement\nby the Barry M. Goldwater Scholarship and Excellence Foundation.  Lopa Bhatt, a junior majoring in physics and mathematics in\nthe College of Liberal Arts and Sciences, is the latest UIC student to receive\nthe prominent $7,500 scholarship that will cover tuition, books and related\nfees during the 2020-21 academic year.  Almost 400 recipients in mathematics, science and engineering were selected from an estimated applicant pool of over 5,000 college sophomores and juniors for the Goldwater Scholarship, named for the late Republican senator from Arizona.  Bhatt, a UIC Honors College member from Naperville, has\nstudied in the lab of Robert Klie, UIC professor of physics, where her work has been focused on\nimproving techniques related to the fabrication of graphene-based liquid cells,\nor GLCs.  “Lopa has learned not only how to operate a state-of-the-art\nelectron microscope, she is also able to perform atomic-resolution imaging\nand spectroscopy using electron probes that do not damage the delicate graphene\nliquid cells. This is an extraordinary achievement,” Klie said.  Bhatt is involved in several cutting-edge research projects and will be a co-author on at least three papers, covering a wide range of materials and biomaterials science.  “Previous\nstudies have demonstrated that charged nanoparticles have a wide range of\napplications, from the treatment of diseases, such as cancer and bacterial\ninfections, to the removal of pollutants from water,” she said. “Nevertheless,\nmuch remains unknown about the behavior of charged nanoparticles in aqueous\nsolution, primarily due to the small scale of nanoparticles and the limitations\nof optical microscopes.”  This\ninability to quantify the interactions between the liquid and the charged\nnanoparticles has been a significant barrier to their development and\nimplementation in medical and environmental applications.  “These GLCs can be used to examine solutions through the scanning transmission electron microscope — an instrument that is able to even see the arrangement of atoms in a material,” Bhatt said. “I have been able to improve the GLCs in order to encapsulate the nanoparticles solution and make progress in understanding how the nanoparticles behave in nanoconfined spaces in solutions.”  Last year, she presented research at conferences held by the American Physical Society, Microscopy Society of America and the Oak Ridge National Laboratory.  “Such\nexposure to the research community is unique for an undergraduate student, and\nis the result of Lopa’s outstanding research and presentation skills,” Klie\nsaid.  Her\nfuture academic and professional objectives are to earn a Ph.D. from a top-tier\nmaterials science/condensed matter physics program and become a successful\nresearcher or professor focused on electron microscopy.  Bhatt, who was born in India, moved to the U.S. in 2015. She graduated from Metea Valley High School in 2017 and received the President’s Award Program-Honors Scholarship, which is the Honors College’s most prestigious award and covers four-year tuition and housing for exemplary incoming first-year students.  While at UIC, she has received multiple university honors, including the Chancellor’s Undergraduate Research Award, the UIContest Award for Outstanding Undergraduate Researcher and the College of Liberal Arts and Science Undergraduate Research Initiative Award. The Honors College has also awarded her undergraduate conference travel grants and an undergraduate research grant.  In addition to family and friends, Bhatt credits her achievements in part to the support she’s received at UIC from people such as Klie; Andrew Shulman, senior lecturer in mathematics, statistics and computer science, and Mark Schlossman, professor of physics.  “Some of the\nprofessors at UIC have had a really big impact on my educational career, and it\nis because of them that I have gotten this far,” she said.  UIC’s Office of External Fellowships provides\nadvising and assistance to current undergraduate and professional school\nstudents in finding and applying for a range of nationally and internationally\ncompetitive fellowships, scholarships and grants.  “Lopa’s success in the Goldwater competition — the most prestigious STEM award nationwide for sophomores and juniors involved in research — is a testament to her intellect, dedication and research skills, and it is also evidence of UIC’s strength in providing opportunities and mentoring in and through undergraduate research,” said Kim Germain, director of UIC’s Office of External Fellowships.     Contact   Brian Flood 312-996-7681  bflood@uic.edu  twitter.com/bflooduic      Categories   Students , Top Faculty Staff News , Top Student News   Topics  College of Liberal Arts and Sciences , Goldwater , Honors College , mathematics , Office of External Fellowships , physics              ",
    "outlinks": [
        "https://today.uic.edu/contact/social-media-directory",
        "https://today.uic.edu/author/bflood",
        "https://today.uic.edu/tag/mathematics",
        "https://today.uic.edu/experts-guide",
        "https://events.uic.edu/",
        "https://library.uic.edu/",
        "https://today.uic.edu/resources/social-media-inquiry-form",
        "https://today.uic.edu/tag/office-of-external-fellowships",
        "https://today.uic.edu/resources/faculty-staff",
        "https://today.uic.edu/tag/physics",
        "https://today.uic.edu/coronavirus",
        "https://today.uic.edu/what-you-need-to-know-about-covid-19",
        "https://uic.edu/",
        "https://today.uic.edu/resources",
        "https://today.uic.edu/category/ts-news",
        "https://today.uic.edu/contact",
        "https://today.uic.edu/uic-social-media-guidelines-and-best-practices",
        "https://today.uic.edu/category/tfs-news",
        "https://today.uic.edu/teaching-learning-and-working-resources",
        "https://today.uic.edu/news-release/news-release/",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/campus-news",
        "https://today.uic.edu/tag/goldwater",
        "https://uic.edu/about/job-opportunities",
        "https://today.uic.edu/in-the-news-covid-19",
        "https://today.uic.edu/frequently-asked-questions",
        "https://today.uic.edu/events",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://today.uic.edu/resources/photo-video-policies",
        "https://today.uic.edu/academics-research",
        "https://today.uic.edu/tag/honors-college",
        "https://today.uic.edu/tag/college-of-liberal-arts-and-sciences",
        "https://today.uic.edu/submit-an-event",
        "https://oef.uic.edu/",
        "https://today.uic.edu/category/category-students",
        "https://today.uic.edu/campus-news/campus-newspaper/subscribe-to-uic-today",
        "https://maps.uic.edu/",
        "https://www.uic.edu/apps/departments-az/search",
        "https://emergency.uic.edu/",
        "https://disabilityresources.uic.edu/",
        "https://today.uic.edu/",
        "https://dos.uic.edu/studentveteranaffairs.shtml"
    ]
}