{
    "origin_link": "https://today.uic.edu/ladysmith-black-mambazo-comes-to-uic-to-educate-entertain",
    "title": "Ladysmith Black Mambazo comes to UIC to educate, entertain | UIC Today",
    "contents": "       Skip to main content      Updated: May 08, 2020 at 12:39 PM         Today      Submit       Campus News  Academics & Research  Events  Resources   Current Student Resources  Faculty & Staff Resources  Photography/Video  Social Media Account Request Form  UIC Social Media Guidelines and Best Practices    COVID-19   Frequently Asked Questions  What you need to know about COVID-19  Support for the UIC community (COVID-19)  Teaching, learning and working resources  In the News: COVID-19    Contact   Communicating On Campus  Sending Announcements / DDDH  UIC Social Media Directory                                Ladysmith Black Mambazo comes to UIC to educate, entertain  November 19, 2019   Ladysmith Black Mambazo lead UIC students in a dance during master class. (Photo credit: Joshua Clark)  University of Illinois at Chicago acting student Richard Cantu didn’t hesitate as members of the five-time Grammy-winning Ladysmith Black Mambazo called audience members onto the UIC Theatre stage to join them to sing and take part in learning Zulu dances.  The internationally known South African group was at UIC on Monday to offer a nearly two-hour master class to Cantu and other music and theatre students.     “They were amazing; I thought they were incredibly talented, and it was very gracious for them to come and share their gift with us,” said Cantu, a third-year student who joined other UIC students on stage. “The way they incorporated the audience was a lot of fun. Anytime I get the chance to go up and perform in front of people is a great opportunity.”  The eight-member group, made up of several sons of the ensemble’s founder, Joseph Shabalala, explained how their father came up with the idea in the early 1960s to form the group from a dream.  The music, known as “Isicathamiya,” has its roots in the music developed by Zulu migrant workers in South African mines. Isicathamiya music often is made up of mostly basses, several tenors and a lead vocalist, without any female voices, as the workers in the mines traditionally were men who used music to express their longing for their homes and families, said Sibongiseni Shabalala, a group member and one of the founder’s sons.     “When they started to sing, they discovered that because there were no women there, there were no children, they missed the small voices of their sisters and mothers,” Sibongiseni said. “That is when the Isicathamiya music started…they tried to imitate the voices of the women. It’s not complete until they do the Zulu dance.”  The name “Ladysmith” comes from the South African town where the founder was born and raised. Sibongiseni, along with his brother, Thulani, used the opportunity to teach the 85 people in the audience Zulu words used in their traditional songs as well as dance steps, and they shared how the music was born during the era of Apartheid as a way for his father to help black South Africans.  Among the difficulties the group had in the early days was\ntraveling through the country, as black men were barred from being in groups.\nThe lyrics also could not be explicit to avoid incurring the wrath of the white\ngovernment before Apartheid ended.  “At that time in South Africa, it was difficult as a black person to live in South Africa. He was trying to promote peace and to give hope to black people that one day things would be all right,” Thulani said of his father.  The group became international stars when American singer and songwriter Paul Simon collaborated with the group for his award-winning album, “Graceland,” in 1986. The group also has collaborated and recorded with other icons of American pop music, including Stevie Wonder, Dolly Parton, Sarah McLachlan, Josh Groban, Emmylou Harris, Michael Jackson and Melissa Etheridge.  Thulani Shabalala of Ladysmith Black Mambazo performs. (Photo Credit: Joshua Clark)  The group is in Chicago until January taking part in Steppenwolf\nTheatre’s production of “Lindiwe,” written and co-directed by Eric Simonson,\nwhich features Yasen\nPeyankov , UIC’s head of theatre. Peyankov, who is also a UIC associate\nprofessor and a Steppenwolf Theatre featured ensemble member, invited the\nensemble to UIC as a way to give students an opportunity to learn from the\ngroup.  After working with the ensemble, Peyankov said he felt that the students in the music and acting tracks could learn from the group, which incorporates music, dance and acting in performances.  “Their performances are, in a way, performances on their own; they use voice, but they also use dance, so I felt like this fit the bill for the theatre and music departments,” Peyankov said.  “I hope they [students] learned something about the group, the culture and how you can work as an ensemble in a group of collaborators.”  Christian Ortega, a third-year acting student, said he was impressed with how the group was able to develop and how the music was passed down from the founder to his children and others who are continuing the musical legacy.  “Hearing how it all started from their dad and how they wanted to replicate the sounds of their wives and sisters from home relates so much to me,” Ortega said.  Zac Boehm, a senior in music, said he felt honored that the group chose to share their culture and the background with UIC. He said he loved how interactive the class was and that the group managed to include the audience in their songs and music so “we were part of that for a little bit.”  “Honestly, it was more of a spiritual experience for me,” Boehm said.     Contact   Carlos Sadovi 312-355-2491  csadovi@uic.edu  twitter.com/@carlossadoviuic      Categories   Campus , Featured Campus               ",
    "outlinks": [
        "https://uic.edu/about/job-opportunities",
        "https://today.uic.edu/campus-news/campus-newspaper/subscribe-to-uic-today",
        "https://catalog.uic.edu/ucat/academic-calendar/",
        "https://today.uic.edu/academics-research",
        "https://today.uic.edu/resources/photo-video-policies",
        "https://today.uic.edu/what-you-need-to-know-about-covid-19",
        "https://library.uic.edu/",
        "https://today.uic.edu/uic-social-media-guidelines-and-best-practices",
        "https://today.uic.edu/campus-news",
        "https://today.uic.edu/contact",
        "https://disabilityresources.uic.edu/",
        "https://today.uic.edu/contact/social-media-directory",
        "https://maps.uic.edu/",
        "https://dos.uic.edu/studentveteranaffairs.shtml",
        "https://today.uic.edu/coronavirus",
        "https://today.uic.edu/resources",
        "https://today.uic.edu/resources/current-students",
        "https://today.uic.edu/resources/social-media-inquiry-form",
        "https://theatreandmusic.uic.edu/directory/yasen-m-peyankov",
        "https://today.uic.edu/resources/faculty-staff",
        "https://today.uic.edu/in-the-news-covid-19",
        "https://uic.edu/",
        "https://events.uic.edu/",
        "https://today.uic.edu/category/featured-campus",
        "https://today.uic.edu/news-release/news-release/",
        "https://today.uic.edu/category/category-campus",
        "https://www.uic.edu/apps/departments-az/search",
        "https://today.uic.edu/teaching-learning-and-working-resources",
        "https://emergency.uic.edu/",
        "https://today.uic.edu/frequently-asked-questions",
        "https://today.uic.edu/author/csadovi",
        "https://today.uic.edu/events",
        "https://today.uic.edu/experts-guide",
        "https://today.uic.edu/",
        "https://today.uic.edu/submit-an-event"
    ]
}